[
  {
    "meta": {
      "title": "2023 - A Gaming Year in Review",
      "date": "2024-1-5",
      "tags": "words",
      "slug": "2023_a_gaming_year_in_review"
    },
    "markdown": "---\ntitle: 2023 - A Gaming Year in Review\ndate: 2024-1-5\ndescription:\ntags: words\n---\n\nWith 2023 in the rear-view, I began to reflect on the year from a gaming perspective. It turns out there are a number of things worthy of a shout-out!\n\n### 1. Playing Games\n\nI am a forever GM. I have run way more games than I've played. In 2023 that changed and I found myself playing a LOT more. It really opened my mind to various games and play-styles, and helped hone what I want in a game. This was definitely the biggest revelation and the reason for the rest of the list. If I was going to list a new year's resolution, it would have to be to just play more games. Here's hoping!\n\n### 2. New Games\n\nThe ~~game~~ toolset of the year for me was [Named](https://wightbred.itch.io/named-toolkit). I'm a big fan of playing into a character and thus, I gravitate towards tag-based character builds. Named uses epithets called--strangely enough--`Names`. While similar to tags, for my money, they add more juice. I see them as things people call your character... or whisper behind their back. This is a small but important distinction; YMMV.\n\nMore interesting still is how Named handles advancement through `Reflections`. At the end of a session, the table talks about what each character did in the game. Did they earn a new Name? Did a name not fit or need changing? It's easily the best advancement system I've ever seen... and now it's mine; MINE! :D\n\nI was fortunate to get the full hat-trick with Named. I played it, [podcasted it](https://playworldspodcast.com/#tags?t=skypirates-of-jotnaar) and contributed to a setting for it: [Skypirates of Jotnaar](https://wightbred.itch.io/skypirates-of-jotnaar) (that is REALLY cool if I do say so myself).\n\nHonorable mention for Dr. Paul's [Palaeolithic Voyages](https://www.lulu.com/shop/paul-jennings-and-kitty-hiraeth/palaeolithic-voyages/paperback/product-kpmy8y.html). You can keep your +1 swords; just gimme a good rock and some flint! I really wanna play more of this system.\n\n### 3. New Genre\n\nI played my first game of Delta Green. For whatever reason, I'm not drawn to Cthulhu games but I  dig Delta Green. It comes down to the twist: characters are not trying to solve a mystery; they are trying to stop/contain/suppress/clean up a problem. More MIB or X-Files than straight Lovecraftian cosmic horror. Really fun game.\n\nI look forward to reflecting on 2024!",
    "html": "<p>With 2023 in the rear-view, I began to reflect on the year from a gaming perspective. It turns out there are a number of things worthy of a shout-out!</p>\n<h3 id=\"1playinggames\">1. Playing Games</h3>\n<p>I am a forever GM. I have run way more games than I've played. In 2023 that changed and I found myself playing a LOT more. It really opened my mind to various games and play-styles, and helped hone what I want in a game. This was definitely the biggest revelation and the reason for the rest of the list. If I was going to list a new year's resolution, it would have to be to just play more games. Here's hoping!</p>\n<h3 id=\"2newgames\">2. New Games</h3>\n<p>The <del>game</del> toolset of the year for me was <a href=\"https://wightbred.itch.io/named-toolkit\">Named</a>. I'm a big fan of playing into a character and thus, I gravitate towards tag-based character builds. Named uses epithets called--strangely enough--<code>Names</code>. While similar to tags, for my money, they add more juice. I see them as things people call your character… or whisper behind their back. This is a small but important distinction; YMMV.</p>\n<p>More interesting still is how Named handles advancement through <code>Reflections</code>. At the end of a session, the table talks about what each character did in the game. Did they earn a new Name? Did a name not fit or need changing? It's easily the best advancement system I've ever seen… and now it's mine; MINE! :D</p>\n<p>I was fortunate to get the full hat-trick with Named. I played it, <a href=\"https://playworldspodcast.com/#tags?t=skypirates-of-jotnaar\">podcasted it</a> and contributed to a setting for it: <a href=\"https://wightbred.itch.io/skypirates-of-jotnaar\">Skypirates of Jotnaar</a> (that is REALLY cool if I do say so myself).</p>\n<p>Honorable mention for Dr. Paul's <a href=\"https://www.lulu.com/shop/paul-jennings-and-kitty-hiraeth/palaeolithic-voyages/paperback/product-kpmy8y.html\">Palaeolithic Voyages</a>. You can keep your +1 swords; just gimme a good rock and some flint! I really wanna play more of this system.</p>\n<h3 id=\"3newgenre\">3. New Genre</h3>\n<p>I played my first game of Delta Green. For whatever reason, I'm not drawn to Cthulhu games but I  dig Delta Green. It comes down to the twist: characters are not trying to solve a mystery; they are trying to stop/contain/suppress/clean up a problem. More MIB or X-Files than straight Lovecraftian cosmic horror. Really fun game.</p>\n<p>I look forward to reflecting on 2024!</p>"
  },
  {
    "meta": {
      "title": "A Magic System",
      "date": "2021-5-2",
      "description": "A simple magic system for any game... but intended as an alternative to the system in World of Dungeons.",
      "tags": "magic, rules, wodu",
      "slug": "a_magic_system"
    },
    "markdown": "---\ntitle: A Magic System\ndate: 2021-5-2\ndescription: A simple magic system for any game... but intended as an alternative to the system in World of Dungeons.\ntags: magic, rules, wodu\n---\n\n_v 1.6_\n\n> The door to magic is closed for most; some few may find it ajar; _fewer still_ may pick the door's lock altogether. Aptitude for the craft is is not unusual but is often misinterpreted. Great magic requires _constant practice_. The best magi are not always the most gifted; just _persistent_.\n\n> **Magic is dangerous**; spells go poorly and the consequences can be... severe.\n\n<break>\n\n### Mechanics\n\n**You can master spells equal to your level + 2** (eg. 1st level magi have mastered 3 spells).\n\nCasting spells takes a physical toll. **You can safely cast spells equal to your `hd + con`** (ie. _spell slots_). Above that, you take `1d6+lvl` damage for each spell cast. Safe casting is restored after resting in _comfort and safety_.\n\n**Mages add `int` to their casting rolls; clerics add `wis`** (eg. `2d6+int/wis`) and your `level` to damage rolls (eg. `2d6+lvl`). You gain an extra `d6` of damage at levels 5 & 10.\n\nWhen you level up, you may swap mastered spells for new ones.\n\n\n### Scrolls\n\n**You may attempt to cast spells from written texts**. This requires more casting time while you read/review the spell (ie. _a turn_) and expends a _spell slot_.\n\nIt is wise to identify a spell before casting it!\n\n\n### Enhancements\n\n[_Enhancement_ spells](https://brine.dev/#spellTags?t=enhancement) are cast in conjunction with a target spell. They augment spell casting and/or effect, and expend a _spell slot_ in addition to the target spell.\n\n### Mishaps\n\n**Magic is dangerous**. A failed casting roll may have consequences; a critical fail always will.\n\nAn example mishap table:\n\n  1. the target reflects the spell back at caster\n  1. 1d6 damage to the caster\n  3. the caster is blinded/frozen/afraid/etc... for a short time\n  4. the spell affects the party in some way (depending on the spell)\n  5. the caster turns blue\n  6. nothing happens... _lucky_\n\n\n### Addendum\n\nPresented as an alternate/additional magic system for [World of Dungeons](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf).\n\nI have a [growing list of spells](/#spells) and/or allow players to create their own.",
    "html": "<p><em>v 1.6</em></p>\n<blockquote>\n  <p>The door to magic is closed for most; some few may find it ajar; <em>fewer still</em> may pick the door's lock altogether. Aptitude for the craft is is not unusual but is often misinterpreted. Great magic requires <em>constant practice</em>. The best magi are not always the most gifted; just <em>persistent</em>.</p>\n  <p><strong>Magic is dangerous</strong>; spells go poorly and the consequences can be… severe.</p>\n</blockquote>\n<p><break></p>\n<h3 id=\"mechanics\">Mechanics</h3>\n<p><strong>You can master spells equal to your level + 2</strong> (eg. 1st level magi have mastered 3 spells).</p>\n<p>Casting spells takes a physical toll. <strong>You can safely cast spells equal to your <code>hd + con</code></strong> (ie. <em>spell slots</em>). Above that, you take <code>1d6+lvl</code> damage for each spell cast. Safe casting is restored after resting in <em>comfort and safety</em>.</p>\n<p><strong>Mages add <code>int</code> to their casting rolls; clerics add <code>wis</code></strong> (eg. <code>2d6+int/wis</code>) and your <code>level</code> to damage rolls (eg. <code>2d6+lvl</code>). You gain an extra <code>d6</code> of damage at levels 5 &amp; 10.</p>\n<p>When you level up, you may swap mastered spells for new ones.</p>\n<h3 id=\"scrolls\">Scrolls</h3>\n<p><strong>You may attempt to cast spells from written texts</strong>. This requires more casting time while you read/review the spell (ie. <em>a turn</em>) and expends a <em>spell slot</em>.</p>\n<p>It is wise to identify a spell before casting it!</p>\n<h3 id=\"enhancements\">Enhancements</h3>\n<p><a href=\"https://brine.dev/#spellTags?t=enhancement\"><em>Enhancement</em> spells</a> are cast in conjunction with a target spell. They augment spell casting and/or effect, and expend a <em>spell slot</em> in addition to the target spell.</p>\n<h3 id=\"mishaps\">Mishaps</h3>\n<p><strong>Magic is dangerous</strong>. A failed casting roll may have consequences; a critical fail always will.</p>\n<p>An example mishap table:</p>\n<ol>\n<li>the target reflects the spell back at caster</li>\n<li>1d6 damage to the caster</li>\n<li>the caster is blinded/frozen/afraid/etc… for a short time</li>\n<li>the spell affects the party in some way (depending on the spell)</li>\n<li>the caster turns blue</li>\n<li>nothing happens… <em>lucky</em></li>\n</ol>\n<h3 id=\"addendum\">Addendum</h3>\n<p>Presented as an alternate/additional magic system for <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons</a>.</p>\n<p>I have a <a href=\"/#spells\">growing list of spells</a> and/or allow players to create their own.</p>"
  },
  {
    "meta": {
      "title": "A TTRPG Manifesto",
      "date": "2023-10-1",
      "description": "A TTRPG Manifesto",
      "tags": "words",
      "slug": "a_ttrpg_manifesto"
    },
    "markdown": "---\ntitle: A TTRPG Manifesto\ndate: 2023-10-1\ndescription: A TTRPG Manifesto\ntags: words\n---\n\nWe are exploring different approaches to TTRPGs. Through play we have come to value:\n\n- A shared understanding of a world over rules\n- Table trust over systems\n- Immersion over character sheets\n- Conversation and negotiation over procedures\n\nThat is, while there is value in the elements on the right, we value the elements on the left more.\n",
    "html": "<p>We are exploring different approaches to TTRPGs. Through play we have come to value:</p>\n<ul>\n<li>A shared understanding of a world over rules</li>\n<li>Table trust over systems</li>\n<li>Immersion over character sheets</li>\n<li>Conversation and negotiation over procedures</li>\n</ul>\n<p>That is, while there is value in the elements on the right, we value the elements on the left more.</p>"
  },
  {
    "meta": {
      "title": "Accidental FKR",
      "date": "2022-5-12",
      "description": "FKR is gaming as the KISS theory is to everything else?",
      "tags": "acronym, rules, words",
      "slug": "accidental_fkr"
    },
    "markdown": "---\ntitle: Accidental FKR\ndate: 2022-5-12\ndescription: FKR is gaming as the KISS theory is to everything else?\ntags: acronym, rules, words\n---\n\nMy game has been unintentionally _molting_ toward **FKR**. It started before ever hearing the term. It just kinda happened and I continue to enjoy its inherent permission for further mutations.\n\nDuring a hiatus from D&D 5E, I found myself reading other game systems; exploring their rules (or lack thereof) and ideas. Honestly, I hadn't put together that I wanted to run another system. I was just being curious. Bits and pieces of various systems started to click; most notably, [Dungeon World](https://dungeon-world.com).\n\nHilariously, I've never run Dungeon World; nor do I have interest in doing so. I don't find it to be a particularly compelling game, but rather a fantastic GM reference! Just reading it changed the way I run games. It also illuminated my want of a different ruleset: something simpler; more inclusive. I didn't need to look very far (even if I did)... DW lead me right to [World of Dungeons (WoDu)](https://johnharper.itch.io/world-of-dungeons).\n\nThere are a number of things in WoDu that changed my game forever (`2d6` & `Die of Fate` come to mind) but in terms of FKR, it was _the holes_. _What do these Skills do? How do rituals work? Decipher?_ The old GM in me would have thought: _\"okay, I need to figure out all this shit before we play\"_. But thanks to my exploration of other rulesets, I was able to give myself permission to put these questions to _my group_. My players really took to this inclusive approach to rule creation. It's very likely why we've been playing for so long (going on 3 years)! Lighter rules also lead to less character sheet-gazing and more creativity. I was hooked!\n\nTwo years later, I published some of these _house rules_ as [Beasts & Barrows](https://casadeocio.itch.io/beasts-barrows). But shortly thereafter, even BnB started feeling heavy to me. So with an inspiring nudge from [2400](https://jasontocci.itch.io/2400), I took another step and revamped them into their new, unfinished form: [1420 Beasts & Barrows](https://casadeocio.itch.io/1420-bnb). The most notable differences being the lack of stats and d6 dice pool skills. This new ruleset is currently peculating with my regular crew.\n\nFor the record, I have no desire to debate what is/isn't FKR. I am not an authority; nor do I wish to be. I purposely refrained from explaining it or linking it to anything here. I prefer its definition to remain elusive and open. I find my game jives with the idea of FKR more than other rpg philosophies (for lack of a better term). YMMV.",
    "html": "<p>My game has been unintentionally <em>molting</em> toward <strong>FKR</strong>. It started before ever hearing the term. It just kinda happened and I continue to enjoy its inherent permission for further mutations.</p>\n<p>During a hiatus from D&amp;D 5E, I found myself reading other game systems; exploring their rules (or lack thereof) and ideas. Honestly, I hadn't put together that I wanted to run another system. I was just being curious. Bits and pieces of various systems started to click; most notably, <a href=\"https://dungeon-world.com\">Dungeon World</a>.</p>\n<p>Hilariously, I've never run Dungeon World; nor do I have interest in doing so. I don't find it to be a particularly compelling game, but rather a fantastic GM reference! Just reading it changed the way I run games. It also illuminated my want of a different ruleset: something simpler; more inclusive. I didn't need to look very far (even if I did)… DW lead me right to <a href=\"https://johnharper.itch.io/world-of-dungeons\">World of Dungeons (WoDu)</a>.</p>\n<p>There are a number of things in WoDu that changed my game forever (<code>2d6</code> &amp; <code>Die of Fate</code> come to mind) but in terms of FKR, it was <em>the holes</em>. <em>What do these Skills do? How do rituals work? Decipher?</em> The old GM in me would have thought: <em>\"okay, I need to figure out all this shit before we play\"</em>. But thanks to my exploration of other rulesets, I was able to give myself permission to put these questions to <em>my group</em>. My players really took to this inclusive approach to rule creation. It's very likely why we've been playing for so long (going on 3 years)! Lighter rules also lead to less character sheet-gazing and more creativity. I was hooked!</p>\n<p>Two years later, I published some of these <em>house rules</em> as <a href=\"https://casadeocio.itch.io/beasts-barrows\">Beasts & Barrows</a>. But shortly thereafter, even BnB started feeling heavy to me. So with an inspiring nudge from <a href=\"https://jasontocci.itch.io/2400\">2400</a>, I took another step and revamped them into their new, unfinished form: <a href=\"https://casadeocio.itch.io/1420-bnb\">1420 Beasts & Barrows</a>. The most notable differences being the lack of stats and d6 dice pool skills. This new ruleset is currently peculating with my regular crew.</p>\n<p>For the record, I have no desire to debate what is/isn't FKR. I am not an authority; nor do I wish to be. I purposely refrained from explaining it or linking it to anything here. I prefer its definition to remain elusive and open. I find my game jives with the idea of FKR more than other rpg philosophies (for lack of a better term). YMMV.</p>"
  },
  {
    "meta": {
      "title": "Beasts &amp; Barrows",
      "date": "2021-9-12",
      "description": "**Beasts &amp; Barrows** is an uncomplicated fantasy role-playing game (RPG) that values role-play, simplicity and flexibility.",
      "tags": "BnB, rules",
      "slug": "beasts_and_barrows"
    },
    "markdown": "---\ntitle: Beasts & Barrows\ndate: 2021-9-12\ndescription: **Beasts & Barrows** is an uncomplicated fantasy role-playing game (RPG) that values role-play, simplicity and flexibility.\ntags: BnB, rules\n---\n\nby <a href=\"https://brine.dev\">brine</a> - <version>_v 1.0_</version>\n\n**Beasts & Barrows** is an uncomplicated fantasy role-playing game (RPG) for 2-5 players + Game Maestro (GM). It steals blatantly from John Harper's [World of Dungeons](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) and shares the same [PbtA](http://apocalypse-world.com/pbta) core mechanic (`2d6`). ~~YOU ARE FORBIDDEN TO HACK THIS!~~\n\n**Beasts & Barrows (B&B)** values:\n  - **role-play:** rules and mechanics emphasize and encourage role-play\n  - **simplicity:** less math; less rules; more fun\n  - **show, don't tell:** don't _tell_ me your alignment... _show_ me your alignment; don't _tell_ me you attack; _describe_ your attack\n  - **flexibility:** running existing adventures from _any_ system is trivial\n\n<break>\n\n<div class=\"pagebreak\"></div>\n\n### Character Creation\n\n**What kind of character sounds fun to play?** Rolling a new character takes _ones of minutes_. This question will likely take the longest to answer. Here are some classic examples but you are free to create your own:\n\n  - **Warrior:** strong and good with the stabby stab\n  - **Thief:** nimble and sneaky sneaksters\n  - **Mage:** smart and full of arcaney goodness\n  - **Priest:** wise and has a direct line to the gods\n\n> Outside of the _classic classes_, players are encouraged to create their own by making clever use of the existing `Skills and Abilities`. For example an **Alchemist** might require `Lore` and create their potions via `Rituals`?\n\n**What race is your character?** Human? Elf? Orc? While there are no statistical bonuses for race, they can add flavor to a character through role-play.\n\n> The _exception that proves the rule_: GMs may allow PCs to have `darkvision` or an additional `language`, provided the player offers sound reasoning to do so.\n\n**What `Attributes` does your character have?** Roll `2d6` for each of the following six character `Attributes` and assign the results in any order you wish.\n\n  - **strength (`str`):** for melee attacks; climbing; lifting\n  - **dexterity (`dex`):** for ranged attacks; stealth; dodging\n  - **intelligence (`int`):** for casting mage spells; memory; deduction\n  - **wisdom (`wis`):** for casting cleric spells; perception; searching\n  - **charisma (`cha`):** for persuasion; deception; intimidation\n  - **constitution (`con`):** for additional HD; physical fortitude; resist poisons;\n\nOn a:\n  - **2** the value is -1\n  - **3-6** the value is 0\n  - **7-9** the value is +1\n  - **10-11**, the value is +2\n  - **12**, the value is +3.\n\n> Note: **B&B** only makes use of **modifiers** (eg. `+2`); not the number rolled.\n\n**Choose two `Skills` and two `Abilities`:**\n\n#### Skills\nWhen a PC attempts something in the fiction that might be covered by a skill (eg. Athletics when climbing), they roll _advantage_ (`3d6` keeping the highest 2) `+ mod`.\n\n- **Athletics:** `+str/dex`: feats of strength and dexterity\n- **Awareness:** `+wis`: perceiving the environment around you\n- **Deception:** `+cha`: attempt to deceive\n- **Decipher:** `+int`: attempt to discern patterns in texts, symbols or numbers\n- **Heal:** `+wis`: provide an extra `Hit Die (HD)` to the party when resting/rolling `Hit Points (HP)`; heal `1d6+level HP` with your touch.\n- **Lore:** `+int`: consult your accumulated knowledge about something\n- **Stealth:** `+dex`: attempt to be sneaky\n- **Survival:** `+con/wis`: foraging, hunting; start a fire in unfavorable conditions, etc\n- **Sway:** `+cha`: use leverage to influence someone; diplomacy; intimidate; parley\n\n#### Abilities\nAdd additional flavor to a class. The word _attempt_ will generally signify rolling a `2d6+mod` when applicable.\n\n- **Backstab:** +3 damage from concealment\n- **Bless:** anoint items with holy water for +/-3 damage and as magical\n- **[Cantrips](https://brine.dev/#spellTags?t=cantrip):** cast 3 simple magical spells at will\n- **[Cast](http://lvh.me:4242/#spells):** cast level-less magical spells (see `Magic`)\n- **Connected:** you seem to have an acquaintance in every town\n- **Hardy:** +6 `HP`\n- **Linguist:** you are fluent in all civilized languages\n- **Lucky:** turn a miss into a partial success once per day\n- **Penitent:** when you take damage and embrace the pain, take advantage on your next roll\n- **Pet:** you have a loyal and _effective_ animal companion\n- **Reflexes:** you always act first and cannot be surprised\n- **Ritual:** attempt occult rituals; detailed in ancient tomes and scrolls\n- **Scout:** with you on point, your party covers more ground; you always spot targets before they spot you\n- **Shield:** when you wear no armor or shield, your faith protects you and grants you 2 armor\n- **Shift:** take the shape of an animal whose blood you've tasted (successful `con` roll to revert)\n- **Skirmish:** +1 damage; worn armor counts as one type lighter\n- **Slay:** +2 melee damage\n- **Tinker:** pick a lock, pocket or trap w/ tools\n- **Tough:** +1 armor\n- **Turn:** attempt to hold undead at bay with your faith and holy symbol\n- **Versed:** you share secret signs, speech and signals with your brethren\n- **Vision:** commune with your deity or demon via holy water/drugs\n- **Volley:** +2 ranged damage\n- **Wild:** converse with and attempt to command animals\n\n\n**Can your character take a hit?** You start with 1 Hit Die (`d6`) + additional hit dice equal to your `con`. **Roll all your hit dice and keep a number equal to your level** to determine your `HP`. For example, a 1st level PC with +1 con would roll `2d6` and keep the higher of the two.\n\nWhen you rest in `comfort and safety`, and consume food/drink, you may reroll your `HP`. This is the amount of damage you can suffer before you take your `Last Breath`. You add additional hit dice if you: are attended by a healer; rest in a spiritual place.\n\n  > A player may choose to reroll `HP` and find their PC now has _less_ `HP`. We all have bad days. Are they sick? Did they stay up drinking all night?\n\n<div class=\"pagebreak\"></div>\n\n### Magic\n\n**You can master spells equal to your level + 2** (eg. 1st level magi have mastered 3 spells).\n\nCasting spells takes a physical toll. **You can safely cast spells equal to your `hd + con`** (ie. _spell slots_). Above that, you take `1d6+lvl` damage for each spell cast. Safe casting is restored after resting in _comfort and safety_.\n\n**Mages add `int` to their casting rolls; clerics add `wis`** (eg. `2d6+int/wis`) and your `level` to damage rolls (eg. `2d6+lvl`). You gain an extra `d6` of damage at levels 5 & 10.\n\n  > Each time you level up, you may swap mastered spells for new ones.\n\n#### Scrolls\n\n**You may attempt to cast spells from written texts**. This requires more casting time while you read/review the spell (ie. _a turn_) and expends a _spell slot_.\n\n  > It is wise to identify a spell before casting it!\n\n#### Enhancements\n\n[_Enhancement_ spells](https://brine.dev/#spellTags?t=enhancement) are cast in conjunction with a target spell. They augment spell casting and/or effect, and expend a _spell slot_ in addition to the target spell.\n\n#### Mishaps\n**Magic is dangerous**. A failed casting roll may have consequences; a critical fail always will.\n\nAn example mishap table:\n\n  1. the target reflects the spell back at caster\n  1. `1d6+lvl` damage to the caster\n  3. the caster is blinded/frozen/afraid/etc... for a short time\n  4. the spell affects the party in some way (depending on the spell)\n  5. the caster turns blue\n  6. nothing happens... _lucky you!_\n\n\n### Playing the Game\n**Narrate your character's actions**. Eg. instead of saying: _I attack with my sword_; say things like: _with my sword drawn; stained with the blood and entrails of the orc at my feet; I charge the last remaining orc, smiting it with both hands and all the might left in me_... _or something less dramatic :) . Don't _say_ you do a thing; _describe_ how you do a thing.\n\n**Not all actions require a roll**. Say what your character does and the GM will handle the rest.\n\n**When you attempt something risky**, sum `2d6` and add one of your skill modifiers, based on the action you’re taking. (The GM will tell you some of the possible consequences before you roll, so you can decide if it’s worth the risk or if you want to revise your action).\n\n  - **2(snake eyes) is a critical failure**: shit hits the fan.\n  - **3-6 is a miss**: things don’t go well and the risk turns out badly.\n  - **7-9 is a partial success**: you do it but at a cost, compromise, retribution, retaliation, harm, etc.\n  - **10-11 is a full success**: you do it without complications.\n  - **12 (boxcars) is a critical success**: you do it perfectly to some extra benefit.\n\n  > A miss or a partial success might incur an enemy attack; damage; an additional threat; a lost item/resource/opportunity; a disadvantage; an unwelcome truth. They add to the role-play and can amp up the tension in a scene.\n\n#### Die of Fate\n**Sometimes the GM will roll the `die of fate` to see how a situation unfolds**. Low numbers are ill-fortune; high numbers are good fortune. The die of fate might be rolled to establish the weather, indicate a random NPC’s general attitude, to determine if a wandering monster appears, or the moral of a monster. The GM may also roll the die of fate if the PCs take some action for which sheer chance is the only factor in the outcome. **You will roll this often!**\n\n<div class=\"pagebreak\"></div>\n\n### Gear\n**You have `12+con` inventory slots**. Items you can hold in one hand take one slot; items that might require two hands to hold take two slots. One slot examples: worn armor/clothes (two slots if carried); a few daggers; a bag containing 250 coins. Two slot examples: martial/great weapons; large shields; animal trap; wine casks. When carrying more items than you have slots, you are `encumbered` (disadvantage on rolls involving physicality).\n\n> Inventory slots are meant to be more _concept than rule_. The intent is to remind players of the _useful_ items their PCs are carrying, while providing a reasonable amount they are _able_ to carry.\n\n**You start with `2d6*10` silver coins...**\n\n  - **Light Weapon** (10s): `d6`. May be wielded as a secondary weapon, _allowing you to reroll damage once per attack_. Includes daggers, short swords, and hand axes.\n  - **Martial Weapon** (30s): `d6+1`. Must be wielded in main hand. Includes long swords, hammers, axes, spears etc.\n  - **Great Weapon** (40s): `d6+2` damage. Uses two hands. Includes two-handed swords, battle-axes and pole arms.\n  - **Shortbow** (10s): d6. Also slings etc.\n  - **Bow** (30s): `d6+1`. Also crossbows, pistols etc.\n  - **Heavy Bow/Gun** (50s): `d6+2` Damage if firing from a _stationary position_. Includes crossbows and muskets.\n  - **Light Armor** (30s): Armor 1 (subtracted from damage taken).\n  - **Full Armor** (60s): Armor 2. Always has a helm. Makes it very hard to run, move quietly, swim, leap etc.\n  - **Shield** (10s): +1 Armor.\n  - **Backpack** (2s): Can hold 12 items up to 40lbs.\n  - **Adventuring Gear** (2s each): 20ft Rope, Iron Spike, Chalk, Parchment, Flint/Steel, Torches (4), Tent, Dice, Caltrops (slows pursuers), Bandages, Travel Rations, Waterskin, Wineskin.\n  - **Tools** (5s each): Crowbar, Hatchet, Animal Trap, Lockpicks, Pen & Pot of Ink, Fishing Pole, Shovel, Grappling Hook, Pickaxe, Collapsible Pole.\n  - **Occult Items** (10s each): Quicksilver (per dose), Pouch of Bone Dust, Vial of Holy Water (one use), Vial of Blood, Ritual Incense and Oils.\n  - **Fancy Items** (20s each): Mirror, Lantern, Spyglass, Sand Timer, Board Game, Elaborate Clothes, Holy Symbols and other charms.\n  - **Fire Oil** (20s per flask): Sets an area on fire (`d6+1` damage/round for 3 rounds unless extinguished). Fills a lantern 10 times.\n  - **Boats:** Rowboat (50s) to Galley (200,000s).\n  - **Carts:** Cart (30s) to Wagon (100s).\n  - **Taverns:** 1s to Sleep, 1s to Eat, 1s to Get Drunk.\n  - **Property:** House (1,000s) to Manor (100,000).\n  - **Horses:** Mule (30s), Horse (100s), Warhorse (1,000s).\n\n\n### Hirelings\nCost per day\n\n  - **Torch Bearer** (2s): 3HP, Knife.\n  - **Guide** (5s): 6HP, Knife, Lantern, Rope.\n  - **Armsman** (20s): 12HP, Spear, Shield, Light Armor.\n  - **Expert** (20s): 6HP, Skill 4, Dagger, Bow.\n  - **Champion** (60s): 18HP, Full Armor, Halberd, Sword, Shield, Dagger.\n\n\n### Levels\n_As you level up you get rewards according to the table below..._\n\nlevel |   hd   | skills | attributes | abils| damage\n:----:|:------:|:------:|:----------:|:----:|:------:\n 1    | 1+con  | 1+1    |            | 2    |\n 2    | +1     |        |            |      |\n 3    |        | +1     |            | +1   |\n 4    | +1     |        | +1 (max +3)|      |\n 5    |        |        |            |      | +1d6\n 6    | +1     | +1     |            |      |\n 7    |        |        | +1 (max +3)| +1   |\n 8    | +1     |        |            |      |\n 9    |        | +1     |            | +1   |\n 10   | +1     |        | +1 (max +3)|      | +1d6\n\n\n**B&B** uses **Milestones** to measure a player character's development. The GM sets a goal(s) for the PCs to accomplish before they can reach the next level. Each level should be twice as hard to achieve (give or take). Milestones might include:\n  - merely surviving their first encounter\n  - obtaining a MacGuffin\n  - completing a quest\n  - defeating a boss\n  - failures... always a formidable teacher\n\n### Last Breath\nWhen a PC's `HP` drops to 0, they must roll `2d6+con`:\n\n  On a:\n  - **6-**: you're dead; roll a new character :rip:\n  - **7-9:** you will meet **Death** and bargain for your life. SPOILER: _Death can be a dick!_\n  - **10+:** you feel like hammered shit... but you're alive\n\n### True Names\nTrue names have power; knowing a true name gives you power over _the named_. Calling to someone by their `True Name` gives them advantage on `Last Breath` rolls.\n\n<div class=\"pagebreak\"></div>\n\n\n### GMs\nThe following are friendly suggestions for GMing **B&B**. As always, do what's right for you or your players.\n\n  - **Initiative:** The coolest part of `Initiative`... is saying **roll initiative!** Given a group of reasonable size (2-5 PCs), _cinematic jump cuts_ (camera-like jumps between players/situations; that follow the narrative) are a great alternative. It also works well with a split party.\n  - **Splitting the Party:** ALWAYS split the party. It's a hoot.\n  - **Balancing Encounters:** Don't do it! PCs should be smart enough to know when they're outmatched. If not, there's always `Last Breath`. Outside of that, rolling new characters is a snap in **B&B** :)\n  - **Magic Items:** resist issuing +1 _to hit_ items; rather give +1 to damage or something more situational\n",
    "html": "<p>by <a href=\"https://brine.dev\">brine</a> - <version><em>v 1.0</em></version></p>\n<p><strong>Beasts & Barrows</strong> is an uncomplicated fantasy role-playing game (RPG) for 2-5 players + Game Maestro (GM). It steals blatantly from John Harper's <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons</a> and shares the same <a href=\"http://apocalypse-world.com/pbta\">PbtA</a> core mechanic (<code>2d6</code>). <del>YOU ARE FORBIDDEN TO HACK THIS!</del></p>\n<p><strong>Beasts & Barrows (B&B)</strong> values:</p>\n<ul>\n<li><strong>role-play:</strong> rules and mechanics emphasize and encourage role-play</li>\n<li><strong>simplicity:</strong> less math; less rules; more fun</li>\n<li><strong>show, don't tell:</strong> don't <em>tell</em> me your alignment… <em>show</em> me your alignment; don't <em>tell</em> me you attack; <em>describe</em> your attack</li>\n<li><strong>flexibility:</strong> running existing adventures from <em>any</em> system is trivial</li>\n</ul>\n<p><break></p>\n<div class=\"pagebreak\"></div>\n<h3 id=\"charactercreation\">Character Creation</h3>\n<p><strong>What kind of character sounds fun to play?</strong> Rolling a new character takes <em>ones of minutes</em>. This question will likely take the longest to answer. Here are some classic examples but you are free to create your own:</p>\n<ul>\n<li><strong>Warrior:</strong> strong and good with the stabby stab</li>\n<li><strong>Thief:</strong> nimble and sneaky sneaksters</li>\n<li><strong>Mage:</strong> smart and full of arcaney goodness</li>\n<li><strong>Priest:</strong> wise and has a direct line to the gods</li>\n</ul>\n<blockquote>\n  <p>Outside of the <em>classic classes</em>, players are encouraged to create their own by making clever use of the existing <code>Skills and Abilities</code>. For example an <strong>Alchemist</strong> might require <code>Lore</code> and create their potions via <code>Rituals</code>?</p>\n</blockquote>\n<p><strong>What race is your character?</strong> Human? Elf? Orc? While there are no statistical bonuses for race, they can add flavor to a character through role-play.</p>\n<blockquote>\n  <p>The <em>exception that proves the rule</em>: GMs may allow PCs to have <code>darkvision</code> or an additional <code>language</code>, provided the player offers sound reasoning to do so.</p>\n</blockquote>\n<p><strong>What <code>Attributes</code> does your character have?</strong> Roll <code>2d6</code> for each of the following six character <code>Attributes</code> and assign the results in any order you wish.</p>\n<ul>\n<li><strong>strength (<code>str</code>):</strong> for melee attacks; climbing; lifting</li>\n<li><strong>dexterity (<code>dex</code>):</strong> for ranged attacks; stealth; dodging</li>\n<li><strong>intelligence (<code>int</code>):</strong> for casting mage spells; memory; deduction</li>\n<li><strong>wisdom (<code>wis</code>):</strong> for casting cleric spells; perception; searching</li>\n<li><strong>charisma (<code>cha</code>):</strong> for persuasion; deception; intimidation</li>\n<li><strong>constitution (<code>con</code>):</strong> for additional HD; physical fortitude; resist poisons;</li>\n</ul>\n<p>On a:</p>\n<ul>\n<li><strong>2</strong> the value is -1</li>\n<li><strong>3-6</strong> the value is 0</li>\n<li><strong>7-9</strong> the value is +1</li>\n<li><strong>10-11</strong>, the value is +2</li>\n<li><strong>12</strong>, the value is +3.</li>\n</ul>\n<blockquote>\n  <p>Note: <strong>B&B</strong> only makes use of <strong>modifiers</strong> (eg. <code>+2</code>); not the number rolled.</p>\n</blockquote>\n<p><strong>Choose two <code>Skills</code> and two <code>Abilities</code>:</strong></p>\n<h4 id=\"skills\">Skills</h4>\n<p>When a PC attempts something in the fiction that might be covered by a skill (eg. Athletics when climbing), they roll <em>advantage</em> (<code>3d6</code> keeping the highest 2) <code>+ mod</code>.</p>\n<ul>\n<li><strong>Athletics:</strong> <code>+str/dex</code>: feats of strength and dexterity</li>\n<li><strong>Awareness:</strong> <code>+wis</code>: perceiving the environment around you</li>\n<li><strong>Deception:</strong> <code>+cha</code>: attempt to deceive</li>\n<li><strong>Decipher:</strong> <code>+int</code>: attempt to discern patterns in texts, symbols or numbers</li>\n<li><strong>Heal:</strong> <code>+wis</code>: provide an extra <code>Hit Die (HD)</code> to the party when resting/rolling <code>Hit Points (HP)</code>; heal <code>1d6+level HP</code> with your touch.</li>\n<li><strong>Lore:</strong> <code>+int</code>: consult your accumulated knowledge about something</li>\n<li><strong>Stealth:</strong> <code>+dex</code>: attempt to be sneaky</li>\n<li><strong>Survival:</strong> <code>+con/wis</code>: foraging, hunting; start a fire in unfavorable conditions, etc</li>\n<li><strong>Sway:</strong> <code>+cha</code>: use leverage to influence someone; diplomacy; intimidate; parley</li>\n</ul>\n<h4 id=\"abilities\">Abilities</h4>\n<p>Add additional flavor to a class. The word <em>attempt</em> will generally signify rolling a <code>2d6+mod</code> when applicable.</p>\n<ul>\n<li><strong>Backstab:</strong> +3 damage from concealment</li>\n<li><strong>Bless:</strong> anoint items with holy water for +/-3 damage and as magical</li>\n<li><strong><a href=\"https://brine.dev/#spellTags?t=cantrip\">Cantrips</a>:</strong> cast 3 simple magical spells at will</li>\n<li><strong><a href=\"http://lvh.me:4242/#spells\">Cast</a>:</strong> cast level-less magical spells (see <code>Magic</code>)</li>\n<li><strong>Connected:</strong> you seem to have an acquaintance in every town</li>\n<li><strong>Hardy:</strong> +6 <code>HP</code></li>\n<li><strong>Linguist:</strong> you are fluent in all civilized languages</li>\n<li><strong>Lucky:</strong> turn a miss into a partial success once per day</li>\n<li><strong>Penitent:</strong> when you take damage and embrace the pain, take advantage on your next roll</li>\n<li><strong>Pet:</strong> you have a loyal and <em>effective</em> animal companion</li>\n<li><strong>Reflexes:</strong> you always act first and cannot be surprised</li>\n<li><strong>Ritual:</strong> attempt occult rituals; detailed in ancient tomes and scrolls</li>\n<li><strong>Scout:</strong> with you on point, your party covers more ground; you always spot targets before they spot you</li>\n<li><strong>Shield:</strong> when you wear no armor or shield, your faith protects you and grants you 2 armor</li>\n<li><strong>Shift:</strong> take the shape of an animal whose blood you've tasted (successful <code>con</code> roll to revert)</li>\n<li><strong>Skirmish:</strong> +1 damage; worn armor counts as one type lighter</li>\n<li><strong>Slay:</strong> +2 melee damage</li>\n<li><strong>Tinker:</strong> pick a lock, pocket or trap w/ tools</li>\n<li><strong>Tough:</strong> +1 armor</li>\n<li><strong>Turn:</strong> attempt to hold undead at bay with your faith and holy symbol</li>\n<li><strong>Versed:</strong> you share secret signs, speech and signals with your brethren</li>\n<li><strong>Vision:</strong> commune with your deity or demon via holy water/drugs</li>\n<li><strong>Volley:</strong> +2 ranged damage</li>\n<li><strong>Wild:</strong> converse with and attempt to command animals</li>\n</ul>\n<p><strong>Can your character take a hit?</strong> You start with 1 Hit Die (<code>d6</code>) + additional hit dice equal to your <code>con</code>. <strong>Roll all your hit dice and keep a number equal to your level</strong> to determine your <code>HP</code>. For example, a 1st level PC with +1 con would roll <code>2d6</code> and keep the higher of the two.</p>\n<p>When you rest in <code>comfort and safety</code>, and consume food/drink, you may reroll your <code>HP</code>. This is the amount of damage you can suffer before you take your <code>Last Breath</code>. You add additional hit dice if you: are attended by a healer; rest in a spiritual place.</p>\n<blockquote>\n  <p>A player may choose to reroll <code>HP</code> and find their PC now has <em>less</em> <code>HP</code>. We all have bad days. Are they sick? Did they stay up drinking all night?</p>\n</blockquote>\n<div class=\"pagebreak\"></div>\n<h3 id=\"magic\">Magic</h3>\n<p><strong>You can master spells equal to your level + 2</strong> (eg. 1st level magi have mastered 3 spells).</p>\n<p>Casting spells takes a physical toll. <strong>You can safely cast spells equal to your <code>hd + con</code></strong> (ie. <em>spell slots</em>). Above that, you take <code>1d6+lvl</code> damage for each spell cast. Safe casting is restored after resting in <em>comfort and safety</em>.</p>\n<p><strong>Mages add <code>int</code> to their casting rolls; clerics add <code>wis</code></strong> (eg. <code>2d6+int/wis</code>) and your <code>level</code> to damage rolls (eg. <code>2d6+lvl</code>). You gain an extra <code>d6</code> of damage at levels 5 &amp; 10.</p>\n<blockquote>\n  <p>Each time you level up, you may swap mastered spells for new ones.</p>\n</blockquote>\n<h4 id=\"scrolls\">Scrolls</h4>\n<p><strong>You may attempt to cast spells from written texts</strong>. This requires more casting time while you read/review the spell (ie. <em>a turn</em>) and expends a <em>spell slot</em>.</p>\n<blockquote>\n  <p>It is wise to identify a spell before casting it!</p>\n</blockquote>\n<h4 id=\"enhancements\">Enhancements</h4>\n<p><a href=\"https://brine.dev/#spellTags?t=enhancement\"><em>Enhancement</em> spells</a> are cast in conjunction with a target spell. They augment spell casting and/or effect, and expend a <em>spell slot</em> in addition to the target spell.</p>\n<h4 id=\"mishaps\">Mishaps</h4>\n<p><strong>Magic is dangerous</strong>. A failed casting roll may have consequences; a critical fail always will.</p>\n<p>An example mishap table:</p>\n<ol>\n<li>the target reflects the spell back at caster</li>\n<li><code>1d6+lvl</code> damage to the caster</li>\n<li>the caster is blinded/frozen/afraid/etc… for a short time</li>\n<li>the spell affects the party in some way (depending on the spell)</li>\n<li>the caster turns blue</li>\n<li>nothing happens… <em>lucky you!</em></li>\n</ol>\n<h3 id=\"playingthegame\">Playing the Game</h3>\n<p><strong>Narrate your character's actions</strong>. Eg. instead of saying: <em>I attack with my sword</em>; say things like: <em>with my sword drawn; stained with the blood and entrails of the orc at my feet; I charge the last remaining orc, smiting it with both hands and all the might left in me</em>… _or something less dramatic :) . Don't _say_ you do a thing; <em>describe</em> how you do a thing.</p>\n<p><strong>Not all actions require a roll</strong>. Say what your character does and the GM will handle the rest.</p>\n<p><strong>When you attempt something risky</strong>, sum <code>2d6</code> and add one of your skill modifiers, based on the action you’re taking. (The GM will tell you some of the possible consequences before you roll, so you can decide if it’s worth the risk or if you want to revise your action).</p>\n<ul>\n<li><strong>2(snake eyes) is a critical failure</strong>: shit hits the fan.</li>\n<li><strong>3-6 is a miss</strong>: things don’t go well and the risk turns out badly.</li>\n<li><strong>7-9 is a partial success</strong>: you do it but at a cost, compromise, retribution, retaliation, harm, etc.</li>\n<li><strong>10-11 is a full success</strong>: you do it without complications.</li>\n<li><strong>12 (boxcars) is a critical success</strong>: you do it perfectly to some extra benefit.</li>\n</ul>\n<blockquote>\n  <p>A miss or a partial success might incur an enemy attack; damage; an additional threat; a lost item/resource/opportunity; a disadvantage; an unwelcome truth. They add to the role-play and can amp up the tension in a scene.</p>\n</blockquote>\n<h4 id=\"dieoffate\">Die of Fate</h4>\n<p><strong>Sometimes the GM will roll the <code>die of fate</code> to see how a situation unfolds</strong>. Low numbers are ill-fortune; high numbers are good fortune. The die of fate might be rolled to establish the weather, indicate a random NPC’s general attitude, to determine if a wandering monster appears, or the moral of a monster. The GM may also roll the die of fate if the PCs take some action for which sheer chance is the only factor in the outcome. <strong>You will roll this often!</strong></p>\n<div class=\"pagebreak\"></div>\n<h3 id=\"gear\">Gear</h3>\n<p><strong>You have <code>12+con</code> inventory slots</strong>. Items you can hold in one hand take one slot; items that might require two hands to hold take two slots. One slot examples: worn armor/clothes (two slots if carried); a few daggers; a bag containing 250 coins. Two slot examples: martial/great weapons; large shields; animal trap; wine casks. When carrying more items than you have slots, you are <code>encumbered</code> (disadvantage on rolls involving physicality).</p>\n<blockquote>\n  <p>Inventory slots are meant to be more <em>concept than rule</em>. The intent is to remind players of the <em>useful</em> items their PCs are carrying, while providing a reasonable amount they are <em>able</em> to carry.</p>\n</blockquote>\n<p><strong>You start with <code>2d6*10</code> silver coins…</strong></p>\n<ul>\n<li><strong>Light Weapon</strong> (10s): <code>d6</code>. May be wielded as a secondary weapon, <em>allowing you to reroll damage once per attack</em>. Includes daggers, short swords, and hand axes.</li>\n<li><strong>Martial Weapon</strong> (30s): <code>d6+1</code>. Must be wielded in main hand. Includes long swords, hammers, axes, spears etc.</li>\n<li><strong>Great Weapon</strong> (40s): <code>d6+2</code> damage. Uses two hands. Includes two-handed swords, battle-axes and pole arms.</li>\n<li><strong>Shortbow</strong> (10s): d6. Also slings etc.</li>\n<li><strong>Bow</strong> (30s): <code>d6+1</code>. Also crossbows, pistols etc.</li>\n<li><strong>Heavy Bow/Gun</strong> (50s): <code>d6+2</code> Damage if firing from a <em>stationary position</em>. Includes crossbows and muskets.</li>\n<li><strong>Light Armor</strong> (30s): Armor 1 (subtracted from damage taken).</li>\n<li><strong>Full Armor</strong> (60s): Armor 2. Always has a helm. Makes it very hard to run, move quietly, swim, leap etc.</li>\n<li><strong>Shield</strong> (10s): +1 Armor.</li>\n<li><strong>Backpack</strong> (2s): Can hold 12 items up to 40lbs.</li>\n<li><strong>Adventuring Gear</strong> (2s each): 20ft Rope, Iron Spike, Chalk, Parchment, Flint/Steel, Torches (4), Tent, Dice, Caltrops (slows pursuers), Bandages, Travel Rations, Waterskin, Wineskin.</li>\n<li><strong>Tools</strong> (5s each): Crowbar, Hatchet, Animal Trap, Lockpicks, Pen &amp; Pot of Ink, Fishing Pole, Shovel, Grappling Hook, Pickaxe, Collapsible Pole.</li>\n<li><strong>Occult Items</strong> (10s each): Quicksilver (per dose), Pouch of Bone Dust, Vial of Holy Water (one use), Vial of Blood, Ritual Incense and Oils.</li>\n<li><strong>Fancy Items</strong> (20s each): Mirror, Lantern, Spyglass, Sand Timer, Board Game, Elaborate Clothes, Holy Symbols and other charms.</li>\n<li><strong>Fire Oil</strong> (20s per flask): Sets an area on fire (<code>d6+1</code> damage/round for 3 rounds unless extinguished). Fills a lantern 10 times.</li>\n<li><strong>Boats:</strong> Rowboat (50s) to Galley (200,000s).</li>\n<li><strong>Carts:</strong> Cart (30s) to Wagon (100s).</li>\n<li><strong>Taverns:</strong> 1s to Sleep, 1s to Eat, 1s to Get Drunk.</li>\n<li><strong>Property:</strong> House (1,000s) to Manor (100,000).</li>\n<li><strong>Horses:</strong> Mule (30s), Horse (100s), Warhorse (1,000s).</li>\n</ul>\n<h3 id=\"hirelings\">Hirelings</h3>\n<p>Cost per day</p>\n<ul>\n<li><strong>Torch Bearer</strong> (2s): 3HP, Knife.</li>\n<li><strong>Guide</strong> (5s): 6HP, Knife, Lantern, Rope.</li>\n<li><strong>Armsman</strong> (20s): 12HP, Spear, Shield, Light Armor.</li>\n<li><strong>Expert</strong> (20s): 6HP, Skill 4, Dagger, Bow.</li>\n<li><strong>Champion</strong> (60s): 18HP, Full Armor, Halberd, Sword, Shield, Dagger.</li>\n</ul>\n<h3 id=\"levels\">Levels</h3>\n<p><em>As you level up you get rewards according to the table below…</em></p>\n<table>\n<thead>\n<tr>\n<th id=\"level\" style=\"text-align:center;\">level</th>\n<th id=\"hd\" style=\"text-align:center;\">hd</th>\n<th id=\"skills\" style=\"text-align:center;\">skills</th>\n<th id=\"attributes\" style=\"text-align:center;\">attributes</th>\n<th id=\"abils\" style=\"text-align:center;\">abils</th>\n<th id=\"damage\" style=\"text-align:center;\">damage</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:center;\">1</td>\n<td style=\"text-align:center;\">1+con</td>\n<td style=\"text-align:center;\">1+1</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">2</td>\n<td style=\"text-align:center;\"></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">2</td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">3</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">4</td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1 (max +3)</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">5</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1d6</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">6</td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">7</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1 (max +3)</td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">8</td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">9</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">10</td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1 (max +3)</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1d6</td>\n</tr>\n</tbody>\n</table>\n<p><strong>B&B</strong> uses <strong>Milestones</strong> to measure a player character's development. The GM sets a goal(s) for the PCs to accomplish before they can reach the next level. Each level should be twice as hard to achieve (give or take). Milestones might include:</p>\n<ul>\n<li>merely surviving their first encounter</li>\n<li>obtaining a MacGuffin</li>\n<li>completing a quest</li>\n<li>defeating a boss</li>\n<li>failures… always a formidable teacher</li>\n</ul>\n<h3 id=\"lastbreath\">Last Breath</h3>\n<p>When a PC's <code>HP</code> drops to 0, they must roll <code>2d6+con</code>:</p>\n<p>On a:</p>\n<ul>\n<li><strong>6-</strong>: you're dead; roll a new character :rip:</li>\n<li><strong>7-9:</strong> you will meet <strong>Death</strong> and bargain for your life. SPOILER: <em>Death can be a dick!</em></li>\n<li><strong>10+:</strong> you feel like hammered shit… but you're alive</li>\n</ul>\n<h3 id=\"truenames\">True Names</h3>\n<p>True names have power; knowing a true name gives you power over <em>the named</em>. Calling to someone by their <code>True Name</code> gives them advantage on <code>Last Breath</code> rolls.</p>\n<div class=\"pagebreak\"></div>\n<h3 id=\"gms\">GMs</h3>\n<p>The following are friendly suggestions for GMing <strong>B&B</strong>. As always, do what's right for you or your players.</p>\n<ul>\n<li><strong>Initiative:</strong> The coolest part of <code>Initiative</code>… is saying <strong>roll initiative!</strong> Given a group of reasonable size (2-5 PCs), <em>cinematic jump cuts</em> (camera-like jumps between players/situations; that follow the narrative) are a great alternative. It also works well with a split party.</li>\n<li><strong>Splitting the Party:</strong> ALWAYS split the party. It's a hoot.</li>\n<li><strong>Balancing Encounters:</strong> Don't do it! PCs should be smart enough to know when they're outmatched. If not, there's always <code>Last Breath</code>. Outside of that, rolling new characters is a snap in <strong>B&B</strong> :)</li>\n<li><strong>Magic Items:</strong> resist issuing +1 <em>to hit</em> items; rather give +1 to damage or something more situational</li>\n</ul>"
  },
  {
    "meta": {
      "title": "Black Jenny and her Gang of Miscreant Sons",
      "date": "2021-7-4",
      "description": "Those adorable little miscreants!",
      "tags": "npcs",
      "slug": "black_jenny_and_her_gang_of_miscreant_sons"
    },
    "markdown": "---\ntitle: Black Jenny and her Gang of Miscreant Sons\ndate: 2021-7-4\ndescription: Those adorable little miscreants!\ntags: npcs\n---\n\nI like to weave pre-written modules into my campaigns (parts of them, anyway). The different tones and ideas keep my players guessing and oftentimes end up becoming part of our lore. Case in point: when I threw [Prison of the Hated Pretender](http://dungeonofsigns.blogspot.com/2012/08/prison-of-hated-pretender-pdf.html) into my longrunning campaign. I had previously run it as a one-shot when one of my players was unavailable. It ended in a TPK 🙄.\n\n<break>\n\nBeing the benevolent GM that I am, I decided to bring my campaign party back to this setting and witness their one-shot character's dead, broken bodies. They also found out that the Pretender... HAS ESCAPED! In search of his crown, he immediately sought out... _Black Jenny_.\n\n**The Hated Pretender and Black Jenny are now NPCs in my world.** From the module, we know Jenny's name; the name of her gang, and that she stole the crown of the Hated Pretender. Thus, I had to flesh her out a bit. This is what I came up with...\n\n### The Gang\n\nJenny's \"sons\" are neither boys nor related to her by blood. Street urchins with promise; she recruits them, trains them and puts them to work. All mentions of her _Miscreant Sons_ are met with a collective groan from the girls. It is safer to pose as _sons than daughters_; so they look the other way... _but hate it_.\n\n  - **Black Jenny** - _road agent_\n    > `hd5(+2con); ac+2; at2d6(+2dex/0str): 2d6(+1 daggers)`\n\n    > She has dark hair and black leather armor. A string of onyx gemstones around her neck. She wants to retire... in a _black tower_.\n\n  - **Natty** - _thief_\n    > `hd3; ac0; at1d6(+2dex/0str): 1d6(bow +1/daggers); lock picks/backstab;`\n\n    > The oldest of the girls at 14, it's getting more and more difficult to play the role of a \"son\". She wears her long, red hair in a _boys style_; frumpy clothes and is quick to pick a pocket.\n\n  - **Lunara** - _alchemist_\n    > `hd3; ac0; at1d6: 1d6(+1 pistols/darts); ritual/lore`\n\n    > She sports a blonde bowl cut and a tunic with multiple burn marks. Through rituals, she is able to concoct healing potions, gunpowder and an _exploding_ paralysis potion. She wears a leather satchel full of glass vials.\n\n  - **Peregrine** - _ranger_\n    > `hd3(+2con); ac0; at1d6(+1str): bite/claws;`\n\n    > She is a _skin-walker_ and can shapeshift into a falcon. She has a number of tattoos and spiked, dark hair. She always attacks in falcon form.\n\n### Tactics\n\nThe gang will attempt to get an edge by having **Peregrine** drop a paralysis vial on targets. Those that remain moving will get the same potion via a dart from **Lunara**. Otherwise, they will turn to **Natty's** stealth or ability to _obtain_ things...\n",
    "html": "<p>I like to weave pre-written modules into my campaigns (parts of them, anyway). The different tones and ideas keep my players guessing and oftentimes end up becoming part of our lore. Case in point: when I threw <a href=\"http://dungeonofsigns.blogspot.com/2012/08/prison-of-hated-pretender-pdf.html\">Prison of the Hated Pretender</a> into my longrunning campaign. I had previously run it as a one-shot when one of my players was unavailable. It ended in a TPK 🙄.</p>\n<p><break></p>\n<p>Being the benevolent GM that I am, I decided to bring my campaign party back to this setting and witness their one-shot character's dead, broken bodies. They also found out that the Pretender… HAS ESCAPED! In search of his crown, he immediately sought out… <em>Black Jenny</em>.</p>\n<p><strong>The Hated Pretender and Black Jenny are now NPCs in my world.</strong> From the module, we know Jenny's name; the name of her gang, and that she stole the crown of the Hated Pretender. Thus, I had to flesh her out a bit. This is what I came up with…</p>\n<h3 id=\"thegang\">The Gang</h3>\n<p>Jenny's \"sons\" are neither boys nor related to her by blood. Street urchins with promise; she recruits them, trains them and puts them to work. All mentions of her <em>Miscreant Sons</em> are met with a collective groan from the girls. It is safer to pose as <em>sons than daughters</em>; so they look the other way… <em>but hate it</em>.</p>\n<ul>\n<li><p><strong>Black Jenny</strong> - <em>road agent</em></p>\n<blockquote>\n  <p><code>hd5(+2con); ac+2; at2d6(+2dex/0str): 2d6(+1 daggers)</code></p>\n  <p>She has dark hair and black leather armor. A string of onyx gemstones around her neck. She wants to retire… in a <em>black tower</em>.</p>\n</blockquote></li>\n<li><p><strong>Natty</strong> - <em>thief</em></p>\n<blockquote>\n  <p><code>hd3; ac0; at1d6(+2dex/0str): 1d6(bow +1/daggers); lock picks/backstab;</code></p>\n  <p>The oldest of the girls at 14, it's getting more and more difficult to play the role of a \"son\". She wears her long, red hair in a <em>boys style</em>; frumpy clothes and is quick to pick a pocket.</p>\n</blockquote></li>\n<li><p><strong>Lunara</strong> - <em>alchemist</em></p>\n<blockquote>\n  <p><code>hd3; ac0; at1d6: 1d6(+1 pistols/darts); ritual/lore</code></p>\n  <p>She sports a blonde bowl cut and a tunic with multiple burn marks. Through rituals, she is able to concoct healing potions, gunpowder and an <em>exploding</em> paralysis potion. She wears a leather satchel full of glass vials.</p>\n</blockquote></li>\n<li><p><strong>Peregrine</strong> - <em>ranger</em></p>\n<blockquote>\n  <p><code>hd3(+2con); ac0; at1d6(+1str): bite/claws;</code></p>\n  <p>She is a <em>skin-walker</em> and can shapeshift into a falcon. She has a number of tattoos and spiked, dark hair. She always attacks in falcon form.</p>\n</blockquote></li>\n</ul>\n<h3 id=\"tactics\">Tactics</h3>\n<p>The gang will attempt to get an edge by having <strong>Peregrine</strong> drop a paralysis vial on targets. Those that remain moving will get the same potion via a dart from <strong>Lunara</strong>. Otherwise, they will turn to <strong>Natty's</strong> stealth or ability to <em>obtain</em> things…</p>"
  },
  {
    "meta": {
      "title": "D66 Spark Table Generator",
      "date": "2022-2-16",
      "description": "Spark tables are a great way to induce creativity...",
      "tags": "spark, tools",
      "slug": "d66_spark_table_generator"
    },
    "markdown": "---\ntitle: D66 Spark Table Generator\ndate: 2022-2-16\ndescription: Spark tables are a great way to induce creativity...\ntags: spark, tools\n---\n\nI've been playing around with **spark tables**; a concept taken from [Chris McDowall](https://www.bastionland.com). The concept is quite simple: given two numbered tables/lists of evocative words, roll on both, and use the words together to spark an idea.\n\nThis is lovely... but I wanted to create tables specific to my games/worlds, and was struggling to come up with evocative words. THUS, **a spark table to _generate_ spark tables was born!**\n\n<break>\n\n## INSTRUCTIONS\n1. Roll `2d6`: the die landing closest to you (real dice) or leftmost (dice bot) is the first digit (`10s`); the other die is the second digit (`1s`)\n2. If you roll doubles, roll again and use both results\n3. Use the result(s) to think of a _spark word_\n4. Record each word on a similarly numbered d66 table (or as many as you want)\n5. If stuck, roll for another spark, or re-roll until you spark something\n6. Once you have your own spark tables, roll 2d6 on each and mash the two words together to generate ideas\n\n_HINT: if using the doubles rule (#2), make sure those words are fairly generic as to mash well with others._\n\n## D66 SPARK TABLE GENERATOR\n\n```\n11 smell\n12 size/importance\n13 condition\n14 worth/merit\n15 atmospheric condition\n16 crop\n21 emotion\n22 object\n23 food\n24 profession\n25 sound\n26 feeling\n31 happy word\n32 liquid\n33 color\n34 constructed landmark\n35 natural landmark\n36 lifestyle quality\n41 made from\n42 meaning of life\n43 crime\n44 organization\n45 body shape/type/size\n46 element\n51 problem\n52 building\n53 scary word\n54 furniture\n55 group(ing)\n56 event\n61 attraction\n62 art\n63 economic issue/boon\n64 animal\n65 cloud description\n66 mystical\n```\n\n## Examples\n\n```\n11. spirit       pirates      head          fluffy\n12. roadrunner   orgy         mob           sugar\n13. drought      caustic      dance         egg\n14. soil         dungeon      bubbles       boom\n15. desk         festivities  poison        lake\n16. barrow       sulfur       table         bounty\n21. toxic        taco         luxury        rainbow\n22. kiva         perfume      brimstone     monastery\n23. thunder      scared       bounty-hunter guards\n24. library      blood        arroyo        bacon\n25. bridge       iron         chocolate     kidnap\n26. haze         badger       fire          missing\n31. hanging-tree dark         graveyard     runes\n32. tavern       dreams       vagrant       happy\n33. rascal       rumble       concert       sick\n34. temple       shadows      anger         mine\n35. burning      shaken       poor          meat\n36. crushed      cairn        brain         paper\n41. horn         frozen       gateway       balloons\n42. tower        pig          finger        copper\n43. mundane      joyful       theft         tattoo\n44. hunched      stretched    cat           alchemist\n45. cooks        ice          balmy         love\n46. vast         embezzlement explosion     famous\n51. law          statue       abandoned     relic\n52. gods         hate         destitute     inoperable\n53. expanding    kitten       atomic        skeletons\n54. peyote       ghostly      affluent      erupting\n55. shortage     grand        priest        fundraiser\n56. silver       lanky        hostile       victory\n61. crystal      numb         water         virtuous\n62. mill         fountain     music         drunk\n63. opulent      gold         infestation   glowing\n64. cult         broken       treasure      cave\n65. long         silk         blight        stable\n66. sunny        death        soft          birth\n```",
    "html": "<p>I've been playing around with <strong>spark tables</strong>; a concept taken from <a href=\"https://www.bastionland.com\">Chris McDowall</a>. The concept is quite simple: given two numbered tables/lists of evocative words, roll on both, and use the words together to spark an idea.</p>\n<p>This is lovely… but I wanted to create tables specific to my games/worlds, and was struggling to come up with evocative words. THUS, <strong>a spark table to <em>generate</em> spark tables was born!</strong></p>\n<p><break></p>\n<h2 id=\"instructions\">INSTRUCTIONS</h2>\n<ol>\n<li>Roll <code>2d6</code>: the die landing closest to you (real dice) or leftmost (dice bot) is the first digit (<code>10s</code>); the other die is the second digit (<code>1s</code>)</li>\n<li>If you roll doubles, roll again and use both results</li>\n<li>Use the result(s) to think of a <em>spark word</em></li>\n<li>Record each word on a similarly numbered d66 table (or as many as you want)</li>\n<li>If stuck, roll for another spark, or re-roll until you spark something</li>\n<li>Once you have your own spark tables, roll 2d6 on each and mash the two words together to generate ideas</li>\n</ol>\n<p><em>HINT: if using the doubles rule (#2), make sure those words are fairly generic as to mash well with others.</em></p>\n<h2 id=\"d66sparktablegenerator\">D66 SPARK TABLE GENERATOR</h2>\n<pre><code>11 smell\n12 size/importance\n13 condition\n14 worth/merit\n15 atmospheric condition\n16 crop\n21 emotion\n22 object\n23 food\n24 profession\n25 sound\n26 feeling\n31 happy word\n32 liquid\n33 color\n34 constructed landmark\n35 natural landmark\n36 lifestyle quality\n41 made from\n42 meaning of life\n43 crime\n44 organization\n45 body shape/type/size\n46 element\n51 problem\n52 building\n53 scary word\n54 furniture\n55 group(ing)\n56 event\n61 attraction\n62 art\n63 economic issue/boon\n64 animal\n65 cloud description\n66 mystical\n</code></pre>\n<h2 id=\"examples\">Examples</h2>\n<pre><code>11. spirit       pirates      head          fluffy\n12. roadrunner   orgy         mob           sugar\n13. drought      caustic      dance         egg\n14. soil         dungeon      bubbles       boom\n15. desk         festivities  poison        lake\n16. barrow       sulfur       table         bounty\n21. toxic        taco         luxury        rainbow\n22. kiva         perfume      brimstone     monastery\n23. thunder      scared       bounty-hunter guards\n24. library      blood        arroyo        bacon\n25. bridge       iron         chocolate     kidnap\n26. haze         badger       fire          missing\n31. hanging-tree dark         graveyard     runes\n32. tavern       dreams       vagrant       happy\n33. rascal       rumble       concert       sick\n34. temple       shadows      anger         mine\n35. burning      shaken       poor          meat\n36. crushed      cairn        brain         paper\n41. horn         frozen       gateway       balloons\n42. tower        pig          finger        copper\n43. mundane      joyful       theft         tattoo\n44. hunched      stretched    cat           alchemist\n45. cooks        ice          balmy         love\n46. vast         embezzlement explosion     famous\n51. law          statue       abandoned     relic\n52. gods         hate         destitute     inoperable\n53. expanding    kitten       atomic        skeletons\n54. peyote       ghostly      affluent      erupting\n55. shortage     grand        priest        fundraiser\n56. silver       lanky        hostile       victory\n61. crystal      numb         water         virtuous\n62. mill         fountain     music         drunk\n63. opulent      gold         infestation   glowing\n64. cult         broken       treasure      cave\n65. long         silk         blight        stable\n66. sunny        death        soft          birth\n</code></pre>"
  },
  {
    "meta": {
      "title": "Delve of the Handsome Repeater",
      "date": "2022-1-12",
      "description": "A short fantasy adventure for Beasts &amp; Barrows",
      "tags": "my_stuff, bnb, adventures",
      "slug": "delve_of_the_handosme_repeater"
    },
    "markdown": "---\ntitle: Delve of the Handsome Repeater\ndate: 2022-1-12\ndescription: A short fantasy adventure for Beasts & Barrows\ntags: my_stuff, bnb, adventures\n---\n\n[![center](assets/images/dothr-630x500.png)](https://casadeocio.itch.io/delve-of-the-handsome-repeater)\n\nI like adventure modules. I especially like the newer ones... that are _actually_ modular. Short, open-ended adventures that are trivial to drop into any campaign. Scanable; easy to grok. This is thankfully becoming the norm; fighting against the epic walls-of-text, and endless lore from modules of yore. This is what I want and what _I want to write_.\n\n<break>\n\nThus, [Delve of the Handsome Repeater](https://casadeocio.itch.io/delve-of-the-handsome-repeater) was born. This is my _hat_ tossed into the ring of an ever-growing list of newer adventures.\n\nTo be honest: I find dungeons and dungeon crawls boring; mega dungeons _mega_ boring. So it's only fitting that my first published module (more or less) should be a dungeon ¯\\_(ツ)_/¯. I hoped writing one would open my eyes to the GLORRY THAT IS DUNGEON CRAWLING! Spoiler... it didn't.\n\nAnyway, here it is. It was fun to write and fun to play... I hope others find it enjoyable.\n",
    "html": "<p><a href=\"https://casadeocio.itch.io/delve-of-the-handsome-repeater\"><img src=\"assets/images/dothr-630x500.png\" alt=\"center\" /></a></p>\n<p>I like adventure modules. I especially like the newer ones… that are <em>actually</em> modular. Short, open-ended adventures that are trivial to drop into any campaign. Scanable; easy to grok. This is thankfully becoming the norm; fighting against the epic walls-of-text, and endless lore from modules of yore. This is what I want and what <em>I want to write</em>.</p>\n<p><break></p>\n<p>Thus, <a href=\"https://casadeocio.itch.io/delve-of-the-handsome-repeater\">Delve of the Handsome Repeater</a> was born. This is my <em>hat</em> tossed into the ring of an ever-growing list of newer adventures.</p>\n<p>To be honest: I find dungeons and dungeon crawls boring; mega dungeons <em>mega</em> boring. So it's only fitting that my first published module (more or less) should be a dungeon ¯_(ツ)_/¯. I hoped writing one would open my eyes to the GLORRY THAT IS DUNGEON CRAWLING! Spoiler… it didn't.</p>\n<p>Anyway, here it is. It was fun to write and fun to play… I hope others find it enjoyable.</p>"
  },
  {
    "meta": {
      "title": "FKR",
      "date": "2023-1-16",
      "description": "What the FKR?",
      "tags": "acronym",
      "slug": "fkr"
    },
    "markdown": "---\ntitle: FKR\ndate: 2023-1-16\ndescription: What the FKR?\ntags: acronym\n---\n\n**FKR** (Free Kriegsspiel Roleplaying) is an approach to playing tabletop roleplaying games. Its popular catchphrase, _\"play worlds not rules\"_ , is as reasonable as any catchphrase. Play requires the following:\n\n1. A shared understanding of a world.\n1. A Game Maestro trusted to represent \"the world\", and adjudicate player actions and their consequences.\n1. One or more players who control a character and play the world set before them.\n1. Play is a conversation. The GM describes a situation; the player describes what their character does. Outcomes are negotiated together and add to the emerging narrative.\n\nThat's it. Everything else is a preference for accomplishing these requirements. Some considerations:\n\n- **Rules** tend to be _lite_ but there is no \"correct\" amount. Rules should effectively be _\"invisible\"_ and not hinder play.\n- Roll **dice** when it makes sense or not at all.\n- There are no FKR **systems**. Any system _might_ be used in an FKR game. No system; a mashup of multiple systems; a coin flip... this is up to you and your table.\n",
    "html": "<p><strong>FKR</strong> (Free Kriegsspiel Roleplaying) is an approach to playing tabletop roleplaying games. Its popular catchphrase, <em>\"play worlds not rules\"</em> , is as reasonable as any catchphrase. Play requires the following:</p>\n<ol>\n<li>A shared understanding of a world.</li>\n<li>A Game Maestro trusted to represent \"the world\", and adjudicate player actions and their consequences.</li>\n<li>One or more players who control a character and play the world set before them.</li>\n<li>Play is a conversation. The GM describes a situation; the player describes what their character does. Outcomes are negotiated together and add to the emerging narrative.</li>\n</ol>\n<p>That's it. Everything else is a preference for accomplishing these requirements. Some considerations:</p>\n<ul>\n<li><strong>Rules</strong> tend to be <em>lite</em> but there is no \"correct\" amount. Rules should effectively be <em>\"invisible\"</em> and not hinder play.</li>\n<li>Roll <strong>dice</strong> when it makes sense or not at all.</li>\n<li>There are no FKR <strong>systems</strong>. Any system <em>might</em> be used in an FKR game. No system; a mashup of multiple systems; a coin flip… this is up to you and your table.</li>\n</ul>"
  },
  {
    "meta": {
      "title": "Glimmerwood Forest",
      "date": "2024-1-22",
      "tags": "snippet, grain",
      "slug": "glimmerwood_forest"
    },
    "markdown": "---\ntitle: Glimmerwood Forest\ndate: 2024-1-22\ndescription:\ntags: snippet, grain\n---\n\n![round](assets/images/whipping_tree.webp)\n\n_v1.0_\n\n- prison of dangerous books\n- cult is praying for weather change but god is not listening... PRAY HARDER\n- the druid is sleeping in the grove somewhere/how\n\n\n\n[![thumb](assets/images/glimmerwood_forest_map.webp)](assets/images/glimmerwood_forest_map.webp)\nGlimmerwood Forest is a popular shortcut for those without fear of the forest. It can halve travel time between Emberford (`0709`) and the northern villages. The increase in traffic has also increased the population.\n\nBut thunderstorms ravage Glimmerwood Forest. These storms target only the forest, leaving the surrounding areas dry and peaceful. Paths made treacherous by the rains impede travel and hunting. Those who try report seeing ghastly apparitions.\n\nIn the heart of the forest, words cut into an ancient, gnarled tree; a spell. Is this the reason for the storms or solution to them?\n\n\n### RUMORS\n\n1. **The Whipping Tree** (`0502`) carries the blood of those punished upon it. It whispers when the storms rage; casting the spell cut into it.\n1. That witch and her filthy coven are behind these storms.\n1. **The Green Lady** is a beautiful, green temptress. She stalks the forest, \"calling\" to the hunters.\n1. Cloaked figures perform rituals in the **Lost Druid's Grove** (`0902`); deep within Glimmerwood. The grove was once home to a powerful druid who vanished centuries ago.\n1. Paths in Glimmerwood are said to shift and change directions, leading wanderers into the heart of the forest.\n1. **The Ghost Herd** is a spectral herd of elk that roams Glimmerwood.\n\n\n### ENCOUNTERS\n\n1. A mudslide threatens to envelope the PCs\n1. The Ghost Herd threatens to trample the PCs\n1. A distressed hunter stuck in quicksand\n1. Unearthed graves; disturbed by the rains\n1. Apparitions haunt the PCs until their graves are restored\n1. The Green Lady calls to the PCs\n\n\n### NOTABLES\n\n**George & Astrid Duskwood** `Innkeepers, Silversmith, Ambitious` - George is a retired silversmith. His new bride Astrid and her son are building the first inn in the area; the first permanent structure of any kind(`0608`). They are hoping to establish a village here. The rains are delaying most of their shipments.\n\n**Ceridwen** `Cartographer, Woodworker, Big Thinker` - She carefully maps the forest, intending to sell them to a logging enterprise in Emberford. While she waits out the storms in her tent, she carves intricate wooden figures. She's currently working a piece she took from the Whipping Tree.\n\n**Rowan Bramblethorn** `Hunter, Worthy, Determined` - He lives in the forest and will be helpful to those who show respect. He is close with Nyx, or at least thinks so.\n\n**Kelsia** `Trapper, Mentor, Materialistic` - She is only a threat to forest furbearers, and takes great pride in _the artistry_ of trapping. She travels with her nephew, Orion, teaching him the trade. She is careful to leave \"offerings\" outside Witch Ailmar's desolate brugh.\n\n**The Witch Ailmar** `Witch, Herbalist, Untrustworthy` - Despite her dubious practices, Ailmar is an unparalleled herbalist. Many seek her remedies and potions, but are quick to blame her for the unwelcome truths they uncover. She sees the forest as an exploitable resource and enjoys its solitude.\n\n**Nyx** `The Green Lady, Dryad, Guardian` - She knows the coming of men is inevitable but resits their impact on the forest as best she can. While Nyx did not create the tree's spell, she knows it as a spell to \"Wash Away Sins\". She believes it maintains balance in the forest and will not interfere with it in any way.\n\n\n### LOCATIONS\n\n**Glimmerwood Forest:** A dense and ancient woodland, shrouded in mist. Towering trees with twisted branches create a canopy, casting ethereal shadows on the lush forest floor. The air crackles with a mysterious energy, and the occasional flash of magical storms illuminates the surroundings.\n\n**The Whipping Tree (`0502`):** A gnarled and imposing tree with dark bark, standing alone in a small clearing. Faint echoes of past punishments linger in the air, and the tree seems to whisper when the storms rage, hinting at a dark and forbidden history.\n\n**Lost Druid's Grove (`0902`):** A hidden grove deep within Glimmerwood, filled with ancient stone circles and remnants of long-forgotten rituals. Cloaked figures perform mysterious ceremonies, their actions obscured by the shadows of the ancient trees.\n\n**Inn of George & Astrid Duskwood (`0608`):** A modest yet welcoming inn under construction at the edge of the forest. The sound of hammers and saws echoes as George and Astrid Duskwood strive to establish the first building in the area. The rains delay shipments, leaving the inn in partial completion.\n\n**The Green Lady's Domain:** A secluded part of the forest where vibrant greenery flourishes. Nyx, the Dryad known as The Green Lady, resides here. The air is filled with the sweet scent of blossoms, and the energy feels both calming and protective. She can control the Ghost Herd\n\n**Witch Ailmar's Desolate Brugh:** A mysterious and somewhat eerie dwelling nestled in the heart of Glimmerwood. The witch, Ailmar, resides here. The surroundings are adorned with various herbs and potions, and an air of untrustworthiness permeates the atmosphere.\n\n\n_map by [Watabou](https://watabou.github.io/perilous-shores/?seed=1212351748&tags=perilous,lowland,evil,woodland,land&w=800&h=800&hexes=2)_",
    "html": "<p><img src=\"assets/images/whipping_tree.webp\" alt=\"round\" /></p>\n<p><em>v1.0</em></p>\n<ul>\n<li>prison of dangerous books</li>\n<li>cult is praying for weather change but god is not listening… PRAY HARDER</li>\n<li>the druid is sleeping in the grove somewhere/how</li>\n</ul>\n<p><a href=\"assets/images/glimmerwood_forest_map.webp\"><img src=\"assets/images/glimmerwood_forest_map.webp\" alt=\"thumb\" /></a>\nGlimmerwood Forest is a popular shortcut for those without fear of the forest. It can halve travel time between Emberford (<code>0709</code>) and the northern villages. The increase in traffic has also increased the population.</p>\n<p>But thunderstorms ravage Glimmerwood Forest. These storms target only the forest, leaving the surrounding areas dry and peaceful. Paths made treacherous by the rains impede travel and hunting. Those who try report seeing ghastly apparitions.</p>\n<p>In the heart of the forest, words cut into an ancient, gnarled tree; a spell. Is this the reason for the storms or solution to them?</p>\n<h3 id=\"rumors\">RUMORS</h3>\n<ol>\n<li><strong>The Whipping Tree</strong> (<code>0502</code>) carries the blood of those punished upon it. It whispers when the storms rage; casting the spell cut into it.</li>\n<li>That witch and her filthy coven are behind these storms.</li>\n<li><strong>The Green Lady</strong> is a beautiful, green temptress. She stalks the forest, \"calling\" to the hunters.</li>\n<li>Cloaked figures perform rituals in the <strong>Lost Druid's Grove</strong> (<code>0902</code>); deep within Glimmerwood. The grove was once home to a powerful druid who vanished centuries ago.</li>\n<li>Paths in Glimmerwood are said to shift and change directions, leading wanderers into the heart of the forest.</li>\n<li><strong>The Ghost Herd</strong> is a spectral herd of elk that roams Glimmerwood.</li>\n</ol>\n<h3 id=\"encounters\">ENCOUNTERS</h3>\n<ol>\n<li>A mudslide threatens to envelope the PCs</li>\n<li>The Ghost Herd threatens to trample the PCs</li>\n<li>A distressed hunter stuck in quicksand</li>\n<li>Unearthed graves; disturbed by the rains</li>\n<li>Apparitions haunt the PCs until their graves are restored</li>\n<li>The Green Lady calls to the PCs</li>\n</ol>\n<h3 id=\"notables\">NOTABLES</h3>\n<p><strong>George & Astrid Duskwood</strong> <code>Innkeepers, Silversmith, Ambitious</code> - George is a retired silversmith. His new bride Astrid and her son are building the first inn in the area; the first permanent structure of any kind(<code>0608</code>). They are hoping to establish a village here. The rains are delaying most of their shipments.</p>\n<p><strong>Ceridwen</strong> <code>Cartographer, Woodworker, Big Thinker</code> - She carefully maps the forest, intending to sell them to a logging enterprise in Emberford. While she waits out the storms in her tent, she carves intricate wooden figures. She's currently working a piece she took from the Whipping Tree.</p>\n<p><strong>Rowan Bramblethorn</strong> <code>Hunter, Worthy, Determined</code> - He lives in the forest and will be helpful to those who show respect. He is close with Nyx, or at least thinks so.</p>\n<p><strong>Kelsia</strong> <code>Trapper, Mentor, Materialistic</code> - She is only a threat to forest furbearers, and takes great pride in <em>the artistry</em> of trapping. She travels with her nephew, Orion, teaching him the trade. She is careful to leave \"offerings\" outside Witch Ailmar's desolate brugh.</p>\n<p><strong>The Witch Ailmar</strong> <code>Witch, Herbalist, Untrustworthy</code> - Despite her dubious practices, Ailmar is an unparalleled herbalist. Many seek her remedies and potions, but are quick to blame her for the unwelcome truths they uncover. She sees the forest as an exploitable resource and enjoys its solitude.</p>\n<p><strong>Nyx</strong> <code>The Green Lady, Dryad, Guardian</code> - She knows the coming of men is inevitable but resits their impact on the forest as best she can. While Nyx did not create the tree's spell, she knows it as a spell to \"Wash Away Sins\". She believes it maintains balance in the forest and will not interfere with it in any way.</p>\n<h3 id=\"locations\">LOCATIONS</h3>\n<p><strong>Glimmerwood Forest:</strong> A dense and ancient woodland, shrouded in mist. Towering trees with twisted branches create a canopy, casting ethereal shadows on the lush forest floor. The air crackles with a mysterious energy, and the occasional flash of magical storms illuminates the surroundings.</p>\n<p><strong>The Whipping Tree (<code>0502</code>):</strong> A gnarled and imposing tree with dark bark, standing alone in a small clearing. Faint echoes of past punishments linger in the air, and the tree seems to whisper when the storms rage, hinting at a dark and forbidden history.</p>\n<p><strong>Lost Druid's Grove (<code>0902</code>):</strong> A hidden grove deep within Glimmerwood, filled with ancient stone circles and remnants of long-forgotten rituals. Cloaked figures perform mysterious ceremonies, their actions obscured by the shadows of the ancient trees.</p>\n<p><strong>Inn of George & Astrid Duskwood (<code>0608</code>):</strong> A modest yet welcoming inn under construction at the edge of the forest. The sound of hammers and saws echoes as George and Astrid Duskwood strive to establish the first building in the area. The rains delay shipments, leaving the inn in partial completion.</p>\n<p><strong>The Green Lady's Domain:</strong> A secluded part of the forest where vibrant greenery flourishes. Nyx, the Dryad known as The Green Lady, resides here. The air is filled with the sweet scent of blossoms, and the energy feels both calming and protective. She can control the Ghost Herd</p>\n<p><strong>Witch Ailmar's Desolate Brugh:</strong> A mysterious and somewhat eerie dwelling nestled in the heart of Glimmerwood. The witch, Ailmar, resides here. The surroundings are adorned with various herbs and potions, and an air of untrustworthiness permeates the atmosphere.</p>\n<p><em>map by <a href=\"https://watabou.github.io/perilous-shores/?seed=1212351748&tags=perilous,lowland,evil,woodland,land&w=800&h=800&hexes=2\">Watabou</a></em></p>"
  },
  {
    "meta": {
      "title": "How To Hexcrawl",
      "date": "2023-7-8",
      "description": "Simple rules and procedures for running hexcrawl rpgs",
      "tags": "hexcrawl, hexy",
      "slug": "how_to_hexcrawl"
    },
    "markdown": "---\ntitle: How To Hexcrawl\ndate: 2023-7-8\ndescription: Simple rules and procedures for running hexcrawl rpgs\ntags: hexcrawl, hexy\n---\n_v1.1_\n\nHexcrawls are awesome! They changed my game forever. But I found existing rules complex and/or included needless abstraction. Thus, I wrote my own. I also [published a pdf](https://casadeocio.itch.io/hexcrawls-rule)\n\n### PROCEEDURES\n\n#### Morning\n\n1. Roll weather\n1. Consume food/water\n1. Break or sustain camp\n1. Choose a travel direction and pace\n1. Roll navigation\n\n#### Day\n\n1. GM describes points of interest (POIs)/changing weather/terrain/landmarks...\n1. Roll random encounters once per hex\n1. Roll navigation on direction change\n1. Exploring or hunting takes 1/2 day travel time\n1. Foraging can be done en route when not on roads but requires a slowed pace\n\n#### Night\n\n1. Make camp\n1. Consume food/water\n1. Stand watch\n1. Roll encounter\n\n\n### TRAVEL\n\nHexes are 6 miles. PCs can travel 3 hexes per day at a normal pace; 4 if moving quickly or mounted. Mountains or swamps slow the party to 1 hex per day. Pushing further risks fatigue.\n\n| Type                    | Distance/Time   |\n| :----                   |:---             |\n| Mapping                 | 1/2 hex per day |\n| Hunting                 | 1/2 day         |\n| Exploring               | 1/2 day         |\n| Travel swamp/mountains  | 1 hex per day   |\n| Travel normal           | 3 hexes per day |\n| Travel forced/mounted   | 4 hexes per day |\n\n<break>\n\n#### Weather\n\nRoll 2d6: the leftmost die is type of weather, the other severity.\n\n| Weather             | Severity  |\n| :----               |:---       |\n| 1. Rain/fog/snow    | 1. Epic   |\n| 2. Storm            | 2. Severe |\n| 3. Wind             | 3. Harsh  |\n| 4. Unusual Hot/cold | 4. Moderate|\n| 5. Cloudy           | 5. Mild  |\n| 6. Clear            | 6. Pleasant |\n\n\n#### Navigation\n\nSkip navigation rolls when following a road/river/compass/spell/landmark on clear day.\n\n| D6    | Effect|\n| :---- |:---   |\n| 1     | Loop back to point of departure           |\n| 2-3   | Veer one sextant left of intended destination |\n| 4-5   | Veer one sextant right of intended destination|\n| 6     | Arrive at intended destination            |\n\n\n#### Discovery\n\nPCs discover POIs in the sextants they traverse. Eg. if the party is traveling NW through a hex and there's a POI in sextants 2 or 5, they should discover it.\n\n<pre>\n    _6_\n  5/   \\1\n  4\\___/2\n     3\n</pre>\n\nPOIs might also be discovered if the PCs:\n\n- See smoke/light/landmark\n- Hear noises\n- Smell something\n- Observe evidence of it\n- Explore the sextant\n\n> PCs can see 3 miles of flat terrain and 1 hex per 50' of elevation (tree/hill/cliff)\n\n#### Fatigue\n\nPCs risk fatigue from lack sleep/food/water, forced travel, heavy burden, miserable conditions or injury. Consuming food/water and resting a day in comfort and safety cures fatigue.\n\n| Level | Effect                    |\n| :---- |:---                       |\n| 1     | Disadvantaged skill rolls |\n| 2     | Speed halved              |\n| 3     | Disadvantaged attacks     |\n| 4     | Drop all bulky items      |\n| 5     | Speed = 0                 |\n| 6     | Death                     |\n\n",
    "html": "<p><em>v1.1</em></p>\n<p>Hexcrawls are awesome! They changed my game forever. But I found existing rules complex and/or included needless abstraction. Thus, I wrote my own. I also <a href=\"https://casadeocio.itch.io/hexcrawls-rule\">published a pdf</a></p>\n<h3 id=\"proceedures\">PROCEEDURES</h3>\n<h4 id=\"morning\">Morning</h4>\n<ol>\n<li>Roll weather</li>\n<li>Consume food/water</li>\n<li>Break or sustain camp</li>\n<li>Choose a travel direction and pace</li>\n<li>Roll navigation</li>\n</ol>\n<h4 id=\"day\">Day</h4>\n<ol>\n<li>GM describes points of interest (POIs)/changing weather/terrain/landmarks…</li>\n<li>Roll random encounters once per hex</li>\n<li>Roll navigation on direction change</li>\n<li>Exploring or hunting takes 1/2 day travel time</li>\n<li>Foraging can be done en route when not on roads but requires a slowed pace</li>\n</ol>\n<h4 id=\"night\">Night</h4>\n<ol>\n<li>Make camp</li>\n<li>Consume food/water</li>\n<li>Stand watch</li>\n<li>Roll encounter</li>\n</ol>\n<h3 id=\"travel\">TRAVEL</h3>\n<p>Hexes are 6 miles. PCs can travel 3 hexes per day at a normal pace; 4 if moving quickly or mounted. Mountains or swamps slow the party to 1 hex per day. Pushing further risks fatigue.</p>\n<table>\n<thead>\n<tr>\n<th id=\"type\" style=\"text-align:left;\">Type</th>\n<th id=\"distance/time\" style=\"text-align:left;\">Distance/Time</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left;\">Mapping</td>\n<td style=\"text-align:left;\">1/2 hex per day</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">Hunting</td>\n<td style=\"text-align:left;\">1/2 day</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">Exploring</td>\n<td style=\"text-align:left;\">1/2 day</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">Travel swamp/mountains</td>\n<td style=\"text-align:left;\">1 hex per day</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">Travel normal</td>\n<td style=\"text-align:left;\">3 hexes per day</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">Travel forced/mounted</td>\n<td style=\"text-align:left;\">4 hexes per day</td>\n</tr>\n</tbody>\n</table>\n<p><break></p>\n<h4 id=\"weather\">Weather</h4>\n<p>Roll 2d6: the leftmost die is type of weather, the other severity.</p>\n<table>\n<thead>\n<tr>\n<th id=\"weather\" style=\"text-align:left;\">Weather</th>\n<th id=\"severity\" style=\"text-align:left;\">Severity</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left;\">1. Rain/fog/snow</td>\n<td style=\"text-align:left;\">1. Epic</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">2. Storm</td>\n<td style=\"text-align:left;\">2. Severe</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">3. Wind</td>\n<td style=\"text-align:left;\">3. Harsh</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">4. Unusual Hot/cold</td>\n<td style=\"text-align:left;\">4. Moderate</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">5. Cloudy</td>\n<td style=\"text-align:left;\">5. Mild</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">6. Clear</td>\n<td style=\"text-align:left;\">6. Pleasant</td>\n</tr>\n</tbody>\n</table>\n<h4 id=\"navigation\">Navigation</h4>\n<p>Skip navigation rolls when following a road/river/compass/spell/landmark on clear day.</p>\n<table>\n<thead>\n<tr>\n<th id=\"d6\" style=\"text-align:left;\">D6</th>\n<th id=\"effect\" style=\"text-align:left;\">Effect</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left;\">1</td>\n<td style=\"text-align:left;\">Loop back to point of departure</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">2-3</td>\n<td style=\"text-align:left;\">Veer one sextant left of intended destination</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">4-5</td>\n<td style=\"text-align:left;\">Veer one sextant right of intended destination</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">6</td>\n<td style=\"text-align:left;\">Arrive at intended destination</td>\n</tr>\n</tbody>\n</table>\n<h4 id=\"discovery\">Discovery</h4>\n<p>PCs discover POIs in the sextants they traverse. Eg. if the party is traveling NW through a hex and there's a POI in sextants 2 or 5, they should discover it.</p>\n<pre>\n    _6_\n  5/   \\1\n  4\\___/2\n     3\n</pre>\n<p>POIs might also be discovered if the PCs:</p>\n<ul>\n<li>See smoke/light/landmark</li>\n<li>Hear noises</li>\n<li>Smell something</li>\n<li>Observe evidence of it</li>\n<li>Explore the sextant</li>\n</ul>\n<blockquote>\n  <p>PCs can see 3 miles of flat terrain and 1 hex per 50' of elevation (tree/hill/cliff)</p>\n</blockquote>\n<h4 id=\"fatigue\">Fatigue</h4>\n<p>PCs risk fatigue from lack sleep/food/water, forced travel, heavy burden, miserable conditions or injury. Consuming food/water and resting a day in comfort and safety cures fatigue.</p>\n<table>\n<thead>\n<tr>\n<th id=\"level\" style=\"text-align:left;\">Level</th>\n<th id=\"effect\" style=\"text-align:left;\">Effect</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left;\">1</td>\n<td style=\"text-align:left;\">Disadvantaged skill rolls</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">2</td>\n<td style=\"text-align:left;\">Speed halved</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">3</td>\n<td style=\"text-align:left;\">Disadvantaged attacks</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">4</td>\n<td style=\"text-align:left;\">Drop all bulky items</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">5</td>\n<td style=\"text-align:left;\">Speed = 0</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">6</td>\n<td style=\"text-align:left;\">Death</td>\n</tr>\n</tbody>\n</table>"
  },
  {
    "meta": {
      "title": "I Published a Thing",
      "date": "2021-12-4",
      "description": "We hack because we care; we publish because we hack?",
      "tags": "my_stuff, bnb, game_design",
      "slug": "i_published_a_thing"
    },
    "markdown": "---\ntitle: I Published a Thing\ndate: 2021-12-4\ndescription: We hack because we care; we publish because we hack?\ntags: my_stuff, bnb, game_design\n---\n\n[![center](assets/images/bnb-630x500.png)](https://casadeocio.itch.io/beasts-barrows)\n\nI didn't set out to write a system... I swear. It just _happened_.\n\nHere's how it goes:\n1. run a oneshot to play around with [World of Dungeons](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf)\n2. the players; the system; the characters... they all click and it's fun\n3. a campaign begins!\n4. during your campaign, start hacking bits of the system to the tastes of yourself and your players\n<break>\n5. players don't like the magic system? [write your own](/#post?s=a_magic_system)\n6. hack even more stuff in the second year of your campaign\n7. struggle to explain all the hacks to new players\n8. write it all down\n9. fine... I'll publish it 🙄\n\n**NOTE:** _there's no `10. profit`\n\n\nPersonally, I wish people would publish fewer systems and publish more adventures. But here I am.... publishing a system. But it's funny with systems: they're _personal_. **Finding a system that suits your style and hacking off the bits that get in the way should be second nature to a GM**. Continue hacking to the point where it requires a new telling of the rules? Congratulations! You're now a publisher.\n\nI _do_ plan on writing & publishing adventures. Time will tell what other little distractions I'll encounter along the way.\n\nStay tuned...",
    "html": "<p><a href=\"https://casadeocio.itch.io/beasts-barrows\"><img src=\"assets/images/bnb-630x500.png\" alt=\"center\" /></a></p>\n<p>I didn't set out to write a system… I swear. It just <em>happened</em>.</p>\n<p>Here's how it goes:</p>\n<ol>\n<li>run a oneshot to play around with <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons</a></li>\n<li>the players; the system; the characters… they all click and it's fun</li>\n<li>a campaign begins!</li>\n<li>during your campaign, start hacking bits of the system to the tastes of yourself and your players\n<break></li>\n<li>players don't like the magic system? <a href=\"/#post?s=a_magic_system\">write your own</a></li>\n<li>hack even more stuff in the second year of your campaign</li>\n<li>struggle to explain all the hacks to new players</li>\n<li>write it all down</li>\n<li>fine… I'll publish it 🙄</li>\n</ol>\n<p><strong>NOTE:</strong> _there's no <code>10. profit</code></p>\n<p>Personally, I wish people would publish fewer systems and publish more adventures. But here I am…. publishing a system. But it's funny with systems: they're <em>personal</em>. <strong>Finding a system that suits your style and hacking off the bits that get in the way should be second nature to a GM</strong>. Continue hacking to the point where it requires a new telling of the rules? Congratulations! You're now a publisher.</p>\n<p>I <em>do</em> plan on writing &amp; publishing adventures. Time will tell what other little distractions I'll encounter along the way.</p>\n<p>Stay tuned…</p>"
  },
  {
    "meta": {
      "title": "On Vancian Magic",
      "date": "2021-12-28",
      "description": "Some twists to make Vancian magic more palatable",
      "tags": "words, bnb, rules, magic",
      "slug": "on_vancian_magic"
    },
    "markdown": "---\ntitle: On Vancian Magic\ndate: 2021-12-28\ndescription: Some twists to make Vancian magic more palatable\ntags: words, bnb, rules, magic\n---\n\nWhen writing my [magic system](#post?s=a_magic_system) for [Beasts & Barrows](https://casadeocio.itch.io/beasts-barrows), I had two goals: keep it simple and _somewhat_ logical. Towards simplicity, I reused the existing game mechanics: `2d6`, `attributes` and `level`. I also considered using Necropraxis' fabulous [spell dice](https://www.necropraxis.com/2013/11/01/spell-dice) but simplicity won out.\n\nMaking the system logical took a lot more thought.\n\nSeveral people describe my magic system as _Vancian_ (ie. spells must be prepared daily; have a fixed purpose and finite usage). **I did not set out to make my system specifically _non-Vancian_**. This is good because when I think about it, it really is quite Vancian... but with _twists._\n\n<break>\n\nFirst twist: preparation. It's silly to expect magi to prepare spells every day. It _does_ make sense that spells are learned, practiced and _mastered_. We see this in Harry Potter; the kids all practicing enunciation and wand flicking. But this leans more toward _practice_ than preparation. It's also logical that magi have a limited number of spells they've _mastered_. This number increases as their experience increases. **I want players thinking of creative ways to use the spells they have**.\n\n_Spellbooks_. What dolt-of-a-mage cannot memorize a few spells? Must they write them all down in a book? If they're without that book, can they no longer cast a spell? Lame. No. But books _are_ quite useful. **Magi can read and cast _unfamiliar_ spells from scrolls and books**, but it takes more time (a turn). It also incentivizes _scroll hunts_. Fun!\n\nWhich leads us to usage. It's ridiculous that a mage would forget a spell after casting it. Same goes for it vanishing from their spellbook. No. That's crazytown. The twist here is that casting spells takes a physical toll. A mage can safely cast spells, based on their stamina (`con`), and have it scale with their experience (`hd`). This could have also been level but I feel like `hd` is a bit closer to health... same diff. **Cast all the spells you want... but it will eventually hurt**.\n\nLastly, we have _spells with a fixed purpose_. Spell authors will have a lot to say about this. But a few twists can keep them simple and allow for more creative usage. I love **levelless spells**. I can see an argument that spell level denotes complexity or whatever... but I prefer to let a mage learn whatever spell they like. I also added [enhancement spells](#spellTags?t=enhancement). Spells that enhance a target spell but cost an extra spell slot. This helps keep spells simple and flexible.",
    "html": "<p>When writing my <a href=\"#post?s=a_magic_system\">magic system</a> for <a href=\"https://casadeocio.itch.io/beasts-barrows\">Beasts & Barrows</a>, I had two goals: keep it simple and <em>somewhat</em> logical. Towards simplicity, I reused the existing game mechanics: <code>2d6</code>, <code>attributes</code> and <code>level</code>. I also considered using Necropraxis' fabulous <a href=\"https://www.necropraxis.com/2013/11/01/spell-dice\">spell dice</a> but simplicity won out.</p>\n<p>Making the system logical took a lot more thought.</p>\n<p>Several people describe my magic system as <em>Vancian</em> (ie. spells must be prepared daily; have a fixed purpose and finite usage). <strong>I did not set out to make my system specifically <em>non-Vancian</em></strong>. This is good because when I think about it, it really is quite Vancian… but with <em>twists.</em></p>\n<p><break></p>\n<p>First twist: preparation. It's silly to expect magi to prepare spells every day. It <em>does</em> make sense that spells are learned, practiced and <em>mastered</em>. We see this in Harry Potter; the kids all practicing enunciation and wand flicking. But this leans more toward <em>practice</em> than preparation. It's also logical that magi have a limited number of spells they've <em>mastered</em>. This number increases as their experience increases. <strong>I want players thinking of creative ways to use the spells they have</strong>.</p>\n<p><em>Spellbooks</em>. What dolt-of-a-mage cannot memorize a few spells? Must they write them all down in a book? If they're without that book, can they no longer cast a spell? Lame. No. But books <em>are</em> quite useful. <strong>Magi can read and cast <em>unfamiliar</em> spells from scrolls and books</strong>, but it takes more time (a turn). It also incentivizes <em>scroll hunts</em>. Fun!</p>\n<p>Which leads us to usage. It's ridiculous that a mage would forget a spell after casting it. Same goes for it vanishing from their spellbook. No. That's crazytown. The twist here is that casting spells takes a physical toll. A mage can safely cast spells, based on their stamina (<code>con</code>), and have it scale with their experience (<code>hd</code>). This could have also been level but I feel like <code>hd</code> is a bit closer to health… same diff. <strong>Cast all the spells you want… but it will eventually hurt</strong>.</p>\n<p>Lastly, we have <em>spells with a fixed purpose</em>. Spell authors will have a lot to say about this. But a few twists can keep them simple and allow for more creative usage. I love <strong>levelless spells</strong>. I can see an argument that spell level denotes complexity or whatever… but I prefer to let a mage learn whatever spell they like. I also added <a href=\"#spellTags?t=enhancement\">enhancement spells</a>. Spells that enhance a target spell but cost an extra spell slot. This helps keep spells simple and flexible.</p>"
  },
  {
    "meta": {
      "title": "Rando - An Imagination Spark Generator",
      "date": "2024-1-11",
      "description": "A single page",
      "tags": "rando, tools",
      "slug": "rando-an_imagination_spark_generator"
    },
    "markdown": "---\ntitle: Rando - An Imagination Spark Generator\ndate: 2024-1-11\ndescription: A single page\ntags: rando, tools\n---\n\nI love me some random generators but mine were showing my neglect and kinda all over the place. My friend [Wightbred](https://wightbred.itch.io/) turned me onto [GM's Apprentice Cards](https://www.drivethrurpg.com/product/125685/The-GameMasters-Apprentice-Base-Deck), which inspired me to refactor and extend my own generators into a single web app. Thus, [Rando](https://rando.brine.dev) was born.\n\nThanks to feedback from Wightbred and others, I've been able to turn Rando into a surprisingly useful tool. I was able to incorporate all the things I use for my games. I now find myself using it for everything: prep, GM & Player prompts and even prompts to feed ChatGPT. And while I do not _solo [new verb]_ myself, I am told that it works well for Solo Play too.\n\nGive it a spin!\n\n[![center](assets/images/rando.webp)](https://rando.brine.dev)\n",
    "html": "<p>I love me some random generators but mine were showing my neglect and kinda all over the place. My friend <a href=\"https://wightbred.itch.io/\">Wightbred</a> turned me onto <a href=\"https://www.drivethrurpg.com/product/125685/The-GameMasters-Apprentice-Base-Deck\">GM's Apprentice Cards</a>, which inspired me to refactor and extend my own generators into a single web app. Thus, <a href=\"https://rando.brine.dev\">Rando</a> was born.</p>\n<p>Thanks to feedback from Wightbred and others, I've been able to turn Rando into a surprisingly useful tool. I was able to incorporate all the things I use for my games. I now find myself using it for everything: prep, GM &amp; Player prompts and even prompts to feed ChatGPT. And while I do not <em>solo [new verb]</em> myself, I am told that it works well for Solo Play too.</p>\n<p>Give it a spin!</p>\n<p><a href=\"https://rando.brine.dev\"><img src=\"assets/images/rando.webp\" alt=\"center\" /></a></p>"
  },
  {
    "meta": {
      "title": "S0E1 Tower of the Time Wizard",
      "date": "2020-1-19",
      "tags": "podcast, tower_of_the_time_wizard, season0, wodu",
      "description": "This was the very first session of what was _supposed to be_ just a oneshot... but would become a full campaign.",
      "slug": "s0e1-tower_of_the_time_wizard"
    },
    "markdown": "---\ntitle: S0E1 Tower of the Time Wizard\ndate: 2020-1-19\ntags: podcast, tower_of_the_time_wizard, season0, wodu\ndescription: This was the very first session of what was _supposed to be_ just a oneshot... but would become a full campaign.\n---\n\n![thumb](assets/images/season0_thumb.jpg)This was the very first session of what was _supposed to be_ just a oneshot... but would become a full campaign. [Tower of the Time Wizard](assets/images/tower_of_the_time_wizard.pdf) is a fun, one-page, dungeon, written by Andrew Harshman. In this 3 part podcast, we run Andrew's one-pager using the [World of Dungeons](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\nThis was my first time running _WoDu_, and so we take a good amount of time talking about characters and rules.\n\nAlso, apologies for the excessive echo in this session... we fixed this in subsequent sessions. WOOPS!\n\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s0e2-tower_of_the_time_wizard/s0e1-tower_of_the_time_wizard.mp3\"></audio>",
    "html": "<p><img src=\"assets/images/season0_thumb.jpg\" alt=\"thumb\" />This was the very first session of what was <em>supposed to be</em> just a oneshot… but would become a full campaign. <a href=\"assets/images/tower_of_the_time_wizard.pdf\">Tower of the Time Wizard</a> is a fun, one-page, dungeon, written by Andrew Harshman. In this 3 part podcast, we run Andrew's one-pager using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons</a> ruleset.</p>\n<p><break></p>\n<p>This was my first time running <em>WoDu</em>, and so we take a good amount of time talking about characters and rules.</p>\n<p>Also, apologies for the excessive echo in this session… we fixed this in subsequent sessions. WOOPS!</p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s0e2-tower_of_the_time_wizard/s0e1-tower_of_the_time_wizard.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S0E2 Tower of the Time Wizard",
      "date": "2020-1-26",
      "tags": "podcast, tower_of_the_time_wizard, season0, wodu",
      "description": "The players make it to the 2nd floor of the tower and...",
      "slug": "s0e2-tower_of_the_time_wizard"
    },
    "markdown": "---\ntitle: S0E2 Tower of the Time Wizard\ndate: 2020-1-26\ntags: podcast, tower_of_the_time_wizard, season0, wodu\ndescription: The players make it to the 2nd floor of the tower and...\n---\n\n![thumb](assets/images/season0_thumb.jpg)The players make it to the 2nd floor of the tower and **[SPOILER]** _go ham_ on... well... the A-Team and make delicious _slumgullion_.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s0e2-tower_of_the_time_wizard/s0e2-tower_of_the_time_wizard.mp3\"></audio>",
    "html": "<p><img src=\"assets/images/season0_thumb.jpg\" alt=\"thumb\" />The players make it to the 2nd floor of the tower and <strong>[SPOILER]</strong> <em>go ham</em> on… well… the A-Team and make delicious <em>slumgullion</em>.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s0e2-tower_of_the_time_wizard/s0e2-tower_of_the_time_wizard.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S0E3 Tower of the Time Wizard",
      "date": "2020-2-9",
      "tags": "podcast, tower_of_the_time_wizard, season0, wodu",
      "description": "Death becomes us! The 3rd floor puzzles the party and the 4th... well... it's complected.",
      "slug": "s0e3-tower_of_the_time_wizard"
    },
    "markdown": "---\ntitle: S0E3 Tower of the Time Wizard\ndate: 2020-2-9\ntags: podcast, tower_of_the_time_wizard, season0, wodu\ndescription: Death becomes us! The 3rd floor puzzles the party and the 4th... well... it's complected.\n---\n\n![thumb](assets/images/season0_thumb.jpg)Death becomes us! The 3rd floor puzzles the party and the 4th... well... it's complected.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s0e2-tower_of_the_time_wizard/s0e3-tower_of_the_time_wizard.mp3\"></audio>",
    "html": "<p><img src=\"assets/images/season0_thumb.jpg\" alt=\"thumb\" />Death becomes us! The 3rd floor puzzles the party and the 4th… well… it's complected.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s0e2-tower_of_the_time_wizard/s0e3-tower_of_the_time_wizard.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S0E4 Tower of the Time Wizard",
      "date": "2020-2-23",
      "tags": "podcast, tower_of_the_time_wizard, season0, wodu",
      "description": "Today on GorathCast...",
      "slug": "s0e4-tower_of_the_time_wizard"
    },
    "markdown": "---\ntitle: S0E4 Tower of the Time Wizard\ndate: 2020-2-23\ntags: podcast, tower_of_the_time_wizard, season0, wodu\ndescription: Today on GorathCast...\n---\n\n![thumb](assets/images/season0_thumb.jpg)Today on GorathCast...\n\nSeason 0 ends with the party selling some loot and makes the transition to... _season 1_!\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s0e2-tower_of_the_time_wizard/s0e4-tower_of_the_time_wizard.mp3\"></audio>",
    "html": "<p><img src=\"assets/images/season0_thumb.jpg\" alt=\"thumb\" />Today on GorathCast…</p>\n<p>Season 0 ends with the party selling some loot and makes the transition to… <em>season 1</em>!</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s0e2-tower_of_the_time_wizard/s0e4-tower_of_the_time_wizard.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E1 A Balloon for Gorath",
      "date": "2020-3-8",
      "tags": "podcast, season1, wodu",
      "description": "Wait... McMuffin has a bird? In this first episode of **Season 1**, we meet McMuffin's pet toucan, **Birdie**; which has _somehow_ always been sitting on his shoulder? Whatever. We are also introduced to **Santo Regulus Dumont**; a professional drinker and aeronaut hobbyist.",
      "slug": "s1e1-a_balloon_for_gorath"
    },
    "markdown": "---\ntitle: S1E1 A Balloon for Gorath\ndate: 2020-3-8\ntags: podcast, season1, wodu\ndescription: Wait... McMuffin has a bird? In this first episode of **Season 1**, we meet McMuffin's pet toucan, **Birdie**; which has _somehow_ always been sitting on his shoulder? Whatever. We are also introduced to **Santo Regulus Dumont**; a professional drinker and aeronaut hobbyist.\n---\n\n![thumb](assets/images/season1_thumb.png)In this first episode of **Season 1**, we meet McMuffin's pet toucan, **Birdie**; which has _somehow_ always been sitting on his shoulder? Whatever. We are also introduced to **Santo Regulus Dumont**; a professional drinker and aeronaut hobbyist.\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e1-a_balloon_for_gorath.mp3\"></audio>\n\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />In this first episode of <strong>Season 1</strong>, we meet McMuffin's pet toucan, <strong>Birdie</strong>; which has <em>somehow</em> always been sitting on his shoulder? Whatever. We are also introduced to <strong>Santo Regulus Dumont</strong>; a professional drinker and aeronaut hobbyist.</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e1-a_balloon_for_gorath.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E10 Sister Malora - Lady of Light High Priestess",
      "date": "2020-5-24",
      "tags": "podcast, season1, wodu",
      "description": "In this episode we learn about orc mating rituals when Gorath presents a dead dog to Yulia :shrug:. They meet with Sister Malora, the Hight Priestess of the Lady of Light. And they tell here _every. thing._",
      "slug": "s1e10-sister_malora-lady_of_light_high_priestess"
    },
    "markdown": "---\ntitle: S1E10 Sister Malora - Lady of Light High Priestess\ndate: 2020-5-24\ntags: podcast, season1, wodu\ndescription: In this episode we learn about orc mating rituals when Gorath presents a dead dog to Yulia :shrug:. They meet with Sister Malora, the Hight Priestess of the Lady of Light. And they tell here _every. thing._\n---\n\n![thumb](assets/images/season1_thumb.png)In this episode we learn about orc mating rituals when Gorath presents a dead dog to Yulia :shrug:. They meet with Sister Malora, the Hight Priestess of the Lady of Light. And they tell here _every. thing._\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e10-sister_malora-lady_of_light_high_priestess.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />In this episode we learn about orc mating rituals when Gorath presents a dead dog to Yulia :shrug:. They meet with Sister Malora, the Hight Priestess of the Lady of Light. And they tell here <em>every. thing.</em></p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e10-sister_malora-lady_of_light_high_priestess.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E11 Malik Maxwell",
      "date": "2020-6-14",
      "tags": "podcast, season1, wodu",
      "description": "The crew visit the home of Malik Maxwell; noted, local business man and borrower of magic books and expensive booze collector. And they tell him _every. thing.",
      "slug": "s1e11-malik_maxwell"
    },
    "markdown": "---\ntitle: S1E11 Malik Maxwell\ndate: 2020-6-14\ntags: podcast, season1, wodu\ndescription: The crew visit the home of Malik Maxwell; noted, local business man and borrower of magic books and expensive booze collector. And they tell him _every. thing.\n---\n\n![thumb](assets/images/season1_thumb.png)The crew visit the home of Malik Maxwell: noted, local business man and borrower of magic books and expensive booze collector. And they tell him _every. thing._.\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e11-malik_maxwell.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />The crew visit the home of Malik Maxwell: noted, local business man and borrower of magic books and expensive booze collector. And they tell him <em>every. thing.</em>.</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e11-malik_maxwell.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E12 Black Dog",
      "date": "2020-7-26",
      "tags": "podcast, season1, wodu",
      "description": "Malik and the crew take on a **Black Dog**... then go for a swim in the **Infinity Fountain**.",
      "slug": "s1e12-black_dog"
    },
    "markdown": "---\ntitle: S1E12 Black Dog\ndate: 2020-7-26\ntags: podcast, season1, wodu\ndescription: Malik and the crew take on a **Black Dog**... then go for a swim in the **Infinity Fountain**.\n---\n\n![thumb](assets/images/season1_thumb.png)Malik and the crew take on a **Black Dog**... then go for a swim in the **Infinity Fountain**.\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e12-black_dog.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />Malik and the crew take on a <strong>Black Dog</strong>… then go for a swim in the <strong>Infinity Fountain</strong>.</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e12-black_dog.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E13 The Return of Naven Mag",
      "date": "2020-8-2",
      "tags": "podcast, season1, wodu",
      "description": "Naven Mag returns! The crew find themselves back in _The Time Wizard's_ tower. More delicious tea; more _complicated_. They also fine out that _they can mirrorwalk_!",
      "slug": "s1e13-the_return_of_naven_mag"
    },
    "markdown": "---\ntitle: S1E13 The Return of Naven Mag\ndate: 2020-8-2\ntags: podcast, season1, wodu\ndescription: Naven Mag returns! The crew find themselves back in _The Time Wizard's_ tower. More delicious tea; more _complicated_. They also fine out that _they can mirrorwalk_!\n---\n\n![thumb](assets/images/season1_thumb.png)Naven Mag returns! The crew find themselves back in _The Time Wizard's_ tower. More delicious tea; more _complicated_. They also fine out that _they can mirrorwalk_!\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e13-the_return_of_naven_mag.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />Naven Mag returns! The crew find themselves back in <em>The Time Wizard's</em> tower. More delicious tea; more <em>complicated</em>. They also fine out that <em>they can mirrorwalk</em>!</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e13-the_return_of_naven_mag.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E14 The Mirror Plane",
      "date": "2020-8-9",
      "tags": "podcast, season1, wodu",
      "description": "Welcome to the _Mirror Plane_! The crew meet a shiny spider...",
      "slug": "s1e14-the_mirror_plane"
    },
    "markdown": "---\ntitle: S1E14 The Mirror Plane\ndate: 2020-8-9\ntags: podcast, season1, wodu\ndescription: Welcome to the _Mirror Plane_! The crew meet a shiny spider...\n---\n\n![thumb](assets/images/season1_thumb.png)Welcome to the _Mirror Plane_! The crew meet a shiny spider...\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e14-the_mirror_plane.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />Welcome to the <em>Mirror Plane</em>! The crew meet a shiny spider…</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e14-the_mirror_plane.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E15 Little Orc's Room",
      "date": "2020-8-16",
      "tags": "podcast, season1, wodu",
      "description": "Gorath visits the _little orc's room_ and then he crew travels through the mirror plane, looking for Malik's house. They meet some shiny ravens...",
      "slug": "s1e15-little_orcs_room"
    },
    "markdown": "---\ntitle: S1E15 Little Orc's Room\ndate: 2020-8-16\ntags: podcast, season1, wodu\ndescription: Gorath visits the _little orc's room_ and then he crew travels through the mirror plane, looking for Malik's house. They meet some shiny ravens...\n---\n\n![thumb](assets/images/season1_thumb.png)Gorath visits the _little orc's room_ and then he crew travels through the mirror plane, looking for Malik's house. They meet some shiny ravens...\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e15-little_orcs_room.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />Gorath visits the <em>little orc's room</em> and then he crew travels through the mirror plane, looking for Malik's house. They meet some shiny ravens…</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e15-little_orcs_room.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E16 Chillin' with the Tanpire",
      "date": "2020-8-30",
      "tags": "podcast, season1, wodu",
      "description": "Our heroes navigate the mirror plane back to Malik Maxwell's (aka _The Tanpire). They rest up; have some funky dreams; do a little snooping; ask _all_ the questions; and formulate a plan!",
      "slug": "s1e16-chillin_with_the_tanpire"
    },
    "markdown": "---\ntitle: S1E16 Chillin' with the Tanpire\ndate: 2020-8-30\ntags: podcast, season1, wodu\ndescription: Our heroes navigate the mirror plane back to Malik Maxwell's (aka _The Tanpire). They rest up; have some funky dreams; do a little snooping; ask _all_ the questions; and formulate a plan!\n---\n\n![thumb](assets/images/season1_thumb.png)Our heroes navigate the mirror plane back to Malik Maxwell's (aka _The Tanpire). They rest up; have some funky dreams; do a little snooping; ask _all_ the questions; and formulate a plan!\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e16-chillin_with_the_tanpire.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />Our heroes navigate the mirror plane back to Malik Maxwell's (aka _The Tanpire). They rest up; have some funky dreams; do a little snooping; ask _all_ the questions; and formulate a plan!</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e16-chillin_with_the_tanpire.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E17 Never Trust a Cat Statue",
      "date": "2020-10-4",
      "tags": "podcast, season1, wodu",
      "description": "The crew execute their _cunning plan_ and snoop around the **The Temple of the Lady of Light**. And they would have gotten away with it too _if it wasn't for that pesky cat statue_.",
      "slug": "s1e17-never_trust_a_cat_statue"
    },
    "markdown": "---\ntitle: S1E17 Never Trust a Cat Statue\ndate: 2020-10-4\ntags: podcast, season1, wodu\ndescription: The crew execute their _cunning plan_ and snoop around the **The Temple of the Lady of Light**. And they would have gotten away with it too _if it wasn't for that pesky cat statue_.\n---\n\n![thumb](assets/images/season1_thumb.png)The crew execute their _cunning plan_ and snoop around the **The Temple of the Lady of Light**. And they would have gotten away with it too _if it wasn't for that pesky cat statue_.\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e17-never_trust_a_cat_statue.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />The crew execute their <em>cunning plan</em> and snoop around the <strong>The Temple of the Lady of Light</strong>. And they would have gotten away with it too <em>if it wasn't for that pesky cat statue</em>.</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e17-never_trust_a_cat_statue.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E18 Attack of the Color Guard",
      "date": "2020-10-11",
      "tags": "podcast, season1, wodu",
      "description": "This color guard has teeth! The Crew face off with _Louie Bluie_ and his colorful friends... honestly the cat statue may have given them more of a problem",
      "slug": "s1e18-attack_of_the_color_guard"
    },
    "markdown": "---\ntitle: S1E18 Attack of the Color Guard\ndate: 2020-10-11\ntags: podcast, season1, wodu\ndescription: \"This color guard has teeth! The Crew face off with _Louie Bluie_ and his colorful friends... honestly the cat statue may have given them more of a problem\"\n---\n\n![thumb](assets/images/season1_thumb.png)**This color guard has teeth!** The Crew face off with _Louie Bluie_ and his colorful friends... _honestly the cat statue may have given them more of a problem_ 🤔\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e18-attack_of_the_color_guard.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" /><strong>This color guard has teeth!</strong> The Crew face off with <em>Louie Bluie</em> and his colorful friends… <em>honestly the cat statue may have given them more of a problem</em> 🤔</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e18-attack_of_the_color_guard.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E19 Closet Full of Skeletons",
      "date": "2020-10-18",
      "tags": "podcast, season1, wodu",
      "description": "We all have skeletons in our closets...",
      "slug": "s1e19-closet_full_of_skeletons"
    },
    "markdown": "---\ntitle: S1E19 Closet Full of Skeletons\ndate: 2020-10-18\ntags: podcast, season1, wodu\ndescription: We all have skeletons in our closets...\n---\n\n![thumb](assets/images/season1_thumb.png)We all have skeletons in our closets...\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e19-closet_full_of_skeletons.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />We all have skeletons in our closets…</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e19-closet_full_of_skeletons.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E2 Hissy Fit",
      "date": "2020-3-15",
      "tags": "podcast, season1, wodu",
      "description": "The crew travel by balloon to McMufin's home town of ~~Hissy Fit~~ **Hsifilet**.",
      "slug": "s1e2-hissy-fit"
    },
    "markdown": "---\ntitle: S1E2 Hissy Fit\ndate: 2020-3-15\ntags: podcast, season1, wodu\ndescription: The crew travel by balloon to McMufin's home town of ~~Hissy Fit~~ **Hsifilet**.\n---\n\n![thumb](assets/images/season1_thumb.png)The crew travel by balloon to McMufin's home town of ~Hissy Fit~ **Hsifilet**.\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e2-hissy_fit.mp3\"></audio>",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />The crew travel by balloon to McMufin's home town of ~Hissy Fit~ <strong>Hsifilet</strong>.</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e2-hissy_fit.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E20 Burning Down the House",
      "date": "2020-11-1",
      "tags": "podcast, season1, wodu",
      "description": "Watch out, you might get what you're after; cool Birdy, that lighter's getting lighter; this voodoo... looks a lot like me",
      "slug": "s1e20-burning_down_the_house"
    },
    "markdown": "---\ntitle: S1E20 Burning Down the House\ndate: 2020-11-1\ntags: podcast, season1, wodu\ndescription: Watch out, you might get what you're after; cool Birdy, that lighter's getting lighter; this voodoo... looks a lot like me\n---\n\n![thumb](assets/images/season1_thumb.png)Watch out, you might get what you're after<br>\ncool Birdy, that lighter's getting lighter<br>\nthis voodoo... looks a lot like me<br>\nburning down the house\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e19-closet_full_of_skeletons.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />Watch out, you might get what you're after<br>\ncool Birdy, that lighter's getting lighter<br>\nthis voodoo… looks a lot like me<br>\nburning down the house</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e19-closet_full_of_skeletons.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E21 Let Sleeping Salt Circles Lie",
      "date": "2020-11-15",
      "tags": "podcast, season1, wodu",
      "description": "Gorath and Yulia walk into a mirror... but are instead whisked away by a rift in time. They meet a nice man inside a salt circle... nothing to see here.",
      "slug": "s1e21-let_sleeping_salt_circles_lie"
    },
    "markdown": "---\ntitle: S1E21 Let Sleeping Salt Circles Lie\ndate: 2020-11-15\ntags: podcast, season1, wodu\ndescription: Gorath and Yulia walk into a mirror... but are instead whisked away by a rift in time. They meet a nice man inside a salt circle... nothing to see here.\n---\n\n![thumb](assets/images/season1_thumb.png)Gorath and Yulia walk into a mirror... but are instead whisked away by a rift in time. They meet a nice man inside a salt circle... nothing to see here.\n\nThis episode was part side quest; part DLT (McMuffin's aunt) origin story; and part one-shot via [LotFP's Tower of the Stargazer](http://www.lotfp.com/RPG/products/tower-of-the-stargazer).\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e21-let_sleeping_salt_circles_lie.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />Gorath and Yulia walk into a mirror… but are instead whisked away by a rift in time. They meet a nice man inside a salt circle… nothing to see here.</p>\n<p>This episode was part side quest; part DLT (McMuffin's aunt) origin story; and part one-shot via <a href=\"http://www.lotfp.com/RPG/products/tower-of-the-stargazer\">LotFP's Tower of the Stargazer</a>.</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e21-let_sleeping_salt_circles_lie.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E22 Meddling Kids",
      "date": "2020-11-22",
      "tags": "podcast, season1, bnb",
      "description": "The Scooby crew break into **The Temple of the Lady of Light**. McMuffin concocts a _cunning plan_ to dress up as delivery men, while Yulia battles an evil broom closet!",
      "slug": "s1e22-meddling-kids"
    },
    "markdown": "---\ntitle: S1E22 Meddling Kids\ndate: 2020-11-22\ntags: podcast, season1, bnb\ndescription: The Scooby crew break into **The Temple of the Lady of Light**. McMuffin concocts a _cunning plan_ to dress up as delivery men, while Yulia battles an evil broom closet!\n---\n\n![thumb](assets/images/season1_thumb.png)The Scooby crew break into **The Temple of the Lady of Light**. McMuffin concocts a _cunning plan_ to dress up as delivery men, while Yulia battles an evil broom closet!\n\n_Sidebar: we tweaked the audio in this episode... should be a bit better :shrug:_\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e22-meddling_kids.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />The Scooby crew break into <strong>The Temple of the Lady of Light</strong>. McMuffin concocts a <em>cunning plan</em> to dress up as delivery men, while Yulia battles an evil broom closet!</p>\n<p><em>Sidebar: we tweaked the audio in this episode… should be a bit better :shrug:</em></p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e22-meddling_kids.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E23 Eat Your Heart Out",
      "date": "2020-12-6",
      "tags": "podcast, season1, bnb",
      "description": "Are three McMuffins better than one? We find out in this episode! Also, _what's with the bowl of fish?_ Yulia meets The Lady of Light and gets the answers to her heart's desires.",
      "slug": "s1e23-eat_your_heart_out"
    },
    "markdown": "---\ntitle: S1E23 Eat Your Heart Out\ndate: 2020-12-6\ntags: podcast, season1, bnb\ndescription: Are three McMuffins better than one? We find out in this episode! Also, _what's with the bowl of fish?_ Yulia meets The Lady of Light and gets the answers to her heart's desires.\n---\n\n![thumb](assets/images/season1_thumb.png)Are three McMuffins better than one? We find out in this episode! Also, _what's with the bowl of fish?_ Yulia meets The Lady of Light and gets the answers to her heart's desires.\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e23-eat_your_heart_out.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />Are three McMuffins better than one? We find out in this episode! Also, <em>what's with the bowl of fish?</em> Yulia meets The Lady of Light and gets the answers to her heart's desires.</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e23-eat_your_heart_out.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E24 Shot Through The Heart And You're To Blame",
      "date": "2020-12-13",
      "tags": "podcast, season1, bnb",
      "description": "**THE SEASON 1 FINALE IS HERE!** `No spoilers` but Death returns... good luck, crew!",
      "slug": "s1e24-shot_through_the_heart_and_youre_to_blame"
    },
    "markdown": "---\ntitle: S1E24 Shot Through The Heart And You're To Blame\ndate: 2020-12-13\ntags: podcast, season1, bnb\ndescription: **THE SEASON 1 FINALE IS HERE!** `No spoilers` but Death returns... good luck, crew!\n---\n\n![thumb](assets/images/season1_thumb.png)**THE SEASON 1 FINALE IS HERE!** `No spoilers` but Death returns... good luck, crew!\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e24-shot_through_the_heart_and_youre_to_blame.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" /><strong>THE SEASON 1 FINALE IS HERE!</strong> <code>No spoilers</code> but Death returns… good luck, crew!</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e24-shot_through_the_heart_and_youre_to_blame.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E5 Death and McMuffin",
      "date": "2020-4-12",
      "tags": "podcast, season1, wodu",
      "description": "In order to save his parents, our _reluctant sailor_, McMuffin dies and bargains with Death!",
      "slug": "s1e5-death_and_mcmuffin"
    },
    "markdown": "---\ntitle: S1E5 Death and McMuffin\ndate: 2020-4-12\ntags: podcast, season1, wodu\ndescription: In order to save his parents, our _reluctant sailor_, McMuffin dies and bargains with Death!\n---\n\n![thumb](assets/images/season1_thumb.png)In order to save his parents, our _reluctant sailor_, McMuffin dies and bargains with Death!\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e5-death_and_mcmuffin.mp3\"></audio>",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />In order to save his parents, our <em>reluctant sailor</em>, McMuffin dies and bargains with Death!</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e5-death_and_mcmuffin.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E6 A Debt for the Dead - Part 1",
      "date": "2020-4-19",
      "tags": "podcast, season1, wodu",
      "description": "The crew fly through a stitch in time and find themselves... well... dead. We are also introduced to _Breakfast Donuts_!",
      "slug": "s1e6-a_debt_for_the_dead_part_1"
    },
    "markdown": "---\ntitle: S1E6 A Debt for the Dead - Part 1\ndate: 2020-4-19\ntags: podcast, season1, wodu\ndescription: The crew fly through a stitch in time and find themselves... well... dead. We are also introduced to _Breakfast Donuts_!\n---\n\n![thumb](assets/images/season1_thumb.png)The crew fly through a stitch in time and find themselves... well... dead... _again_. We are also introduced to delicious _Breakfast Donuts_!\n\nThis is a one-ish shot that I wrote for the [2020 One Page Dungeon Contest](https://www.dungeoncontest.com/opdc-2020) and slipped it into our campaign (so sneaky). It's called [a Debt for the Dead](https://brine.dev/#post?s=one_page_dungeon_contest). It turned out to be a ton of fun, and _marked_ the entire campaign FOREVAH! Looking at it today, I can see why it wasn't well received by the judges :) I really hate doing _print work_ and it shows. Still... fun stuff!\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e6-a_debt_for_the_dead-part_1.mp3\"></audio>",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />The crew fly through a stitch in time and find themselves… well… dead… <em>again</em>. We are also introduced to delicious <em>Breakfast Donuts</em>!</p>\n<p>This is a one-ish shot that I wrote for the <a href=\"https://www.dungeoncontest.com/opdc-2020\">2020 One Page Dungeon Contest</a> and slipped it into our campaign (so sneaky). It's called <a href=\"https://brine.dev/#post?s=one_page_dungeon_contest\">a Debt for the Dead</a>. It turned out to be a ton of fun, and <em>marked</em> the entire campaign FOREVAH! Looking at it today, I can see why it wasn't well received by the judges :) I really hate doing <em>print work</em> and it shows. Still… fun stuff!</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e6-a_debt_for_the_dead-part_1.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E8 Is That a Musket In Your Pocket?",
      "date": "2020-5-3",
      "tags": "podcast, season1, wodu",
      "description": "The Toucan crew is back on the board with Santo but but make an emergency landing. Not for more beer (though :thinking:) but because of a storm. They build a fire right by an Owl Bear nest and McMuffin realizes _he has a musket_ and he's not afraid to use it!",
      "slug": "s1e8-is_that_a_musket_in_your_pocket"
    },
    "markdown": "---\ntitle: S1E8 Is That a Musket In Your Pocket?\ndate: 2020-5-3\ntags: podcast, season1, wodu\ndescription: The Toucan crew is back on the board with Santo but but make an emergency landing. Not for more beer (though :thinking:) but because of a storm. They build a fire right by an Owl Bear nest and McMuffin realizes _he has a musket_ and he's not afraid to use it!\n---\n\n![thumb](assets/images/season1_thumb.png)The Toucan crew is back on the board with Santo but but make an emergency landing. Not for more beer (though :thinking:) but because of a storm. They build a fire right by an Owl Bear nest and McMuffin realizes _he has a musket_ and he's not afraid to use it!\n\n**World of Brine** is an _actual play_,\nrpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e8-is_that_a_musket_in_your_pocket.mp3\"></audio>",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />The Toucan crew is back on the board with Santo but but make an emergency landing. Not for more beer (though 🤔) but because of a storm. They build a fire right by an Owl Bear nest and McMuffin realizes <em>he has a musket</em> and he's not afraid to use it!</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>,\nrpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e8-is_that_a_musket_in_your_pocket.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "S1E9 Cloud City",
      "date": "2020-5-10",
      "tags": "podcast, season1, wodu",
      "description": "The crew lands in Cloud City! Gorath is being followed by a Black Dog; they run into _Little Baby Drekel_; and they learn about a murder mystery...",
      "slug": "s1e9-cloud_city"
    },
    "markdown": "---\ntitle: S1E9 Cloud City\ndate: 2020-5-10\ntags: podcast, season1, wodu\ndescription: The crew lands in Cloud City! Gorath is being followed by a Black Dog; they run into _Little Baby Drekel_; and they learn about a murder mystery...\n---\n\n![thumb](assets/images/season1_thumb.png)The crew lands in Cloud City! Gorath is being followed by a Black Dog; they run into _Little Baby Drekel_; and they learn about a murder mystery...\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [World of Dungeons (WoDu)](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) ruleset.\n\n<break>\n\n### Cast\n- **Yulia** - human cleric\n- **Gorath** - orc fighter\n- **McMuffin** - human reluctant sailor\n- **Brine** - your _friendly_ GM\n\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e9-cloud_city.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/season1_thumb.png\" alt=\"thumb\" />The crew lands in Cloud City! Gorath is being followed by a Black Dog; they run into <em>Little Baby Drekel</em>; and they learn about a murder mystery…</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons (WoDu)</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Yulia</strong> - human cleric</li>\n<li><strong>Gorath</strong> - orc fighter</li>\n<li><strong>McMuffin</strong> - human reluctant sailor</li>\n<li><strong>Brine</strong> - your <em>friendly</em> GM</li>\n</ul>\n<audio controls src=\"https://archive.org/download/s1e9-cloud_city/s1e9-cloud_city.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "Skills and Special Abilities",
      "date": "2021-7-25",
      "description": "A list of skills and special abilities that we use in World of Brine; based on World of Dungeon rules. ",
      "tags": "wodu, rules",
      "slug": "skills_and_special_abilities"
    },
    "markdown": "---\ntitle: Skills and Special Abilities\ndate: 2021-7-25\ndescription: A list of skills and special abilities that we use in World of Brine; based on World of Dungeon rules. \ntags: wodu, rules\n---\n\n_v 1.3_\n\nIn [World of Dungeons](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf), `Skills and Special Abilities` help define a character's class. They map directly to the classic classes: **Cleric, Fighter, Mage, Ranger & Thief**; but they can also be bent to accommodate custom classes... like [Alchemist](assets/images/chars/benedict_sandaries.pdf) or [Road Agent](assets/images/chars/black_jenny.pdf). The following details how these rules have evolved in my games.\n\n<break>\n\n### Skills\n> When a PC attempts something in the fiction that might be covered by a skill (eg. Athletics when climbing) they can roll _advantage_ (`3d6` & keep the highest 2) `+ mod` instead of a regular roll.\n\n- **Athletics:** `+str/dex`: feats of strength and dexterity\n- **Awareness:** `+wis`: perceiving the environment around you\n- **Deception:** `+cha`: attempt to deceive\n- **Decipher:** `+wis`: discern a thing; attempt to understand or interpret\n- **Heal:** `+wis`: provide an extra `hd` to the party when resting/rolling `hp`; heal `1d6+level hp` with your touch.\n- **Leadership:** `+cha`: use leverage to influence someone; diplomacy; intimidate; parley\n- **Lore:** `+int`: consult your accumulated knowledge about something\n- **Stealth:** `+dex`: attempt to be sneaky\n- **Survival:** `+con`: foraging, hunting; start a fire in unfavorable conditions, etc\n\n\n### Special Abilities\n> These abilities can add additional flavor to a class. The word `attempt` will generally signify rolling a `2d6+mod` when applicable.\n\n- **Backstab:** +3 damage from concealment\n- **Bless:** anoint items with holy water for +/-3 damage and as magical\n- **[Cantrips](https://brine.dev/#spellTags?t=cantrip):** cast 3 simple magical spells\n- **Command:** attempt to command any spirit, demon, etc.\n- **Cure:** attempt to neutralize poisons or remove curses\n- **Hardy:** +6 hp\n- **Lucky:** turn a miss into a partial success once per day\n- **Pet:** you have a loyal and _effective_ animal companion\n- **Reflexes:** you always act first and cannot be surprised\n- **Ritual:** attempt occult rituals; detailed in ancient tomes and scrolls\n- **Scout:** with you on point, your party can move quicker, cover more ground and spot targets before they spot you\n- **Skirmish:** +1 damage; worn armor counts as one type lighter\n- **Slay:** +2 melee damage\n- **Summon:** summon a spirit you know by its true name\n- **Tinker:** pick a lock, pocket or trap w/ tools\n- **Tough:** +1 armor\n- **Turn:** attempt to hold undead at bay with your faith and holy symbol\n- **Vision:** commune with your deity or demon via holy water/drugs\n- **Volley:** +2 ranged damage\n- **Wild:** converse with and attempt to command animals; some classes (eg. Druids) use this to _shapeshift_\n",
    "html": "<p><em>v 1.3</em></p>\n<p>In <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons</a>, <code>Skills and Special Abilities</code> help define a character's class. They map directly to the classic classes: <strong>Cleric, Fighter, Mage, Ranger & Thief</strong>; but they can also be bent to accommodate custom classes… like <a href=\"assets/images/chars/benedict_sandaries.pdf\">Alchemist</a> or <a href=\"assets/images/chars/black_jenny.pdf\">Road Agent</a>. The following details how these rules have evolved in my games.</p>\n<p><break></p>\n<h3 id=\"skills\">Skills</h3>\n<blockquote>\n  <p>When a PC attempts something in the fiction that might be covered by a skill (eg. Athletics when climbing) they can roll <em>advantage</em> (<code>3d6</code> &amp; keep the highest 2) <code>+ mod</code> instead of a regular roll.</p>\n</blockquote>\n<ul>\n<li><strong>Athletics:</strong> <code>+str/dex</code>: feats of strength and dexterity</li>\n<li><strong>Awareness:</strong> <code>+wis</code>: perceiving the environment around you</li>\n<li><strong>Deception:</strong> <code>+cha</code>: attempt to deceive</li>\n<li><strong>Decipher:</strong> <code>+wis</code>: discern a thing; attempt to understand or interpret</li>\n<li><strong>Heal:</strong> <code>+wis</code>: provide an extra <code>hd</code> to the party when resting/rolling <code>hp</code>; heal <code>1d6+level hp</code> with your touch.</li>\n<li><strong>Leadership:</strong> <code>+cha</code>: use leverage to influence someone; diplomacy; intimidate; parley</li>\n<li><strong>Lore:</strong> <code>+int</code>: consult your accumulated knowledge about something</li>\n<li><strong>Stealth:</strong> <code>+dex</code>: attempt to be sneaky</li>\n<li><strong>Survival:</strong> <code>+con</code>: foraging, hunting; start a fire in unfavorable conditions, etc</li>\n</ul>\n<h3 id=\"specialabilities\">Special Abilities</h3>\n<blockquote>\n  <p>These abilities can add additional flavor to a class. The word <code>attempt</code> will generally signify rolling a <code>2d6+mod</code> when applicable.</p>\n</blockquote>\n<ul>\n<li><strong>Backstab:</strong> +3 damage from concealment</li>\n<li><strong>Bless:</strong> anoint items with holy water for +/-3 damage and as magical</li>\n<li><strong><a href=\"https://brine.dev/#spellTags?t=cantrip\">Cantrips</a>:</strong> cast 3 simple magical spells</li>\n<li><strong>Command:</strong> attempt to command any spirit, demon, etc.</li>\n<li><strong>Cure:</strong> attempt to neutralize poisons or remove curses</li>\n<li><strong>Hardy:</strong> +6 hp</li>\n<li><strong>Lucky:</strong> turn a miss into a partial success once per day</li>\n<li><strong>Pet:</strong> you have a loyal and <em>effective</em> animal companion</li>\n<li><strong>Reflexes:</strong> you always act first and cannot be surprised</li>\n<li><strong>Ritual:</strong> attempt occult rituals; detailed in ancient tomes and scrolls</li>\n<li><strong>Scout:</strong> with you on point, your party can move quicker, cover more ground and spot targets before they spot you</li>\n<li><strong>Skirmish:</strong> +1 damage; worn armor counts as one type lighter</li>\n<li><strong>Slay:</strong> +2 melee damage</li>\n<li><strong>Summon:</strong> summon a spirit you know by its true name</li>\n<li><strong>Tinker:</strong> pick a lock, pocket or trap w/ tools</li>\n<li><strong>Tough:</strong> +1 armor</li>\n<li><strong>Turn:</strong> attempt to hold undead at bay with your faith and holy symbol</li>\n<li><strong>Vision:</strong> commune with your deity or demon via holy water/drugs</li>\n<li><strong>Volley:</strong> +2 ranged damage</li>\n<li><strong>Wild:</strong> converse with and attempt to command animals; some classes (eg. Druids) use this to <em>shapeshift</em></li>\n</ul>"
  },
  {
    "meta": {
      "title": "The Frost Spire - Part 1",
      "date": "2022-5-22",
      "image": "https://brine.dev/assets/images/frost_spire.png",
      "tags": "podcast, oneshot, 1420",
      "description": "The Arson Crew find themselves in the middle of an old fey tale. The Ice Prince is legend. A prince lives who travels the seas in a castle of ice; his wives feasting on children who misbehave.",
      "slug": "the_frost_spire-part1"
    },
    "markdown": "---\ntitle: The Frost Spire - Part 1\ndate: 2022-5-22\nimage: https://brine.dev/assets/images/frost_spire.png\ntags: podcast, oneshot, 1420\ndescription: The Arson Crew find themselves in the middle of an old fey tale. \"The Ice Prince\" is legend. A prince lives who travels the seas in a castle of ice; his wives feasting on children who misbehave.\n---\n\n![thumb](assets/images/frost_spire.png)The Arson Crew™ find themselves in the middle of an old fey tale. \"The Ice Prince\" is legend. A prince lives who travels the seas in a castle of ice; his wives feasting on children who misbehave.\n\n**The Frost Spire**\n\nLong ago, when the world was new an elf king was banished and tossed into the sea. His hatred was so great, and so cold, that it froze the water into a spire of ice and he was cursed to drift forever, bringing winter to the world.\n\n_But sometimes, he hungers for the blood of bad children..._\n\n[The Frost Spire](https://swordfishislands.itch.io/the-frost-spire) by Jacob Hurst\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [1420](https://casadeocio.itch.io/1420-bnb) ruleset.\n\n<break>\n\n### Cast\n- **Cool Shade Beneath Midday Sun (Shade)** - Stealthy, Expert Survivalist, Perceptive\n- **The Fox** - Deadly, Stealthy, Perceptive, Allusive\n- **The Fighter** - Tough, Deadly, Fighter\n- **Brine** - your _friendly_ Game Maestro\n\n<audio controls src=\"https://archive.org/download/the_frost_spire-part3/the_frost_spire-part1.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/frost_spire.png\" alt=\"thumb\" />The Arson Crew™ find themselves in the middle of an old fey tale. \"The Ice Prince\" is legend. A prince lives who travels the seas in a castle of ice; his wives feasting on children who misbehave.</p>\n<p><strong>The Frost Spire</strong></p>\n<p>Long ago, when the world was new an elf king was banished and tossed into the sea. His hatred was so great, and so cold, that it froze the water into a spire of ice and he was cursed to drift forever, bringing winter to the world.</p>\n<p><em>But sometimes, he hungers for the blood of bad children…</em></p>\n<p><a href=\"https://swordfishislands.itch.io/the-frost-spire\">The Frost Spire</a> by Jacob Hurst</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"https://casadeocio.itch.io/1420-bnb\">1420</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Cool Shade Beneath Midday Sun (Shade)</strong> - Stealthy, Expert Survivalist, Perceptive</li>\n<li><strong>The Fox</strong> - Deadly, Stealthy, Perceptive, Allusive</li>\n<li><strong>The Fighter</strong> - Tough, Deadly, Fighter</li>\n<li><strong>Brine</strong> - your <em>friendly</em> Game Maestro</li>\n</ul>\n<audio controls src=\"https://archive.org/download/the_frost_spire-part3/the_frost_spire-part1.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "The Frost Spire - Part 2",
      "date": "2022-5-29",
      "image": "https://brine.dev/assets/images/frost_spire.png",
      "tags": "podcast, oneshot, 1420",
      "description": "Oh no! He's hot! A frozen sea is no place for a himbo... I mean, if there is nobody around to gaze lovingly into the eyes; strong jawline and moonstruck mustache of a handsome man... is he really handsome? Oh, and there's some wolves or something... whatever. Now MOVE! You're blocking his moonlight.",
      "slug": "the_frost_spire-part2"
    },
    "markdown": "---\ntitle: The Frost Spire - Part 2\ndate: 2022-5-29\nimage: https://brine.dev/assets/images/frost_spire.png\ntags: podcast, oneshot, 1420\ndescription: Oh no! He's hot! A frozen sea is no place for a himbo... I mean, if there is nobody around to gaze lovingly into the eyes; strong jawline and moonstruck mustache of a handsome man... is he really handsome? Oh, and there's some wolves or something... whatever. Now MOVE! You're blocking his moonlight.\n---\n\n![thumb](assets/images/frost_spire.png)**Oh no! He's hot!**\n\nA frozen sea is no place for a himbo... I mean, if there is nobody around to gaze lovingly into the eyes; strong jawline and moonstruck mustache of a handsome man... is he really handsome? Oh, and there's some wolves or something... whatever. Now MOVE! You're blocking his moonlight.\n\n**The Frost Spire**\n\nLong ago, when the world was new an elf king was banished and tossed into the sea. His hatred was so great, and so cold, that it froze the water into a spire of ice and he was cursed to drift forever, bringing winter to the world.\n\n_But sometimes, he hungers for the blood of bad children..._\n\n[The Frost Spire](https://swordfishislands.itch.io/the-frost-spire) by Jacob Hurst\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [1420](https://casadeocio.itch.io/1420-bnb) ruleset.\n\n<break>\n\n### Cast\n- **Cool Shade Beneath Midday Sun (Shade)** - Stealthy, Expert Survivalist, Perceptive\n- **The Fox** - Deadly, Stealthy, Perceptive, Allusive\n- **The Fighter** - Tough, Deadly, Fighter\n- **Checkers Obmih** - Healer, Tough, Fighter, Strong\n- **Brine** - your _friendly_ Game Maestro\n\n<audio controls src=\"https://archive.org/download/the_frost_spire-part3/the_frost_spire-part2.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/frost_spire.png\" alt=\"thumb\" /><strong>Oh no! He's hot!</strong></p>\n<p>A frozen sea is no place for a himbo… I mean, if there is nobody around to gaze lovingly into the eyes; strong jawline and moonstruck mustache of a handsome man… is he really handsome? Oh, and there's some wolves or something… whatever. Now MOVE! You're blocking his moonlight.</p>\n<p><strong>The Frost Spire</strong></p>\n<p>Long ago, when the world was new an elf king was banished and tossed into the sea. His hatred was so great, and so cold, that it froze the water into a spire of ice and he was cursed to drift forever, bringing winter to the world.</p>\n<p><em>But sometimes, he hungers for the blood of bad children…</em></p>\n<p><a href=\"https://swordfishislands.itch.io/the-frost-spire\">The Frost Spire</a> by Jacob Hurst</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"https://casadeocio.itch.io/1420-bnb\">1420</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Cool Shade Beneath Midday Sun (Shade)</strong> - Stealthy, Expert Survivalist, Perceptive</li>\n<li><strong>The Fox</strong> - Deadly, Stealthy, Perceptive, Allusive</li>\n<li><strong>The Fighter</strong> - Tough, Deadly, Fighter</li>\n<li><strong>Checkers Obmih</strong> - Healer, Tough, Fighter, Strong</li>\n<li><strong>Brine</strong> - your <em>friendly</em> Game Maestro</li>\n</ul>\n<audio controls src=\"https://archive.org/download/the_frost_spire-part3/the_frost_spire-part2.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "The Frost Spire - Part 3",
      "date": "2022-6-5",
      "image": "https://brine.dev/assets/images/frost_spire.png",
      "tags": "podcast, oneshot, 1420",
      "description": "While ascending the Frost Spire, the crew come upon a ~~roadblock~~ knight in non-shining armor. As Wrath would tell you, returning from the dead is easy compared to climbing an ice tower in full plate. But the crew ties a rope around him and schleps him along (lest be stuck waiting for his slow-ass). Revenants--come to find out--like throwing rocks and hitting things... who knew :shrug:",
      "slug": "the_frost_spire-part3"
    },
    "markdown": "---\ntitle: The Frost Spire - Part 3\ndate: 2022-6-5\nimage: https://brine.dev/assets/images/frost_spire.png\ntags: podcast, oneshot, 1420\ndescription: While ascending the Frost Spire, the crew come upon a ~~roadblock~~ knight in non-shining armor. As Wrath would tell you, returning from the dead is easy compared to climbing an ice tower in full plate. But the crew ties a rope around him and schleps him along (lest be stuck waiting for his slow-ass). Revenants--come to find out--like throwing rocks and hitting things... who knew :shrug:\n---\n\n![thumb](assets/images/frost_spire.png)**I PUNCH IT!**\n\nWhile ascending the Frost Spire, the crew come upon a ~roadblock~ knight in non-shining armor. As Wrath would tell you, returning from the dead is easy compared to climbing an ice tower in full plate. But the crew ties a rope around him and schleps him along (lest be stuck waiting for his slow-ass). Revenants--come to find out--like throwing rocks and punching things... who knew :shrug:\n\n**The Frost Spire**\n\nLong ago, when the world was new an elf king was banished and tossed into the sea. His hatred was so great, and so cold, that it froze the water into a spire of ice and he was cursed to drift forever, bringing winter to the world.\n\n_But sometimes, he hungers for the blood of bad children..._\n\n[The Frost Spire](https://swordfishislands.itch.io/the-frost-spire) by Jacob Hurst\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [1420](https://casadeocio.itch.io/1420-bnb) ruleset.\n\n<break>\n\n### Cast\n- **Cool Shade Beneath Midday Sun (Shade)** - Stealthy, Expert Survivalist, Perceptive\n- **The Fox** - Deadly, Stealthy, Perceptive, Allusive\n- **The Fighter** - Tough, Deadly, Fighter\n- **Checkers Obmih** - Healer, Tough, Fighter, Strong\n- **Wrath** - Deadly, Penitent, Strong, Fighter\n- **Brine** - your _friendly_ Game Maestro\n\n<audio controls src=\"https://archive.org/download/the_frost_spire-part3/the_frost_spire-part3.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/frost_spire.png\" alt=\"thumb\" /><strong>I PUNCH IT!</strong></p>\n<p>While ascending the Frost Spire, the crew come upon a ~roadblock~ knight in non-shining armor. As Wrath would tell you, returning from the dead is easy compared to climbing an ice tower in full plate. But the crew ties a rope around him and schleps him along (lest be stuck waiting for his slow-ass). Revenants--come to find out--like throwing rocks and punching things… who knew :shrug:</p>\n<p><strong>The Frost Spire</strong></p>\n<p>Long ago, when the world was new an elf king was banished and tossed into the sea. His hatred was so great, and so cold, that it froze the water into a spire of ice and he was cursed to drift forever, bringing winter to the world.</p>\n<p><em>But sometimes, he hungers for the blood of bad children…</em></p>\n<p><a href=\"https://swordfishislands.itch.io/the-frost-spire\">The Frost Spire</a> by Jacob Hurst</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"https://casadeocio.itch.io/1420-bnb\">1420</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Cool Shade Beneath Midday Sun (Shade)</strong> - Stealthy, Expert Survivalist, Perceptive</li>\n<li><strong>The Fox</strong> - Deadly, Stealthy, Perceptive, Allusive</li>\n<li><strong>The Fighter</strong> - Tough, Deadly, Fighter</li>\n<li><strong>Checkers Obmih</strong> - Healer, Tough, Fighter, Strong</li>\n<li><strong>Wrath</strong> - Deadly, Penitent, Strong, Fighter</li>\n<li><strong>Brine</strong> - your <em>friendly</em> Game Maestro</li>\n</ul>\n<audio controls src=\"https://archive.org/download/the_frost_spire-part3/the_frost_spire-part3.mp3\"></audio>"
  },
  {
    "meta": {
      "title": "The Frost Spire - Part 4",
      "date": "2022-6-9",
      "image": "https://brine.dev/assets/images/frost_spire.png",
      "tags": "podcast, oneshot, 1420",
      "description": "It's PCs vs Polar Bear... my money is on the _bed_. Don't lose your hand!",
      "slug": "the_frost_spire-part4"
    },
    "markdown": "---\ntitle: The Frost Spire - Part 4\ndate: 2022-6-9\nimage: https://brine.dev/assets/images/frost_spire.png\ntags: podcast, oneshot, 1420\ndescription: It's PCs vs Polar Bear... my money is on the _bed_. Don't lose your hand!\n---\n\n![thumb](assets/images/frost_spire.png)**I PUNCH IT!**\n\nIt's PCs vs Polar Bear... my money is on the _bed_. Don't lose your hand!\n\n**The Frost Spire**\n\nLong ago, when the world was new an elf king was banished and tossed into the sea. His hatred was so great, and so cold, that it froze the water into a spire of ice and he was cursed to drift forever, bringing winter to the world.\n\n_But sometimes, he hungers for the blood of bad children..._\n\n[The Frost Spire](https://swordfishislands.itch.io/the-frost-spire) by Jacob Hurst\n\n**World of Brine** is an _actual play_, rpg, podcast, using the [1420](https://casadeocio.itch.io/1420-bnb) ruleset.\n\n<break>\n\n### Cast\n- **Cool Shade Beneath Midday Sun (Shade)** - Stealthy, Expert Survivalist, Perceptive\n- **The Fighter** - Tough, Deadly, Fighter\n- **Checkers Obmih** - Healer, Tough, Fighter, Strong\n- **Wrath** - Deadly, Penitent, Strong, Fighter\n- **Brine** - your _friendly_ Game Maestro\n\n<audio controls src=\"https://archive.org/download/the_frost_spire-part3/the_frost_spire-part4.mp3\"></audio>\n",
    "html": "<p><img src=\"assets/images/frost_spire.png\" alt=\"thumb\" /><strong>I PUNCH IT!</strong></p>\n<p>It's PCs vs Polar Bear… my money is on the <em>bed</em>. Don't lose your hand!</p>\n<p><strong>The Frost Spire</strong></p>\n<p>Long ago, when the world was new an elf king was banished and tossed into the sea. His hatred was so great, and so cold, that it froze the water into a spire of ice and he was cursed to drift forever, bringing winter to the world.</p>\n<p><em>But sometimes, he hungers for the blood of bad children…</em></p>\n<p><a href=\"https://swordfishislands.itch.io/the-frost-spire\">The Frost Spire</a> by Jacob Hurst</p>\n<p><strong>World of Brine</strong> is an <em>actual play</em>, rpg, podcast, using the <a href=\"https://casadeocio.itch.io/1420-bnb\">1420</a> ruleset.</p>\n<p><break></p>\n<h3 id=\"cast\">Cast</h3>\n<ul>\n<li><strong>Cool Shade Beneath Midday Sun (Shade)</strong> - Stealthy, Expert Survivalist, Perceptive</li>\n<li><strong>The Fighter</strong> - Tough, Deadly, Fighter</li>\n<li><strong>Checkers Obmih</strong> - Healer, Tough, Fighter, Strong</li>\n<li><strong>Wrath</strong> - Deadly, Penitent, Strong, Fighter</li>\n<li><strong>Brine</strong> - your <em>friendly</em> Game Maestro</li>\n</ul>\n<audio controls src=\"https://archive.org/download/the_frost_spire-part3/the_frost_spire-part4.mp3\"></audio>"
  }
]