[
  {
    "meta": {
      "title": "2023 - A Gaming Year in Review",
      "date": "2024-1-5",
      "tags": "words",
      "slug": "2023_a_gaming_year_in_review"
    },
    "markdown": "---\ntitle: 2023 - A Gaming Year in Review\ndate: 2024-1-5\ndescription:\ntags: words\n---\n\nWith 2023 in the rear-view, I began to reflect on the year from a gaming perspective. It turns out there are a number of things worthy of a shout-out!\n\n### 1. Playing Games\n\nI am a forever GM. I have run way more games than I've played. In 2023 that changed and I found myself playing a LOT more. It really opened my mind to various games and play-styles, and helped hone what I want in a game. This was definitely the biggest revelation and the reason for the rest of the list. If I was going to list a new year's resolution, it would have to be to just play more games. Here's hoping!\n\n### 2. New Games\n\nThe ~~game~~ toolset of the year for me was [Named](https://wightbred.itch.io/named-toolkit). I'm a big fan of playing into a character and thus, I gravitate towards tag-based character builds. Named uses epithets called--strangely enough--`Names`. While similar to tags, for my money, they add more juice. I see them as things people call your character... or whisper behind their back. This is a small but important distinction; YMMV.\n\nMore interesting still is how Named handles advancement through `Reflections`. At the end of a session, the table talks about what each character did in the game. Did they earn a new Name? Did a name not fit or need changing? It's easily the best advancement system I've ever seen... and now it's mine; MINE! :D\n\nI was fortunate to get the full hat-trick with Named. I played it, [podcasted it](https://playworldspodcast.com/#tags?t=skypirates-of-jotnaar) and contributed to a setting for it: [Skypirates of Jotnaar](https://wightbred.itch.io/skypirates-of-jotnaar) (that is REALLY cool if I do say so myself).\n\nHonorable mention for Dr. Paul's [Palaeolithic Voyages](https://www.lulu.com/shop/paul-jennings-and-kitty-hiraeth/palaeolithic-voyages/paperback/product-kpmy8y.html). You can keep your +1 swords; just gimme a good rock and some flint! I really wanna play more of this system.\n\n### 3. New Genre\n\nI played my first game of Delta Green. For whatever reason, I'm not drawn to Cthulhu games but I  dig Delta Green. It comes down to the twist: characters are not trying to solve a mystery; they are trying to stop/contain/suppress/clean up a problem. More MIB or X-Files than straight Lovecraftian cosmic horror. Really fun game.\n\nI look forward to reflecting on 2024!",
    "html": "<p>With 2023 in the rear-view, I began to reflect on the year from a gaming perspective. It turns out there are a number of things worthy of a shout-out!</p>\n<h3 id=\"1playinggames\">1. Playing Games</h3>\n<p>I am a forever GM. I have run way more games than I've played. In 2023 that changed and I found myself playing a LOT more. It really opened my mind to various games and play-styles, and helped hone what I want in a game. This was definitely the biggest revelation and the reason for the rest of the list. If I was going to list a new year's resolution, it would have to be to just play more games. Here's hoping!</p>\n<h3 id=\"2newgames\">2. New Games</h3>\n<p>The <del>game</del> toolset of the year for me was <a href=\"https://wightbred.itch.io/named-toolkit\">Named</a>. I'm a big fan of playing into a character and thus, I gravitate towards tag-based character builds. Named uses epithets called--strangely enough--<code>Names</code>. While similar to tags, for my money, they add more juice. I see them as things people call your character… or whisper behind their back. This is a small but important distinction; YMMV.</p>\n<p>More interesting still is how Named handles advancement through <code>Reflections</code>. At the end of a session, the table talks about what each character did in the game. Did they earn a new Name? Did a name not fit or need changing? It's easily the best advancement system I've ever seen… and now it's mine; MINE! :D</p>\n<p>I was fortunate to get the full hat-trick with Named. I played it, <a href=\"https://playworldspodcast.com/#tags?t=skypirates-of-jotnaar\">podcasted it</a> and contributed to a setting for it: <a href=\"https://wightbred.itch.io/skypirates-of-jotnaar\">Skypirates of Jotnaar</a> (that is REALLY cool if I do say so myself).</p>\n<p>Honorable mention for Dr. Paul's <a href=\"https://www.lulu.com/shop/paul-jennings-and-kitty-hiraeth/palaeolithic-voyages/paperback/product-kpmy8y.html\">Palaeolithic Voyages</a>. You can keep your +1 swords; just gimme a good rock and some flint! I really wanna play more of this system.</p>\n<h3 id=\"3newgenre\">3. New Genre</h3>\n<p>I played my first game of Delta Green. For whatever reason, I'm not drawn to Cthulhu games but I  dig Delta Green. It comes down to the twist: characters are not trying to solve a mystery; they are trying to stop/contain/suppress/clean up a problem. More MIB or X-Files than straight Lovecraftian cosmic horror. Really fun game.</p>\n<p>I look forward to reflecting on 2024!</p>"
  },
  {
    "meta": {
      "title": "A Confession",
      "date": "2099-3-23",
      "tags": "magic, oyab",
      "slug": "_a_confession"
    },
    "markdown": "---\ntitle: A Confession\ndate: 2099-3-23\ntags: magic, oyab\ndescription:\n---\n\nAuthor: Brother Malachi\n\nHere in the dar\n\n\n\nIn the hallowed halls of the temple, where the flickering candlelight casts shadows upon ancient tomes and sacred relics, I, Brother Rhys, a humble servant of the divine, find myself reflecting upon the mystical arts that permeate our world. As a young priest, entrusted with the spiritual guidance of my congregation, I have long pondered the nature of magic and its practitioners—magi and witches alike—and how their abilities compare to my own.\n\nFirst, let us consider the magi, wielders of arcane knowledge and masters of manipulation. With their spells and enchantments, they command the elements themselves, bending reality to their will with a mere flick of the wrist. Theirs is a power born of intellect and study, honed through years of rigorous training and discipline. From the conjuring of fire to the summoning of storms, the magi's repertoire knows no bounds, limited only by the depths of their imagination and the constraints of the natural world.\n\nAnd then there are the witches, beings of ethereal grace and enigmatic allure, whose magic flows from the very essence of their being. Born of the union between fae and human, they possess a deep connection to the natural world, communing with spirits and channeling energies beyond mortal comprehension. With their spells of healing and transformation, they weave enchantments that blur the boundaries between the mundane and the mystical, weaving threads of magic into the tapestry of existence itself.\n\nIn comparison, the abilities of a priest may seem humble by comparison, yet they are no less profound in their impact upon the world. Our magic, if it can be called such, is rooted not in arcane formulas or innate talent, but in faith and devotion to a higher power. Through prayer and ritual, we invoke divine blessings and guidance, offering solace to the afflicted and strength to the weary. Our spells are not cast with incantations or gestures, but with words of comfort and acts of compassion, imbued with the light of divine grace.\n\nIndeed, while the magi may wield fire and lightning, and the witches may shape-shift and commune with nature, the power of a priest lies in the ability to inspire hope, foster healing, and bring comfort to those in need. It is a power born not of earthly knowledge or fae ancestry, but of a profound belief in the inherent goodness of humanity and the guiding hand of the divine.\n\nAs I gaze out upon the world, with its wonders and its mysteries, I am reminded that each path to magic is unique, and that true power lies not in the spells we cast or the abilities we possess, but in the kindness and compassion we show to others. And so, as a young priest, I pledge to continue my journey with faith and humility, seeking to embody the virtues of love and service that lie at the heart of my calling.",
    "html": "<p>Author: Brother Malachi</p>\n<p>Here in the dar</p>\n<p>In the hallowed halls of the temple, where the flickering candlelight casts shadows upon ancient tomes and sacred relics, I, Brother Rhys, a humble servant of the divine, find myself reflecting upon the mystical arts that permeate our world. As a young priest, entrusted with the spiritual guidance of my congregation, I have long pondered the nature of magic and its practitioners—magi and witches alike—and how their abilities compare to my own.</p>\n<p>First, let us consider the magi, wielders of arcane knowledge and masters of manipulation. With their spells and enchantments, they command the elements themselves, bending reality to their will with a mere flick of the wrist. Theirs is a power born of intellect and study, honed through years of rigorous training and discipline. From the conjuring of fire to the summoning of storms, the magi's repertoire knows no bounds, limited only by the depths of their imagination and the constraints of the natural world.</p>\n<p>And then there are the witches, beings of ethereal grace and enigmatic allure, whose magic flows from the very essence of their being. Born of the union between fae and human, they possess a deep connection to the natural world, communing with spirits and channeling energies beyond mortal comprehension. With their spells of healing and transformation, they weave enchantments that blur the boundaries between the mundane and the mystical, weaving threads of magic into the tapestry of existence itself.</p>\n<p>In comparison, the abilities of a priest may seem humble by comparison, yet they are no less profound in their impact upon the world. Our magic, if it can be called such, is rooted not in arcane formulas or innate talent, but in faith and devotion to a higher power. Through prayer and ritual, we invoke divine blessings and guidance, offering solace to the afflicted and strength to the weary. Our spells are not cast with incantations or gestures, but with words of comfort and acts of compassion, imbued with the light of divine grace.</p>\n<p>Indeed, while the magi may wield fire and lightning, and the witches may shape-shift and commune with nature, the power of a priest lies in the ability to inspire hope, foster healing, and bring comfort to those in need. It is a power born not of earthly knowledge or fae ancestry, but of a profound belief in the inherent goodness of humanity and the guiding hand of the divine.</p>\n<p>As I gaze out upon the world, with its wonders and its mysteries, I am reminded that each path to magic is unique, and that true power lies not in the spells we cast or the abilities we possess, but in the kindness and compassion we show to others. And so, as a young priest, I pledge to continue my journey with faith and humility, seeking to embody the virtues of love and service that lie at the heart of my calling.</p>"
  },
  {
    "meta": {
      "title": "Glimmerwood Forest",
      "date": "2099-3-23",
      "tags": "snippet, grain",
      "slug": "_glimmerwood_forest"
    },
    "markdown": "---\ntitle: Glimmerwood Forest\ndate: 2099-3-23\ndescription:\ntags: snippet, grain\n---\n\n![round](assets/images/whipping_tree.webp)\n\n_v1.0_\n\n- prison of dangerous books\n- cult is praying for weather change but god is not listening... PRAY HARDER\n- the druid is sleeping in the grove somewhere/how\n\n\n\n[![thumb](assets/images/glimmerwood_forest_map.webp)](assets/images/glimmerwood_forest_map.webp)\nGlimmerwood Forest is a popular shortcut for those without fear of the forest. It can halve travel time between Emberford (`0709`) and the northern villages. The increase in traffic has also increased the population.\n\nBut thunderstorms ravage Glimmerwood Forest. These storms target only the forest, leaving the surrounding areas dry and peaceful. Paths made treacherous by the rains impede travel and hunting. Those who try report seeing ghastly apparitions.\n\nIn the heart of the forest, words cut into an ancient, gnarled tree; a spell. Is this the reason for the storms or solution to them?\n\n\n### RUMORS\n\n1. **The Whipping Tree** (`0502`) carries the blood of those punished upon it. It whispers when the storms rage; casting the spell cut into it.\n1. That witch and her filthy coven are behind these storms.\n1. **The Green Lady** is a beautiful, green temptress. She stalks the forest, \"calling\" to the hunters.\n1. Cloaked figures perform rituals in the **Lost Druid's Grove** (`0902`); deep within Glimmerwood. The grove was once home to a powerful druid who vanished centuries ago.\n1. Paths in Glimmerwood are said to shift and change directions, leading wanderers into the heart of the forest.\n1. **The Ghost Herd** is a spectral herd of elk that roams Glimmerwood.\n\n\n### ENCOUNTERS\n\n1. A mudslide threatens to envelope the PCs\n1. The Ghost Herd threatens to trample the PCs\n1. A distressed hunter stuck in quicksand\n1. Unearthed graves; disturbed by the rains\n1. Apparitions haunt the PCs until their graves are restored\n1. The Green Lady calls to the PCs\n\n\n### NOTABLES\n\n**George & Astrid Duskwood** `Innkeepers, Silversmith, Ambitious` - George is a retired silversmith. His new bride Astrid and her son are building the first inn in the area; the first permanent structure of any kind(`0608`). They are hoping to establish a village here. The rains are delaying most of their shipments.\n\n**Ceridwen** `Cartographer, Woodworker, Big Thinker` - She carefully maps the forest, intending to sell them to a logging enterprise in Emberford. While she waits out the storms in her tent, she carves intricate wooden figures. She's currently working a piece she took from the Whipping Tree.\n\n**Rowan Bramblethorn** `Hunter, Worthy, Determined` - He lives in the forest and will be helpful to those who show respect. He is close with Nyx, or at least thinks so.\n\n**Kelsia** `Trapper, Mentor, Materialistic` - She is only a threat to forest furbearers, and takes great pride in _the artistry_ of trapping. She travels with her nephew, Orion, teaching him the trade. She is careful to leave \"offerings\" outside Witch Ailmar's desolate brugh.\n\n**The Witch Ailmar** `Witch, Herbalist, Untrustworthy` - Despite her dubious practices, Ailmar is an unparalleled herbalist. Many seek her remedies and potions, but are quick to blame her for the unwelcome truths they uncover. She sees the forest as an exploitable resource and enjoys its solitude.\n\n**Nyx** `The Green Lady, Dryad, Guardian` - She knows the coming of men is inevitable but resits their impact on the forest as best she can. While Nyx did not create the tree's spell, she knows it as a spell to \"Wash Away Sins\". She believes it maintains balance in the forest and will not interfere with it in any way.\n\n\n### LOCATIONS\n\n**Glimmerwood Forest:** A dense and ancient woodland, shrouded in mist. Towering trees with twisted branches create a canopy, casting ethereal shadows on the lush forest floor. The air crackles with a mysterious energy, and the occasional flash of magical storms illuminates the surroundings.\n\n**The Whipping Tree (`0502`):** A gnarled and imposing tree with dark bark, standing alone in a small clearing. Faint echoes of past punishments linger in the air, and the tree seems to whisper when the storms rage, hinting at a dark and forbidden history.\n\n**Lost Druid's Grove (`0902`):** A hidden grove deep within Glimmerwood, filled with ancient stone circles and remnants of long-forgotten rituals. Cloaked figures perform mysterious ceremonies, their actions obscured by the shadows of the ancient trees.\n\n**Inn of George & Astrid Duskwood (`0608`):** A modest yet welcoming inn under construction at the edge of the forest. The sound of hammers and saws echoes as George and Astrid Duskwood strive to establish the first building in the area. The rains delay shipments, leaving the inn in partial completion.\n\n**The Green Lady's Domain:** A secluded part of the forest where vibrant greenery flourishes. Nyx, the Dryad known as The Green Lady, resides here. The air is filled with the sweet scent of blossoms, and the energy feels both calming and protective. She can control the Ghost Herd\n\n**Witch Ailmar's Desolate Brugh:** A mysterious and somewhat eerie dwelling nestled in the heart of Glimmerwood. The witch, Ailmar, resides here. The surroundings are adorned with various herbs and potions, and an air of untrustworthiness permeates the atmosphere.\n\n\n_map by [Watabou](https://watabou.github.io/perilous-shores/?seed=945645879&tags=perilous,woodland,difficult,coast,chaotic,highland&w=1300&h=1300&hexes=2)_",
    "html": "<p><img src=\"assets/images/whipping_tree.webp\" alt=\"round\" /></p>\n<p><em>v1.0</em></p>\n<ul>\n<li>prison of dangerous books</li>\n<li>cult is praying for weather change but god is not listening… PRAY HARDER</li>\n<li>the druid is sleeping in the grove somewhere/how</li>\n</ul>\n<p><a href=\"assets/images/glimmerwood_forest_map.webp\"><img src=\"assets/images/glimmerwood_forest_map.webp\" alt=\"thumb\" /></a>\nGlimmerwood Forest is a popular shortcut for those without fear of the forest. It can halve travel time between Emberford (<code>0709</code>) and the northern villages. The increase in traffic has also increased the population.</p>\n<p>But thunderstorms ravage Glimmerwood Forest. These storms target only the forest, leaving the surrounding areas dry and peaceful. Paths made treacherous by the rains impede travel and hunting. Those who try report seeing ghastly apparitions.</p>\n<p>In the heart of the forest, words cut into an ancient, gnarled tree; a spell. Is this the reason for the storms or solution to them?</p>\n<h3 id=\"rumors\">RUMORS</h3>\n<ol>\n<li><strong>The Whipping Tree</strong> (<code>0502</code>) carries the blood of those punished upon it. It whispers when the storms rage; casting the spell cut into it.</li>\n<li>That witch and her filthy coven are behind these storms.</li>\n<li><strong>The Green Lady</strong> is a beautiful, green temptress. She stalks the forest, \"calling\" to the hunters.</li>\n<li>Cloaked figures perform rituals in the <strong>Lost Druid's Grove</strong> (<code>0902</code>); deep within Glimmerwood. The grove was once home to a powerful druid who vanished centuries ago.</li>\n<li>Paths in Glimmerwood are said to shift and change directions, leading wanderers into the heart of the forest.</li>\n<li><strong>The Ghost Herd</strong> is a spectral herd of elk that roams Glimmerwood.</li>\n</ol>\n<h3 id=\"encounters\">ENCOUNTERS</h3>\n<ol>\n<li>A mudslide threatens to envelope the PCs</li>\n<li>The Ghost Herd threatens to trample the PCs</li>\n<li>A distressed hunter stuck in quicksand</li>\n<li>Unearthed graves; disturbed by the rains</li>\n<li>Apparitions haunt the PCs until their graves are restored</li>\n<li>The Green Lady calls to the PCs</li>\n</ol>\n<h3 id=\"notables\">NOTABLES</h3>\n<p><strong>George & Astrid Duskwood</strong> <code>Innkeepers, Silversmith, Ambitious</code> - George is a retired silversmith. His new bride Astrid and her son are building the first inn in the area; the first permanent structure of any kind(<code>0608</code>). They are hoping to establish a village here. The rains are delaying most of their shipments.</p>\n<p><strong>Ceridwen</strong> <code>Cartographer, Woodworker, Big Thinker</code> - She carefully maps the forest, intending to sell them to a logging enterprise in Emberford. While she waits out the storms in her tent, she carves intricate wooden figures. She's currently working a piece she took from the Whipping Tree.</p>\n<p><strong>Rowan Bramblethorn</strong> <code>Hunter, Worthy, Determined</code> - He lives in the forest and will be helpful to those who show respect. He is close with Nyx, or at least thinks so.</p>\n<p><strong>Kelsia</strong> <code>Trapper, Mentor, Materialistic</code> - She is only a threat to forest furbearers, and takes great pride in <em>the artistry</em> of trapping. She travels with her nephew, Orion, teaching him the trade. She is careful to leave \"offerings\" outside Witch Ailmar's desolate brugh.</p>\n<p><strong>The Witch Ailmar</strong> <code>Witch, Herbalist, Untrustworthy</code> - Despite her dubious practices, Ailmar is an unparalleled herbalist. Many seek her remedies and potions, but are quick to blame her for the unwelcome truths they uncover. She sees the forest as an exploitable resource and enjoys its solitude.</p>\n<p><strong>Nyx</strong> <code>The Green Lady, Dryad, Guardian</code> - She knows the coming of men is inevitable but resits their impact on the forest as best she can. While Nyx did not create the tree's spell, she knows it as a spell to \"Wash Away Sins\". She believes it maintains balance in the forest and will not interfere with it in any way.</p>\n<h3 id=\"locations\">LOCATIONS</h3>\n<p><strong>Glimmerwood Forest:</strong> A dense and ancient woodland, shrouded in mist. Towering trees with twisted branches create a canopy, casting ethereal shadows on the lush forest floor. The air crackles with a mysterious energy, and the occasional flash of magical storms illuminates the surroundings.</p>\n<p><strong>The Whipping Tree (<code>0502</code>):</strong> A gnarled and imposing tree with dark bark, standing alone in a small clearing. Faint echoes of past punishments linger in the air, and the tree seems to whisper when the storms rage, hinting at a dark and forbidden history.</p>\n<p><strong>Lost Druid's Grove (<code>0902</code>):</strong> A hidden grove deep within Glimmerwood, filled with ancient stone circles and remnants of long-forgotten rituals. Cloaked figures perform mysterious ceremonies, their actions obscured by the shadows of the ancient trees.</p>\n<p><strong>Inn of George & Astrid Duskwood (<code>0608</code>):</strong> A modest yet welcoming inn under construction at the edge of the forest. The sound of hammers and saws echoes as George and Astrid Duskwood strive to establish the first building in the area. The rains delay shipments, leaving the inn in partial completion.</p>\n<p><strong>The Green Lady's Domain:</strong> A secluded part of the forest where vibrant greenery flourishes. Nyx, the Dryad known as The Green Lady, resides here. The air is filled with the sweet scent of blossoms, and the energy feels both calming and protective. She can control the Ghost Herd</p>\n<p><strong>Witch Ailmar's Desolate Brugh:</strong> A mysterious and somewhat eerie dwelling nestled in the heart of Glimmerwood. The witch, Ailmar, resides here. The surroundings are adorned with various herbs and potions, and an air of untrustworthiness permeates the atmosphere.</p>\n<p><em>map by <a href=\"https://watabou.github.io/perilous-shores/?seed=945645879&tags=perilous,woodland,difficult,coast,chaotic,highland&w=1300&h=1300&hexes=2\">Watabou</a></em></p>"
  },
  {
    "meta": {
      "title": "To The Northern Kings",
      "date": "2099-4-2",
      "tags": "magic, oyab",
      "slug": "_missive"
    },
    "markdown": "---\ntitle: To The Northern Kings\ndate: 2099-4-2\ntags: magic, oyab\ndescription:\n---\n\nMissive to the Northern Kings,\n\nThe cycle turns again, and still this dread mist hangs like a shroud upon the Sorrow Mountains, befitting the grim task you've charged me with overseeing. Rest assured, my wardens remain vigilant against the most vile and unrepentant souls incarcerated within these walls.\n\nThough the ethereal wards of Yagul Fane's magi hold firm, I grow concerned over the depraved utterings of that wretched hag Kalg. I've requested her confinement be... refortified until her madness passes.\n\nAs for the druid filth sequestered in their grove, they remain placid for now - no doubt consumed with plotting their inevitable betrayal as is their wicked nature. You were wise to rip these lands from their greedy grasps and let justice be delivered upon those who dared raise arms against your rightful rule. I'll not allow this lingering root near our Prison to take insidious hold again.\n\nOur supplies hold sufficient for the moment, though increased rations would be welcomed to fortify my wardens against the hardships of their posts in this dismal place. Eternal gloom makes a hell of even simple tasks.\n\nI vow to honor the principles of order, statute and fealty instilled by your virtuous guidance. No matter the depths we must plumb, your law shall be upheld here.\n\nYour Obedient Servant,\nWarden Thorvald Cloudcroft\nPrison of Mon",
    "html": "<p>Missive to the Northern Kings,</p>\n<p>The cycle turns again, and still this dread mist hangs like a shroud upon the Sorrow Mountains, befitting the grim task you've charged me with overseeing. Rest assured, my wardens remain vigilant against the most vile and unrepentant souls incarcerated within these walls.</p>\n<p>Though the ethereal wards of Yagul Fane's magi hold firm, I grow concerned over the depraved utterings of that wretched hag Kalg. I've requested her confinement be… refortified until her madness passes.</p>\n<p>As for the druid filth sequestered in their grove, they remain placid for now - no doubt consumed with plotting their inevitable betrayal as is their wicked nature. You were wise to rip these lands from their greedy grasps and let justice be delivered upon those who dared raise arms against your rightful rule. I'll not allow this lingering root near our Prison to take insidious hold again.</p>\n<p>Our supplies hold sufficient for the moment, though increased rations would be welcomed to fortify my wardens against the hardships of their posts in this dismal place. Eternal gloom makes a hell of even simple tasks.</p>\n<p>I vow to honor the principles of order, statute and fealty instilled by your virtuous guidance. No matter the depths we must plumb, your law shall be upheld here.</p>\n<p>Your Obedient Servant,\nWarden Thorvald Cloudcroft\nPrison of Mon</p>"
  },
  {
    "meta": {
      "title": "A Necromancer",
      "date": "2099-3-23",
      "tags": "words",
      "slug": "_necromancer"
    },
    "markdown": "---\ntitle: A Necromancer\ndate: 2099-3-23\ndescription:\ntags: words\n---\n\n ## Nekros Manteia\n\nLike most Necromancers, Indis Fane came to the craft by happenstance. Or at least, she imagines this to be the case. Her teacher did hint that he too fell upon the path; changing the subject to all follow up questions. Practitioners, understandably, are not chatty folk. They tend to mimic their subjects in this way. Might she be the last? Her heart is neither coal nor gold. She deals in death because it is within her power. Like any gifted person might, she takes pride in perfecting her skill. She catches herself adding flourishes in her movements; theatrics without audience. _Why do I do that?_\n\nIndis hales from Duskby. She is the reason for the poor harvest. She required the life force of a copse of white oak... she underestimated the reach of their taproots; the resulting blight was unintended.\n\nAn aging wealthy merchant hired Indis to extend his life. Not understanding the dangers that messing with the balance of nature, she thought the trees wouldn't be missed. The blight brought a poor harvest and Duskby is hungry. The people are keen to blame and Indis is definitely on the list. It also called the attention of a dryad who looks for retribution. Meanwhile, the merchant is making shittons of money but importing foods.\n\n\n## TABLES (scenes)\n\n**The Hungry Mob**\n- fear/mistrust Indis and will eventually turn on her\n- envy and greed will lobby against the merchant and eventually take his shit and kill him\n- will burn the forest to kill the dryad\n- the dryad will curse Indis and/or the town (ie. FUCKING HUMANS)\n\n\n- skeletons (raised by Indis for protection)\n- zombies",
    "html": "<p>## Nekros Manteia</p>\n<p>Like most Necromancers, Indis Fane came to the craft by happenstance. Or at least, she imagines this to be the case. Her teacher did hint that he too fell upon the path; changing the subject to all follow up questions. Practitioners, understandably, are not chatty folk. They tend to mimic their subjects in this way. Might she be the last? Her heart is neither coal nor gold. She deals in death because it is within her power. Like any gifted person might, she takes pride in perfecting her skill. She catches herself adding flourishes in her movements; theatrics without audience. <em>Why do I do that?</em></p>\n<p>Indis hales from Duskby. She is the reason for the poor harvest. She required the life force of a copse of white oak… she underestimated the reach of their taproots; the resulting blight was unintended.</p>\n<p>An aging wealthy merchant hired Indis to extend his life. Not understanding the dangers that messing with the balance of nature, she thought the trees wouldn't be missed. The blight brought a poor harvest and Duskby is hungry. The people are keen to blame and Indis is definitely on the list. It also called the attention of a dryad who looks for retribution. Meanwhile, the merchant is making shittons of money but importing foods.</p>\n<h2 id=\"tablesscenes\">TABLES (scenes)</h2>\n<p><strong>The Hungry Mob</strong></p>\n<ul>\n<li><p>fear/mistrust Indis and will eventually turn on her</p></li>\n<li><p>envy and greed will lobby against the merchant and eventually take his shit and kill him</p></li>\n<li><p>will burn the forest to kill the dryad</p></li>\n<li><p>the dryad will curse Indis and/or the town (ie. FUCKING HUMANS)</p></li>\n<li><p>skeletons (raised by Indis for protection)</p></li>\n<li><p>zombies</p></li>\n</ul>"
  },
  {
    "meta": {
      "title": "A Magic System",
      "date": "2021-5-2",
      "description": "A simple magic system for any game... but intended as an alternative to the system in World of Dungeons.",
      "tags": "magic, rules, wodu",
      "slug": "a_magic_system"
    },
    "markdown": "---\ntitle: A Magic System\ndate: 2021-5-2\ndescription: A simple magic system for any game... but intended as an alternative to the system in World of Dungeons.\ntags: magic, rules, wodu\n---\n\n_v 1.6_\n\n> The door to magic is closed for most; some few may find it ajar; _fewer still_ may pick the door's lock altogether. Aptitude for the craft is is not unusual but is often misinterpreted. Great magic requires _constant practice_. The best magi are not always the most gifted; just _persistent_.\n\n> **Magic is dangerous**; spells go poorly and the consequences can be... severe.\n\n<break>\n\n### Mechanics\n\n**You can master spells equal to your level + 2** (eg. 1st level magi have mastered 3 spells).\n\nCasting spells takes a physical toll. **You can safely cast spells equal to your `hd + con`** (ie. _spell slots_). Above that, you take `1d6+lvl` damage for each spell cast. Safe casting is restored after resting in _comfort and safety_.\n\n**Mages add `int` to their casting rolls; clerics add `wis`** (eg. `2d6+int/wis`) and your `level` to damage rolls (eg. `2d6+lvl`). You gain an extra `d6` of damage at levels 5 & 10.\n\nWhen you level up, you may swap mastered spells for new ones.\n\n\n### Scrolls\n\n**You may attempt to cast spells from written texts**. This requires more casting time while you read/review the spell (ie. _a turn_) and expends a _spell slot_.\n\nIt is wise to identify a spell before casting it!\n\n\n### Enhancements\n\n[_Enhancement_ spells](https://brine.dev/#spellTags?t=enhancement) are cast in conjunction with a target spell. They augment spell casting and/or effect, and expend a _spell slot_ in addition to the target spell.\n\n### Mishaps\n\n**Magic is dangerous**. A failed casting roll may have consequences; a critical fail always will.\n\nAn example mishap table:\n\n  1. the target reflects the spell back at caster\n  1. 1d6 damage to the caster\n  3. the caster is blinded/frozen/afraid/etc... for a short time\n  4. the spell affects the party in some way (depending on the spell)\n  5. the caster turns blue\n  6. nothing happens... _lucky_\n\n\n### Addendum\n\nPresented as an alternate/additional magic system for [World of Dungeons](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf).\n\nI have a [growing list of spells](/#spells) and/or allow players to create their own.",
    "html": "<p><em>v 1.6</em></p>\n<blockquote>\n  <p>The door to magic is closed for most; some few may find it ajar; <em>fewer still</em> may pick the door's lock altogether. Aptitude for the craft is is not unusual but is often misinterpreted. Great magic requires <em>constant practice</em>. The best magi are not always the most gifted; just <em>persistent</em>.</p>\n  <p><strong>Magic is dangerous</strong>; spells go poorly and the consequences can be… severe.</p>\n</blockquote>\n<p><break></p>\n<h3 id=\"mechanics\">Mechanics</h3>\n<p><strong>You can master spells equal to your level + 2</strong> (eg. 1st level magi have mastered 3 spells).</p>\n<p>Casting spells takes a physical toll. <strong>You can safely cast spells equal to your <code>hd + con</code></strong> (ie. <em>spell slots</em>). Above that, you take <code>1d6+lvl</code> damage for each spell cast. Safe casting is restored after resting in <em>comfort and safety</em>.</p>\n<p><strong>Mages add <code>int</code> to their casting rolls; clerics add <code>wis</code></strong> (eg. <code>2d6+int/wis</code>) and your <code>level</code> to damage rolls (eg. <code>2d6+lvl</code>). You gain an extra <code>d6</code> of damage at levels 5 &amp; 10.</p>\n<p>When you level up, you may swap mastered spells for new ones.</p>\n<h3 id=\"scrolls\">Scrolls</h3>\n<p><strong>You may attempt to cast spells from written texts</strong>. This requires more casting time while you read/review the spell (ie. <em>a turn</em>) and expends a <em>spell slot</em>.</p>\n<p>It is wise to identify a spell before casting it!</p>\n<h3 id=\"enhancements\">Enhancements</h3>\n<p><a href=\"https://brine.dev/#spellTags?t=enhancement\"><em>Enhancement</em> spells</a> are cast in conjunction with a target spell. They augment spell casting and/or effect, and expend a <em>spell slot</em> in addition to the target spell.</p>\n<h3 id=\"mishaps\">Mishaps</h3>\n<p><strong>Magic is dangerous</strong>. A failed casting roll may have consequences; a critical fail always will.</p>\n<p>An example mishap table:</p>\n<ol>\n<li>the target reflects the spell back at caster</li>\n<li>1d6 damage to the caster</li>\n<li>the caster is blinded/frozen/afraid/etc… for a short time</li>\n<li>the spell affects the party in some way (depending on the spell)</li>\n<li>the caster turns blue</li>\n<li>nothing happens… <em>lucky</em></li>\n</ol>\n<h3 id=\"addendum\">Addendum</h3>\n<p>Presented as an alternate/additional magic system for <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons</a>.</p>\n<p>I have a <a href=\"/#spells\">growing list of spells</a> and/or allow players to create their own.</p>"
  },
  {
    "meta": {
      "title": "A TTRPG Manifesto",
      "date": "2023-10-1",
      "description": "A TTRPG Manifesto",
      "tags": "words",
      "slug": "a_ttrpg_manifesto"
    },
    "markdown": "---\ntitle: A TTRPG Manifesto\ndate: 2023-10-1\ndescription: A TTRPG Manifesto\ntags: words\n---\n\nWe are exploring different approaches to TTRPGs. Through play we have come to value:\n\n- A shared understanding of a world over rules\n- Table trust over systems\n- Immersion over character sheets\n- Conversation and negotiation over procedures\n\nThat is, while there is value in the elements on the right, we value the elements on the left more.\n",
    "html": "<p>We are exploring different approaches to TTRPGs. Through play we have come to value:</p>\n<ul>\n<li>A shared understanding of a world over rules</li>\n<li>Table trust over systems</li>\n<li>Immersion over character sheets</li>\n<li>Conversation and negotiation over procedures</li>\n</ul>\n<p>That is, while there is value in the elements on the right, we value the elements on the left more.</p>"
  },
  {
    "meta": {
      "title": "Accidental FKR",
      "date": "2022-5-12",
      "description": "FKR is gaming as the KISS theory is to everything else?",
      "tags": "acronym, rules, words",
      "slug": "accidental_fkr"
    },
    "markdown": "---\ntitle: Accidental FKR\ndate: 2022-5-12\ndescription: FKR is gaming as the KISS theory is to everything else?\ntags: acronym, rules, words\n---\n\nMy game has been unintentionally _molting_ toward **FKR**. It started before ever hearing the term. It just kinda happened and I continue to enjoy its inherent permission for further mutations.\n\nDuring a hiatus from D&D 5E, I found myself reading other game systems; exploring their rules (or lack thereof) and ideas. Honestly, I hadn't put together that I wanted to run another system. I was just being curious. Bits and pieces of various systems started to click; most notably, [Dungeon World](https://dungeon-world.com).\n\nHilariously, I've never run Dungeon World; nor do I have interest in doing so. I don't find it to be a particularly compelling game, but rather a fantastic GM reference! Just reading it changed the way I run games. It also illuminated my want of a different ruleset: something simpler; more inclusive. I didn't need to look very far (even if I did)... DW lead me right to [World of Dungeons (WoDu)](https://johnharper.itch.io/world-of-dungeons).\n\nThere are a number of things in WoDu that changed my game forever (`2d6` & `Die of Fate` come to mind) but in terms of FKR, it was _the holes_. _What do these Skills do? How do rituals work? Decipher?_ The old GM in me would have thought: _\"okay, I need to figure out all this shit before we play\"_. But thanks to my exploration of other rulesets, I was able to give myself permission to put these questions to _my group_. My players really took to this inclusive approach to rule creation. It's very likely why we've been playing for so long (going on 3 years)! Lighter rules also lead to less character sheet-gazing and more creativity. I was hooked!\n\nTwo years later, I published some of these _house rules_ as [Beasts & Barrows](https://casadeocio.itch.io/beasts-barrows). But shortly thereafter, even BnB started feeling heavy to me. So with an inspiring nudge from [2400](https://jasontocci.itch.io/2400), I took another step and revamped them into their new, unfinished form: [1420 Beasts & Barrows](https://casadeocio.itch.io/1420-bnb). The most notable differences being the lack of stats and d6 dice pool skills. This new ruleset is currently peculating with my regular crew.\n\nFor the record, I have no desire to debate what is/isn't FKR. I am not an authority; nor do I wish to be. I purposely refrained from explaining it or linking it to anything here. I prefer its definition to remain elusive and open. I find my game jives with the idea of FKR more than other rpg philosophies (for lack of a better term). YMMV.",
    "html": "<p>My game has been unintentionally <em>molting</em> toward <strong>FKR</strong>. It started before ever hearing the term. It just kinda happened and I continue to enjoy its inherent permission for further mutations.</p>\n<p>During a hiatus from D&amp;D 5E, I found myself reading other game systems; exploring their rules (or lack thereof) and ideas. Honestly, I hadn't put together that I wanted to run another system. I was just being curious. Bits and pieces of various systems started to click; most notably, <a href=\"https://dungeon-world.com\">Dungeon World</a>.</p>\n<p>Hilariously, I've never run Dungeon World; nor do I have interest in doing so. I don't find it to be a particularly compelling game, but rather a fantastic GM reference! Just reading it changed the way I run games. It also illuminated my want of a different ruleset: something simpler; more inclusive. I didn't need to look very far (even if I did)… DW lead me right to <a href=\"https://johnharper.itch.io/world-of-dungeons\">World of Dungeons (WoDu)</a>.</p>\n<p>There are a number of things in WoDu that changed my game forever (<code>2d6</code> &amp; <code>Die of Fate</code> come to mind) but in terms of FKR, it was <em>the holes</em>. <em>What do these Skills do? How do rituals work? Decipher?</em> The old GM in me would have thought: <em>\"okay, I need to figure out all this shit before we play\"</em>. But thanks to my exploration of other rulesets, I was able to give myself permission to put these questions to <em>my group</em>. My players really took to this inclusive approach to rule creation. It's very likely why we've been playing for so long (going on 3 years)! Lighter rules also lead to less character sheet-gazing and more creativity. I was hooked!</p>\n<p>Two years later, I published some of these <em>house rules</em> as <a href=\"https://casadeocio.itch.io/beasts-barrows\">Beasts & Barrows</a>. But shortly thereafter, even BnB started feeling heavy to me. So with an inspiring nudge from <a href=\"https://jasontocci.itch.io/2400\">2400</a>, I took another step and revamped them into their new, unfinished form: <a href=\"https://casadeocio.itch.io/1420-bnb\">1420 Beasts & Barrows</a>. The most notable differences being the lack of stats and d6 dice pool skills. This new ruleset is currently peculating with my regular crew.</p>\n<p>For the record, I have no desire to debate what is/isn't FKR. I am not an authority; nor do I wish to be. I purposely refrained from explaining it or linking it to anything here. I prefer its definition to remain elusive and open. I find my game jives with the idea of FKR more than other rpg philosophies (for lack of a better term). YMMV.</p>"
  },
  {
    "meta": {
      "title": "Beasts &amp; Barrows",
      "date": "2021-9-12",
      "description": "**Beasts &amp; Barrows** is an uncomplicated fantasy role-playing game (RPG) that values role-play, simplicity and flexibility.",
      "tags": "BnB, rules",
      "slug": "beasts_and_barrows"
    },
    "markdown": "---\ntitle: Beasts & Barrows\ndate: 2021-9-12\ndescription: **Beasts & Barrows** is an uncomplicated fantasy role-playing game (RPG) that values role-play, simplicity and flexibility.\ntags: BnB, rules\n---\n\nby <a href=\"https://brine.dev\">brine</a> - <version>_v 1.0_</version>\n\n**Beasts & Barrows** is an uncomplicated fantasy role-playing game (RPG) for 2-5 players + Game Maestro (GM). It steals blatantly from John Harper's [World of Dungeons](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf) and shares the same [PbtA](http://apocalypse-world.com/pbta) core mechanic (`2d6`). ~~YOU ARE FORBIDDEN TO HACK THIS!~~\n\n**Beasts & Barrows (B&B)** values:\n  - **role-play:** rules and mechanics emphasize and encourage role-play\n  - **simplicity:** less math; less rules; more fun\n  - **show, don't tell:** don't _tell_ me your alignment... _show_ me your alignment; don't _tell_ me you attack; _describe_ your attack\n  - **flexibility:** running existing adventures from _any_ system is trivial\n\n<break>\n\n<div class=\"pagebreak\"></div>\n\n### Character Creation\n\n**What kind of character sounds fun to play?** Rolling a new character takes _ones of minutes_. This question will likely take the longest to answer. Here are some classic examples but you are free to create your own:\n\n  - **Warrior:** strong and good with the stabby stab\n  - **Thief:** nimble and sneaky sneaksters\n  - **Mage:** smart and full of arcaney goodness\n  - **Priest:** wise and has a direct line to the gods\n\n> Outside of the _classic classes_, players are encouraged to create their own by making clever use of the existing `Skills and Abilities`. For example an **Alchemist** might require `Lore` and create their potions via `Rituals`?\n\n**What race is your character?** Human? Elf? Orc? While there are no statistical bonuses for race, they can add flavor to a character through role-play.\n\n> The _exception that proves the rule_: GMs may allow PCs to have `darkvision` or an additional `language`, provided the player offers sound reasoning to do so.\n\n**What `Attributes` does your character have?** Roll `2d6` for each of the following six character `Attributes` and assign the results in any order you wish.\n\n  - **strength (`str`):** for melee attacks; climbing; lifting\n  - **dexterity (`dex`):** for ranged attacks; stealth; dodging\n  - **intelligence (`int`):** for casting mage spells; memory; deduction\n  - **wisdom (`wis`):** for casting cleric spells; perception; searching\n  - **charisma (`cha`):** for persuasion; deception; intimidation\n  - **constitution (`con`):** for additional HD; physical fortitude; resist poisons;\n\nOn a:\n  - **2** the value is -1\n  - **3-6** the value is 0\n  - **7-9** the value is +1\n  - **10-11**, the value is +2\n  - **12**, the value is +3.\n\n> Note: **B&B** only makes use of **modifiers** (eg. `+2`); not the number rolled.\n\n**Choose two `Skills` and two `Abilities`:**\n\n#### Skills\nWhen a PC attempts something in the fiction that might be covered by a skill (eg. Athletics when climbing), they roll _advantage_ (`3d6` keeping the highest 2) `+ mod`.\n\n- **Athletics:** `+str/dex`: feats of strength and dexterity\n- **Awareness:** `+wis`: perceiving the environment around you\n- **Deception:** `+cha`: attempt to deceive\n- **Decipher:** `+int`: attempt to discern patterns in texts, symbols or numbers\n- **Heal:** `+wis`: provide an extra `Hit Die (HD)` to the party when resting/rolling `Hit Points (HP)`; heal `1d6+level HP` with your touch.\n- **Lore:** `+int`: consult your accumulated knowledge about something\n- **Stealth:** `+dex`: attempt to be sneaky\n- **Survival:** `+con/wis`: foraging, hunting; start a fire in unfavorable conditions, etc\n- **Sway:** `+cha`: use leverage to influence someone; diplomacy; intimidate; parley\n\n#### Abilities\nAdd additional flavor to a class. The word _attempt_ will generally signify rolling a `2d6+mod` when applicable.\n\n- **Backstab:** +3 damage from concealment\n- **Bless:** anoint items with holy water for +/-3 damage and as magical\n- **[Cantrips](https://brine.dev/#spellTags?t=cantrip):** cast 3 simple magical spells at will\n- **[Cast](http://lvh.me:4242/#spells):** cast level-less magical spells (see `Magic`)\n- **Connected:** you seem to have an acquaintance in every town\n- **Hardy:** +6 `HP`\n- **Linguist:** you are fluent in all civilized languages\n- **Lucky:** turn a miss into a partial success once per day\n- **Penitent:** when you take damage and embrace the pain, take advantage on your next roll\n- **Pet:** you have a loyal and _effective_ animal companion\n- **Reflexes:** you always act first and cannot be surprised\n- **Ritual:** attempt occult rituals; detailed in ancient tomes and scrolls\n- **Scout:** with you on point, your party covers more ground; you always spot targets before they spot you\n- **Shield:** when you wear no armor or shield, your faith protects you and grants you 2 armor\n- **Shift:** take the shape of an animal whose blood you've tasted (successful `con` roll to revert)\n- **Skirmish:** +1 damage; worn armor counts as one type lighter\n- **Slay:** +2 melee damage\n- **Tinker:** pick a lock, pocket or trap w/ tools\n- **Tough:** +1 armor\n- **Turn:** attempt to hold undead at bay with your faith and holy symbol\n- **Versed:** you share secret signs, speech and signals with your brethren\n- **Vision:** commune with your deity or demon via holy water/drugs\n- **Volley:** +2 ranged damage\n- **Wild:** converse with and attempt to command animals\n\n\n**Can your character take a hit?** You start with 1 Hit Die (`d6`) + additional hit dice equal to your `con`. **Roll all your hit dice and keep a number equal to your level** to determine your `HP`. For example, a 1st level PC with +1 con would roll `2d6` and keep the higher of the two.\n\nWhen you rest in `comfort and safety`, and consume food/drink, you may reroll your `HP`. This is the amount of damage you can suffer before you take your `Last Breath`. You add additional hit dice if you: are attended by a healer; rest in a spiritual place.\n\n  > A player may choose to reroll `HP` and find their PC now has _less_ `HP`. We all have bad days. Are they sick? Did they stay up drinking all night?\n\n<div class=\"pagebreak\"></div>\n\n### Magic\n\n**You can master spells equal to your level + 2** (eg. 1st level magi have mastered 3 spells).\n\nCasting spells takes a physical toll. **You can safely cast spells equal to your `hd + con`** (ie. _spell slots_). Above that, you take `1d6+lvl` damage for each spell cast. Safe casting is restored after resting in _comfort and safety_.\n\n**Mages add `int` to their casting rolls; clerics add `wis`** (eg. `2d6+int/wis`) and your `level` to damage rolls (eg. `2d6+lvl`). You gain an extra `d6` of damage at levels 5 & 10.\n\n  > Each time you level up, you may swap mastered spells for new ones.\n\n#### Scrolls\n\n**You may attempt to cast spells from written texts**. This requires more casting time while you read/review the spell (ie. _a turn_) and expends a _spell slot_.\n\n  > It is wise to identify a spell before casting it!\n\n#### Enhancements\n\n[_Enhancement_ spells](https://brine.dev/#spellTags?t=enhancement) are cast in conjunction with a target spell. They augment spell casting and/or effect, and expend a _spell slot_ in addition to the target spell.\n\n#### Mishaps\n**Magic is dangerous**. A failed casting roll may have consequences; a critical fail always will.\n\nAn example mishap table:\n\n  1. the target reflects the spell back at caster\n  1. `1d6+lvl` damage to the caster\n  3. the caster is blinded/frozen/afraid/etc... for a short time\n  4. the spell affects the party in some way (depending on the spell)\n  5. the caster turns blue\n  6. nothing happens... _lucky you!_\n\n\n### Playing the Game\n**Narrate your character's actions**. Eg. instead of saying: _I attack with my sword_; say things like: _with my sword drawn; stained with the blood and entrails of the orc at my feet; I charge the last remaining orc, smiting it with both hands and all the might left in me_... _or something less dramatic :) . Don't _say_ you do a thing; _describe_ how you do a thing.\n\n**Not all actions require a roll**. Say what your character does and the GM will handle the rest.\n\n**When you attempt something risky**, sum `2d6` and add one of your skill modifiers, based on the action you’re taking. (The GM will tell you some of the possible consequences before you roll, so you can decide if it’s worth the risk or if you want to revise your action).\n\n  - **2(snake eyes) is a critical failure**: shit hits the fan.\n  - **3-6 is a miss**: things don’t go well and the risk turns out badly.\n  - **7-9 is a partial success**: you do it but at a cost, compromise, retribution, retaliation, harm, etc.\n  - **10-11 is a full success**: you do it without complications.\n  - **12 (boxcars) is a critical success**: you do it perfectly to some extra benefit.\n\n  > A miss or a partial success might incur an enemy attack; damage; an additional threat; a lost item/resource/opportunity; a disadvantage; an unwelcome truth. They add to the role-play and can amp up the tension in a scene.\n\n#### Die of Fate\n**Sometimes the GM will roll the `die of fate` to see how a situation unfolds**. Low numbers are ill-fortune; high numbers are good fortune. The die of fate might be rolled to establish the weather, indicate a random NPC’s general attitude, to determine if a wandering monster appears, or the moral of a monster. The GM may also roll the die of fate if the PCs take some action for which sheer chance is the only factor in the outcome. **You will roll this often!**\n\n<div class=\"pagebreak\"></div>\n\n### Gear\n**You have `12+con` inventory slots**. Items you can hold in one hand take one slot; items that might require two hands to hold take two slots. One slot examples: worn armor/clothes (two slots if carried); a few daggers; a bag containing 250 coins. Two slot examples: martial/great weapons; large shields; animal trap; wine casks. When carrying more items than you have slots, you are `encumbered` (disadvantage on rolls involving physicality).\n\n> Inventory slots are meant to be more _concept than rule_. The intent is to remind players of the _useful_ items their PCs are carrying, while providing a reasonable amount they are _able_ to carry.\n\n**You start with `2d6*10` silver coins...**\n\n  - **Light Weapon** (10s): `d6`. May be wielded as a secondary weapon, _allowing you to reroll damage once per attack_. Includes daggers, short swords, and hand axes.\n  - **Martial Weapon** (30s): `d6+1`. Must be wielded in main hand. Includes long swords, hammers, axes, spears etc.\n  - **Great Weapon** (40s): `d6+2` damage. Uses two hands. Includes two-handed swords, battle-axes and pole arms.\n  - **Shortbow** (10s): d6. Also slings etc.\n  - **Bow** (30s): `d6+1`. Also crossbows, pistols etc.\n  - **Heavy Bow/Gun** (50s): `d6+2` Damage if firing from a _stationary position_. Includes crossbows and muskets.\n  - **Light Armor** (30s): Armor 1 (subtracted from damage taken).\n  - **Full Armor** (60s): Armor 2. Always has a helm. Makes it very hard to run, move quietly, swim, leap etc.\n  - **Shield** (10s): +1 Armor.\n  - **Backpack** (2s): Can hold 12 items up to 40lbs.\n  - **Adventuring Gear** (2s each): 20ft Rope, Iron Spike, Chalk, Parchment, Flint/Steel, Torches (4), Tent, Dice, Caltrops (slows pursuers), Bandages, Travel Rations, Waterskin, Wineskin.\n  - **Tools** (5s each): Crowbar, Hatchet, Animal Trap, Lockpicks, Pen & Pot of Ink, Fishing Pole, Shovel, Grappling Hook, Pickaxe, Collapsible Pole.\n  - **Occult Items** (10s each): Quicksilver (per dose), Pouch of Bone Dust, Vial of Holy Water (one use), Vial of Blood, Ritual Incense and Oils.\n  - **Fancy Items** (20s each): Mirror, Lantern, Spyglass, Sand Timer, Board Game, Elaborate Clothes, Holy Symbols and other charms.\n  - **Fire Oil** (20s per flask): Sets an area on fire (`d6+1` damage/round for 3 rounds unless extinguished). Fills a lantern 10 times.\n  - **Boats:** Rowboat (50s) to Galley (200,000s).\n  - **Carts:** Cart (30s) to Wagon (100s).\n  - **Taverns:** 1s to Sleep, 1s to Eat, 1s to Get Drunk.\n  - **Property:** House (1,000s) to Manor (100,000).\n  - **Horses:** Mule (30s), Horse (100s), Warhorse (1,000s).\n\n\n### Hirelings\nCost per day\n\n  - **Torch Bearer** (2s): 3HP, Knife.\n  - **Guide** (5s): 6HP, Knife, Lantern, Rope.\n  - **Armsman** (20s): 12HP, Spear, Shield, Light Armor.\n  - **Expert** (20s): 6HP, Skill 4, Dagger, Bow.\n  - **Champion** (60s): 18HP, Full Armor, Halberd, Sword, Shield, Dagger.\n\n\n### Levels\n_As you level up you get rewards according to the table below..._\n\nlevel |   hd   | skills | attributes | abils| damage\n:----:|:------:|:------:|:----------:|:----:|:------:\n 1    | 1+con  | 1+1    |            | 2    |\n 2    | +1     |        |            |      |\n 3    |        | +1     |            | +1   |\n 4    | +1     |        | +1 (max +3)|      |\n 5    |        |        |            |      | +1d6\n 6    | +1     | +1     |            |      |\n 7    |        |        | +1 (max +3)| +1   |\n 8    | +1     |        |            |      |\n 9    |        | +1     |            | +1   |\n 10   | +1     |        | +1 (max +3)|      | +1d6\n\n\n**B&B** uses **Milestones** to measure a player character's development. The GM sets a goal(s) for the PCs to accomplish before they can reach the next level. Each level should be twice as hard to achieve (give or take). Milestones might include:\n  - merely surviving their first encounter\n  - obtaining a MacGuffin\n  - completing a quest\n  - defeating a boss\n  - failures... always a formidable teacher\n\n### Last Breath\nWhen a PC's `HP` drops to 0, they must roll `2d6+con`:\n\n  On a:\n  - **6-**: you're dead; roll a new character :rip:\n  - **7-9:** you will meet **Death** and bargain for your life. SPOILER: _Death can be a dick!_\n  - **10+:** you feel like hammered shit... but you're alive\n\n### True Names\nTrue names have power; knowing a true name gives you power over _the named_. Calling to someone by their `True Name` gives them advantage on `Last Breath` rolls.\n\n<div class=\"pagebreak\"></div>\n\n\n### GMs\nThe following are friendly suggestions for GMing **B&B**. As always, do what's right for you or your players.\n\n  - **Initiative:** The coolest part of `Initiative`... is saying **roll initiative!** Given a group of reasonable size (2-5 PCs), _cinematic jump cuts_ (camera-like jumps between players/situations; that follow the narrative) are a great alternative. It also works well with a split party.\n  - **Splitting the Party:** ALWAYS split the party. It's a hoot.\n  - **Balancing Encounters:** Don't do it! PCs should be smart enough to know when they're outmatched. If not, there's always `Last Breath`. Outside of that, rolling new characters is a snap in **B&B** :)\n  - **Magic Items:** resist issuing +1 _to hit_ items; rather give +1 to damage or something more situational\n",
    "html": "<p>by <a href=\"https://brine.dev\">brine</a> - <version><em>v 1.0</em></version></p>\n<p><strong>Beasts & Barrows</strong> is an uncomplicated fantasy role-playing game (RPG) for 2-5 players + Game Maestro (GM). It steals blatantly from John Harper's <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons</a> and shares the same <a href=\"http://apocalypse-world.com/pbta\">PbtA</a> core mechanic (<code>2d6</code>). <del>YOU ARE FORBIDDEN TO HACK THIS!</del></p>\n<p><strong>Beasts & Barrows (B&B)</strong> values:</p>\n<ul>\n<li><strong>role-play:</strong> rules and mechanics emphasize and encourage role-play</li>\n<li><strong>simplicity:</strong> less math; less rules; more fun</li>\n<li><strong>show, don't tell:</strong> don't <em>tell</em> me your alignment… <em>show</em> me your alignment; don't <em>tell</em> me you attack; <em>describe</em> your attack</li>\n<li><strong>flexibility:</strong> running existing adventures from <em>any</em> system is trivial</li>\n</ul>\n<p><break></p>\n<div class=\"pagebreak\"></div>\n<h3 id=\"charactercreation\">Character Creation</h3>\n<p><strong>What kind of character sounds fun to play?</strong> Rolling a new character takes <em>ones of minutes</em>. This question will likely take the longest to answer. Here are some classic examples but you are free to create your own:</p>\n<ul>\n<li><strong>Warrior:</strong> strong and good with the stabby stab</li>\n<li><strong>Thief:</strong> nimble and sneaky sneaksters</li>\n<li><strong>Mage:</strong> smart and full of arcaney goodness</li>\n<li><strong>Priest:</strong> wise and has a direct line to the gods</li>\n</ul>\n<blockquote>\n  <p>Outside of the <em>classic classes</em>, players are encouraged to create their own by making clever use of the existing <code>Skills and Abilities</code>. For example an <strong>Alchemist</strong> might require <code>Lore</code> and create their potions via <code>Rituals</code>?</p>\n</blockquote>\n<p><strong>What race is your character?</strong> Human? Elf? Orc? While there are no statistical bonuses for race, they can add flavor to a character through role-play.</p>\n<blockquote>\n  <p>The <em>exception that proves the rule</em>: GMs may allow PCs to have <code>darkvision</code> or an additional <code>language</code>, provided the player offers sound reasoning to do so.</p>\n</blockquote>\n<p><strong>What <code>Attributes</code> does your character have?</strong> Roll <code>2d6</code> for each of the following six character <code>Attributes</code> and assign the results in any order you wish.</p>\n<ul>\n<li><strong>strength (<code>str</code>):</strong> for melee attacks; climbing; lifting</li>\n<li><strong>dexterity (<code>dex</code>):</strong> for ranged attacks; stealth; dodging</li>\n<li><strong>intelligence (<code>int</code>):</strong> for casting mage spells; memory; deduction</li>\n<li><strong>wisdom (<code>wis</code>):</strong> for casting cleric spells; perception; searching</li>\n<li><strong>charisma (<code>cha</code>):</strong> for persuasion; deception; intimidation</li>\n<li><strong>constitution (<code>con</code>):</strong> for additional HD; physical fortitude; resist poisons;</li>\n</ul>\n<p>On a:</p>\n<ul>\n<li><strong>2</strong> the value is -1</li>\n<li><strong>3-6</strong> the value is 0</li>\n<li><strong>7-9</strong> the value is +1</li>\n<li><strong>10-11</strong>, the value is +2</li>\n<li><strong>12</strong>, the value is +3.</li>\n</ul>\n<blockquote>\n  <p>Note: <strong>B&B</strong> only makes use of <strong>modifiers</strong> (eg. <code>+2</code>); not the number rolled.</p>\n</blockquote>\n<p><strong>Choose two <code>Skills</code> and two <code>Abilities</code>:</strong></p>\n<h4 id=\"skills\">Skills</h4>\n<p>When a PC attempts something in the fiction that might be covered by a skill (eg. Athletics when climbing), they roll <em>advantage</em> (<code>3d6</code> keeping the highest 2) <code>+ mod</code>.</p>\n<ul>\n<li><strong>Athletics:</strong> <code>+str/dex</code>: feats of strength and dexterity</li>\n<li><strong>Awareness:</strong> <code>+wis</code>: perceiving the environment around you</li>\n<li><strong>Deception:</strong> <code>+cha</code>: attempt to deceive</li>\n<li><strong>Decipher:</strong> <code>+int</code>: attempt to discern patterns in texts, symbols or numbers</li>\n<li><strong>Heal:</strong> <code>+wis</code>: provide an extra <code>Hit Die (HD)</code> to the party when resting/rolling <code>Hit Points (HP)</code>; heal <code>1d6+level HP</code> with your touch.</li>\n<li><strong>Lore:</strong> <code>+int</code>: consult your accumulated knowledge about something</li>\n<li><strong>Stealth:</strong> <code>+dex</code>: attempt to be sneaky</li>\n<li><strong>Survival:</strong> <code>+con/wis</code>: foraging, hunting; start a fire in unfavorable conditions, etc</li>\n<li><strong>Sway:</strong> <code>+cha</code>: use leverage to influence someone; diplomacy; intimidate; parley</li>\n</ul>\n<h4 id=\"abilities\">Abilities</h4>\n<p>Add additional flavor to a class. The word <em>attempt</em> will generally signify rolling a <code>2d6+mod</code> when applicable.</p>\n<ul>\n<li><strong>Backstab:</strong> +3 damage from concealment</li>\n<li><strong>Bless:</strong> anoint items with holy water for +/-3 damage and as magical</li>\n<li><strong><a href=\"https://brine.dev/#spellTags?t=cantrip\">Cantrips</a>:</strong> cast 3 simple magical spells at will</li>\n<li><strong><a href=\"http://lvh.me:4242/#spells\">Cast</a>:</strong> cast level-less magical spells (see <code>Magic</code>)</li>\n<li><strong>Connected:</strong> you seem to have an acquaintance in every town</li>\n<li><strong>Hardy:</strong> +6 <code>HP</code></li>\n<li><strong>Linguist:</strong> you are fluent in all civilized languages</li>\n<li><strong>Lucky:</strong> turn a miss into a partial success once per day</li>\n<li><strong>Penitent:</strong> when you take damage and embrace the pain, take advantage on your next roll</li>\n<li><strong>Pet:</strong> you have a loyal and <em>effective</em> animal companion</li>\n<li><strong>Reflexes:</strong> you always act first and cannot be surprised</li>\n<li><strong>Ritual:</strong> attempt occult rituals; detailed in ancient tomes and scrolls</li>\n<li><strong>Scout:</strong> with you on point, your party covers more ground; you always spot targets before they spot you</li>\n<li><strong>Shield:</strong> when you wear no armor or shield, your faith protects you and grants you 2 armor</li>\n<li><strong>Shift:</strong> take the shape of an animal whose blood you've tasted (successful <code>con</code> roll to revert)</li>\n<li><strong>Skirmish:</strong> +1 damage; worn armor counts as one type lighter</li>\n<li><strong>Slay:</strong> +2 melee damage</li>\n<li><strong>Tinker:</strong> pick a lock, pocket or trap w/ tools</li>\n<li><strong>Tough:</strong> +1 armor</li>\n<li><strong>Turn:</strong> attempt to hold undead at bay with your faith and holy symbol</li>\n<li><strong>Versed:</strong> you share secret signs, speech and signals with your brethren</li>\n<li><strong>Vision:</strong> commune with your deity or demon via holy water/drugs</li>\n<li><strong>Volley:</strong> +2 ranged damage</li>\n<li><strong>Wild:</strong> converse with and attempt to command animals</li>\n</ul>\n<p><strong>Can your character take a hit?</strong> You start with 1 Hit Die (<code>d6</code>) + additional hit dice equal to your <code>con</code>. <strong>Roll all your hit dice and keep a number equal to your level</strong> to determine your <code>HP</code>. For example, a 1st level PC with +1 con would roll <code>2d6</code> and keep the higher of the two.</p>\n<p>When you rest in <code>comfort and safety</code>, and consume food/drink, you may reroll your <code>HP</code>. This is the amount of damage you can suffer before you take your <code>Last Breath</code>. You add additional hit dice if you: are attended by a healer; rest in a spiritual place.</p>\n<blockquote>\n  <p>A player may choose to reroll <code>HP</code> and find their PC now has <em>less</em> <code>HP</code>. We all have bad days. Are they sick? Did they stay up drinking all night?</p>\n</blockquote>\n<div class=\"pagebreak\"></div>\n<h3 id=\"magic\">Magic</h3>\n<p><strong>You can master spells equal to your level + 2</strong> (eg. 1st level magi have mastered 3 spells).</p>\n<p>Casting spells takes a physical toll. <strong>You can safely cast spells equal to your <code>hd + con</code></strong> (ie. <em>spell slots</em>). Above that, you take <code>1d6+lvl</code> damage for each spell cast. Safe casting is restored after resting in <em>comfort and safety</em>.</p>\n<p><strong>Mages add <code>int</code> to their casting rolls; clerics add <code>wis</code></strong> (eg. <code>2d6+int/wis</code>) and your <code>level</code> to damage rolls (eg. <code>2d6+lvl</code>). You gain an extra <code>d6</code> of damage at levels 5 &amp; 10.</p>\n<blockquote>\n  <p>Each time you level up, you may swap mastered spells for new ones.</p>\n</blockquote>\n<h4 id=\"scrolls\">Scrolls</h4>\n<p><strong>You may attempt to cast spells from written texts</strong>. This requires more casting time while you read/review the spell (ie. <em>a turn</em>) and expends a <em>spell slot</em>.</p>\n<blockquote>\n  <p>It is wise to identify a spell before casting it!</p>\n</blockquote>\n<h4 id=\"enhancements\">Enhancements</h4>\n<p><a href=\"https://brine.dev/#spellTags?t=enhancement\"><em>Enhancement</em> spells</a> are cast in conjunction with a target spell. They augment spell casting and/or effect, and expend a <em>spell slot</em> in addition to the target spell.</p>\n<h4 id=\"mishaps\">Mishaps</h4>\n<p><strong>Magic is dangerous</strong>. A failed casting roll may have consequences; a critical fail always will.</p>\n<p>An example mishap table:</p>\n<ol>\n<li>the target reflects the spell back at caster</li>\n<li><code>1d6+lvl</code> damage to the caster</li>\n<li>the caster is blinded/frozen/afraid/etc… for a short time</li>\n<li>the spell affects the party in some way (depending on the spell)</li>\n<li>the caster turns blue</li>\n<li>nothing happens… <em>lucky you!</em></li>\n</ol>\n<h3 id=\"playingthegame\">Playing the Game</h3>\n<p><strong>Narrate your character's actions</strong>. Eg. instead of saying: <em>I attack with my sword</em>; say things like: <em>with my sword drawn; stained with the blood and entrails of the orc at my feet; I charge the last remaining orc, smiting it with both hands and all the might left in me</em>… _or something less dramatic :) . Don't _say_ you do a thing; <em>describe</em> how you do a thing.</p>\n<p><strong>Not all actions require a roll</strong>. Say what your character does and the GM will handle the rest.</p>\n<p><strong>When you attempt something risky</strong>, sum <code>2d6</code> and add one of your skill modifiers, based on the action you’re taking. (The GM will tell you some of the possible consequences before you roll, so you can decide if it’s worth the risk or if you want to revise your action).</p>\n<ul>\n<li><strong>2(snake eyes) is a critical failure</strong>: shit hits the fan.</li>\n<li><strong>3-6 is a miss</strong>: things don’t go well and the risk turns out badly.</li>\n<li><strong>7-9 is a partial success</strong>: you do it but at a cost, compromise, retribution, retaliation, harm, etc.</li>\n<li><strong>10-11 is a full success</strong>: you do it without complications.</li>\n<li><strong>12 (boxcars) is a critical success</strong>: you do it perfectly to some extra benefit.</li>\n</ul>\n<blockquote>\n  <p>A miss or a partial success might incur an enemy attack; damage; an additional threat; a lost item/resource/opportunity; a disadvantage; an unwelcome truth. They add to the role-play and can amp up the tension in a scene.</p>\n</blockquote>\n<h4 id=\"dieoffate\">Die of Fate</h4>\n<p><strong>Sometimes the GM will roll the <code>die of fate</code> to see how a situation unfolds</strong>. Low numbers are ill-fortune; high numbers are good fortune. The die of fate might be rolled to establish the weather, indicate a random NPC’s general attitude, to determine if a wandering monster appears, or the moral of a monster. The GM may also roll the die of fate if the PCs take some action for which sheer chance is the only factor in the outcome. <strong>You will roll this often!</strong></p>\n<div class=\"pagebreak\"></div>\n<h3 id=\"gear\">Gear</h3>\n<p><strong>You have <code>12+con</code> inventory slots</strong>. Items you can hold in one hand take one slot; items that might require two hands to hold take two slots. One slot examples: worn armor/clothes (two slots if carried); a few daggers; a bag containing 250 coins. Two slot examples: martial/great weapons; large shields; animal trap; wine casks. When carrying more items than you have slots, you are <code>encumbered</code> (disadvantage on rolls involving physicality).</p>\n<blockquote>\n  <p>Inventory slots are meant to be more <em>concept than rule</em>. The intent is to remind players of the <em>useful</em> items their PCs are carrying, while providing a reasonable amount they are <em>able</em> to carry.</p>\n</blockquote>\n<p><strong>You start with <code>2d6*10</code> silver coins…</strong></p>\n<ul>\n<li><strong>Light Weapon</strong> (10s): <code>d6</code>. May be wielded as a secondary weapon, <em>allowing you to reroll damage once per attack</em>. Includes daggers, short swords, and hand axes.</li>\n<li><strong>Martial Weapon</strong> (30s): <code>d6+1</code>. Must be wielded in main hand. Includes long swords, hammers, axes, spears etc.</li>\n<li><strong>Great Weapon</strong> (40s): <code>d6+2</code> damage. Uses two hands. Includes two-handed swords, battle-axes and pole arms.</li>\n<li><strong>Shortbow</strong> (10s): d6. Also slings etc.</li>\n<li><strong>Bow</strong> (30s): <code>d6+1</code>. Also crossbows, pistols etc.</li>\n<li><strong>Heavy Bow/Gun</strong> (50s): <code>d6+2</code> Damage if firing from a <em>stationary position</em>. Includes crossbows and muskets.</li>\n<li><strong>Light Armor</strong> (30s): Armor 1 (subtracted from damage taken).</li>\n<li><strong>Full Armor</strong> (60s): Armor 2. Always has a helm. Makes it very hard to run, move quietly, swim, leap etc.</li>\n<li><strong>Shield</strong> (10s): +1 Armor.</li>\n<li><strong>Backpack</strong> (2s): Can hold 12 items up to 40lbs.</li>\n<li><strong>Adventuring Gear</strong> (2s each): 20ft Rope, Iron Spike, Chalk, Parchment, Flint/Steel, Torches (4), Tent, Dice, Caltrops (slows pursuers), Bandages, Travel Rations, Waterskin, Wineskin.</li>\n<li><strong>Tools</strong> (5s each): Crowbar, Hatchet, Animal Trap, Lockpicks, Pen &amp; Pot of Ink, Fishing Pole, Shovel, Grappling Hook, Pickaxe, Collapsible Pole.</li>\n<li><strong>Occult Items</strong> (10s each): Quicksilver (per dose), Pouch of Bone Dust, Vial of Holy Water (one use), Vial of Blood, Ritual Incense and Oils.</li>\n<li><strong>Fancy Items</strong> (20s each): Mirror, Lantern, Spyglass, Sand Timer, Board Game, Elaborate Clothes, Holy Symbols and other charms.</li>\n<li><strong>Fire Oil</strong> (20s per flask): Sets an area on fire (<code>d6+1</code> damage/round for 3 rounds unless extinguished). Fills a lantern 10 times.</li>\n<li><strong>Boats:</strong> Rowboat (50s) to Galley (200,000s).</li>\n<li><strong>Carts:</strong> Cart (30s) to Wagon (100s).</li>\n<li><strong>Taverns:</strong> 1s to Sleep, 1s to Eat, 1s to Get Drunk.</li>\n<li><strong>Property:</strong> House (1,000s) to Manor (100,000).</li>\n<li><strong>Horses:</strong> Mule (30s), Horse (100s), Warhorse (1,000s).</li>\n</ul>\n<h3 id=\"hirelings\">Hirelings</h3>\n<p>Cost per day</p>\n<ul>\n<li><strong>Torch Bearer</strong> (2s): 3HP, Knife.</li>\n<li><strong>Guide</strong> (5s): 6HP, Knife, Lantern, Rope.</li>\n<li><strong>Armsman</strong> (20s): 12HP, Spear, Shield, Light Armor.</li>\n<li><strong>Expert</strong> (20s): 6HP, Skill 4, Dagger, Bow.</li>\n<li><strong>Champion</strong> (60s): 18HP, Full Armor, Halberd, Sword, Shield, Dagger.</li>\n</ul>\n<h3 id=\"levels\">Levels</h3>\n<p><em>As you level up you get rewards according to the table below…</em></p>\n<table>\n<thead>\n<tr>\n<th id=\"level\" style=\"text-align:center;\">level</th>\n<th id=\"hd\" style=\"text-align:center;\">hd</th>\n<th id=\"skills\" style=\"text-align:center;\">skills</th>\n<th id=\"attributes\" style=\"text-align:center;\">attributes</th>\n<th id=\"abils\" style=\"text-align:center;\">abils</th>\n<th id=\"damage\" style=\"text-align:center;\">damage</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:center;\">1</td>\n<td style=\"text-align:center;\">1+con</td>\n<td style=\"text-align:center;\">1+1</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">2</td>\n<td style=\"text-align:center;\"></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">2</td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">3</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">4</td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1 (max +3)</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">5</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1d6</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">6</td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">7</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1 (max +3)</td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">8</td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\"></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">9</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">10</td>\n<td style=\"text-align:center;\">+1</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1 (max +3)</td>\n<td style=\"text-align:center;\"></td>\n<td style=\"text-align:center;\">+1d6</td>\n</tr>\n</tbody>\n</table>\n<p><strong>B&B</strong> uses <strong>Milestones</strong> to measure a player character's development. The GM sets a goal(s) for the PCs to accomplish before they can reach the next level. Each level should be twice as hard to achieve (give or take). Milestones might include:</p>\n<ul>\n<li>merely surviving their first encounter</li>\n<li>obtaining a MacGuffin</li>\n<li>completing a quest</li>\n<li>defeating a boss</li>\n<li>failures… always a formidable teacher</li>\n</ul>\n<h3 id=\"lastbreath\">Last Breath</h3>\n<p>When a PC's <code>HP</code> drops to 0, they must roll <code>2d6+con</code>:</p>\n<p>On a:</p>\n<ul>\n<li><strong>6-</strong>: you're dead; roll a new character :rip:</li>\n<li><strong>7-9:</strong> you will meet <strong>Death</strong> and bargain for your life. SPOILER: <em>Death can be a dick!</em></li>\n<li><strong>10+:</strong> you feel like hammered shit… but you're alive</li>\n</ul>\n<h3 id=\"truenames\">True Names</h3>\n<p>True names have power; knowing a true name gives you power over <em>the named</em>. Calling to someone by their <code>True Name</code> gives them advantage on <code>Last Breath</code> rolls.</p>\n<div class=\"pagebreak\"></div>\n<h3 id=\"gms\">GMs</h3>\n<p>The following are friendly suggestions for GMing <strong>B&B</strong>. As always, do what's right for you or your players.</p>\n<ul>\n<li><strong>Initiative:</strong> The coolest part of <code>Initiative</code>… is saying <strong>roll initiative!</strong> Given a group of reasonable size (2-5 PCs), <em>cinematic jump cuts</em> (camera-like jumps between players/situations; that follow the narrative) are a great alternative. It also works well with a split party.</li>\n<li><strong>Splitting the Party:</strong> ALWAYS split the party. It's a hoot.</li>\n<li><strong>Balancing Encounters:</strong> Don't do it! PCs should be smart enough to know when they're outmatched. If not, there's always <code>Last Breath</code>. Outside of that, rolling new characters is a snap in <strong>B&B</strong> :)</li>\n<li><strong>Magic Items:</strong> resist issuing +1 <em>to hit</em> items; rather give +1 to damage or something more situational</li>\n</ul>"
  },
  {
    "meta": {
      "title": "Black Jenny and her Gang of Miscreant Sons",
      "date": "2021-7-4",
      "description": "Those adorable little miscreants!",
      "tags": "npcs",
      "slug": "black_jenny_and_her_gang_of_miscreant_sons"
    },
    "markdown": "---\ntitle: Black Jenny and her Gang of Miscreant Sons\ndate: 2021-7-4\ndescription: Those adorable little miscreants!\ntags: npcs\n---\n\nI like to weave pre-written modules into my campaigns (parts of them, anyway). The different tones and ideas keep my players guessing and oftentimes end up becoming part of our lore. Case in point: when I threw [Prison of the Hated Pretender](http://dungeonofsigns.blogspot.com/2012/08/prison-of-hated-pretender-pdf.html) into my longrunning campaign. I had previously run it as a one-shot when one of my players was unavailable. It ended in a TPK 🙄.\n\n<break>\n\nBeing the benevolent GM that I am, I decided to bring my campaign party back to this setting and witness their one-shot character's dead, broken bodies. They also found out that the Pretender... HAS ESCAPED! In search of his crown, he immediately sought out... _Black Jenny_.\n\n**The Hated Pretender and Black Jenny are now NPCs in my world.** From the module, we know Jenny's name; the name of her gang, and that she stole the crown of the Hated Pretender. Thus, I had to flesh her out a bit. This is what I came up with...\n\n### The Gang\n\nJenny's \"sons\" are neither boys nor related to her by blood. Street urchins with promise; she recruits them, trains them and puts them to work. All mentions of her _Miscreant Sons_ are met with a collective groan from the girls. It is safer to pose as _sons than daughters_; so they look the other way... _but hate it_.\n\n  - **Black Jenny** - _road agent_\n    > `hd5(+2con); ac+2; at2d6(+2dex/0str): 2d6(+1 daggers)`\n\n    > She has dark hair and black leather armor. A string of onyx gemstones around her neck. She wants to retire... in a _black tower_.\n\n  - **Natty** - _thief_\n    > `hd3; ac0; at1d6(+2dex/0str): 1d6(bow +1/daggers); lock picks/backstab;`\n\n    > The oldest of the girls at 14, it's getting more and more difficult to play the role of a \"son\". She wears her long, red hair in a _boys style_; frumpy clothes and is quick to pick a pocket.\n\n  - **Lunara** - _alchemist_\n    > `hd3; ac0; at1d6: 1d6(+1 pistols/darts); ritual/lore`\n\n    > She sports a blonde bowl cut and a tunic with multiple burn marks. Through rituals, she is able to concoct healing potions, gunpowder and an _exploding_ paralysis potion. She wears a leather satchel full of glass vials.\n\n  - **Peregrine** - _ranger_\n    > `hd3(+2con); ac0; at1d6(+1str): bite/claws;`\n\n    > She is a _skin-walker_ and can shapeshift into a falcon. She has a number of tattoos and spiked, dark hair. She always attacks in falcon form.\n\n### Tactics\n\nThe gang will attempt to get an edge by having **Peregrine** drop a paralysis vial on targets. Those that remain moving will get the same potion via a dart from **Lunara**. Otherwise, they will turn to **Natty's** stealth or ability to _obtain_ things...\n",
    "html": "<p>I like to weave pre-written modules into my campaigns (parts of them, anyway). The different tones and ideas keep my players guessing and oftentimes end up becoming part of our lore. Case in point: when I threw <a href=\"http://dungeonofsigns.blogspot.com/2012/08/prison-of-hated-pretender-pdf.html\">Prison of the Hated Pretender</a> into my longrunning campaign. I had previously run it as a one-shot when one of my players was unavailable. It ended in a TPK 🙄.</p>\n<p><break></p>\n<p>Being the benevolent GM that I am, I decided to bring my campaign party back to this setting and witness their one-shot character's dead, broken bodies. They also found out that the Pretender… HAS ESCAPED! In search of his crown, he immediately sought out… <em>Black Jenny</em>.</p>\n<p><strong>The Hated Pretender and Black Jenny are now NPCs in my world.</strong> From the module, we know Jenny's name; the name of her gang, and that she stole the crown of the Hated Pretender. Thus, I had to flesh her out a bit. This is what I came up with…</p>\n<h3 id=\"thegang\">The Gang</h3>\n<p>Jenny's \"sons\" are neither boys nor related to her by blood. Street urchins with promise; she recruits them, trains them and puts them to work. All mentions of her <em>Miscreant Sons</em> are met with a collective groan from the girls. It is safer to pose as <em>sons than daughters</em>; so they look the other way… <em>but hate it</em>.</p>\n<ul>\n<li><p><strong>Black Jenny</strong> - <em>road agent</em></p>\n<blockquote>\n  <p><code>hd5(+2con); ac+2; at2d6(+2dex/0str): 2d6(+1 daggers)</code></p>\n  <p>She has dark hair and black leather armor. A string of onyx gemstones around her neck. She wants to retire… in a <em>black tower</em>.</p>\n</blockquote></li>\n<li><p><strong>Natty</strong> - <em>thief</em></p>\n<blockquote>\n  <p><code>hd3; ac0; at1d6(+2dex/0str): 1d6(bow +1/daggers); lock picks/backstab;</code></p>\n  <p>The oldest of the girls at 14, it's getting more and more difficult to play the role of a \"son\". She wears her long, red hair in a <em>boys style</em>; frumpy clothes and is quick to pick a pocket.</p>\n</blockquote></li>\n<li><p><strong>Lunara</strong> - <em>alchemist</em></p>\n<blockquote>\n  <p><code>hd3; ac0; at1d6: 1d6(+1 pistols/darts); ritual/lore</code></p>\n  <p>She sports a blonde bowl cut and a tunic with multiple burn marks. Through rituals, she is able to concoct healing potions, gunpowder and an <em>exploding</em> paralysis potion. She wears a leather satchel full of glass vials.</p>\n</blockquote></li>\n<li><p><strong>Peregrine</strong> - <em>ranger</em></p>\n<blockquote>\n  <p><code>hd3(+2con); ac0; at1d6(+1str): bite/claws;</code></p>\n  <p>She is a <em>skin-walker</em> and can shapeshift into a falcon. She has a number of tattoos and spiked, dark hair. She always attacks in falcon form.</p>\n</blockquote></li>\n</ul>\n<h3 id=\"tactics\">Tactics</h3>\n<p>The gang will attempt to get an edge by having <strong>Peregrine</strong> drop a paralysis vial on targets. Those that remain moving will get the same potion via a dart from <strong>Lunara</strong>. Otherwise, they will turn to <strong>Natty's</strong> stealth or ability to <em>obtain</em> things…</p>"
  },
  {
    "meta": {
      "title": "D66 Spark Table Generator",
      "date": "2022-2-16",
      "description": "Spark tables are a great way to induce creativity...",
      "tags": "spark, tools",
      "slug": "d66_spark_table_generator"
    },
    "markdown": "---\ntitle: D66 Spark Table Generator\ndate: 2022-2-16\ndescription: Spark tables are a great way to induce creativity...\ntags: spark, tools\n---\n\nI've been playing around with **spark tables**; a concept taken from [Chris McDowall](https://www.bastionland.com). The concept is quite simple: given two numbered tables/lists of evocative words, roll on both, and use the words together to spark an idea.\n\nThis is lovely... but I wanted to create tables specific to my games/worlds, and was struggling to come up with evocative words. THUS, **a spark table to _generate_ spark tables was born!**\n\n<break>\n\n## INSTRUCTIONS\n1. Roll `2d6`: the die landing closest to you (real dice) or leftmost (dice bot) is the first digit (`10s`); the other die is the second digit (`1s`)\n2. If you roll doubles, roll again and use both results\n3. Use the result(s) to think of a _spark word_\n4. Record each word on a similarly numbered d66 table (or as many as you want)\n5. If stuck, roll for another spark, or re-roll until you spark something\n6. Once you have your own spark tables, roll 2d6 on each and mash the two words together to generate ideas\n\n_HINT: if using the doubles rule (#2), make sure those words are fairly generic as to mash well with others._\n\n## D66 SPARK TABLE GENERATOR\n\n```\n11 smell\n12 size/importance\n13 condition\n14 worth/merit\n15 atmospheric condition\n16 crop\n21 emotion\n22 object\n23 food\n24 profession\n25 sound\n26 feeling\n31 happy word\n32 liquid\n33 color\n34 constructed landmark\n35 natural landmark\n36 lifestyle quality\n41 made from\n42 meaning of life\n43 crime\n44 organization\n45 body shape/type/size\n46 element\n51 problem\n52 building\n53 scary word\n54 furniture\n55 group(ing)\n56 event\n61 attraction\n62 art\n63 economic issue/boon\n64 animal\n65 cloud description\n66 mystical\n```\n\n## Examples\n\n```\n11. spirit       pirates      head          fluffy\n12. roadrunner   orgy         mob           sugar\n13. drought      caustic      dance         egg\n14. soil         dungeon      bubbles       boom\n15. desk         festivities  poison        lake\n16. barrow       sulfur       table         bounty\n21. toxic        taco         luxury        rainbow\n22. kiva         perfume      brimstone     monastery\n23. thunder      scared       bounty-hunter guards\n24. library      blood        arroyo        bacon\n25. bridge       iron         chocolate     kidnap\n26. haze         badger       fire          missing\n31. hanging-tree dark         graveyard     runes\n32. tavern       dreams       vagrant       happy\n33. rascal       rumble       concert       sick\n34. temple       shadows      anger         mine\n35. burning      shaken       poor          meat\n36. crushed      cairn        brain         paper\n41. horn         frozen       gateway       balloons\n42. tower        pig          finger        copper\n43. mundane      joyful       theft         tattoo\n44. hunched      stretched    cat           alchemist\n45. cooks        ice          balmy         love\n46. vast         embezzlement explosion     famous\n51. law          statue       abandoned     relic\n52. gods         hate         destitute     inoperable\n53. expanding    kitten       atomic        skeletons\n54. peyote       ghostly      affluent      erupting\n55. shortage     grand        priest        fundraiser\n56. silver       lanky        hostile       victory\n61. crystal      numb         water         virtuous\n62. mill         fountain     music         drunk\n63. opulent      gold         infestation   glowing\n64. cult         broken       treasure      cave\n65. long         silk         blight        stable\n66. sunny        death        soft          birth\n```",
    "html": "<p>I've been playing around with <strong>spark tables</strong>; a concept taken from <a href=\"https://www.bastionland.com\">Chris McDowall</a>. The concept is quite simple: given two numbered tables/lists of evocative words, roll on both, and use the words together to spark an idea.</p>\n<p>This is lovely… but I wanted to create tables specific to my games/worlds, and was struggling to come up with evocative words. THUS, <strong>a spark table to <em>generate</em> spark tables was born!</strong></p>\n<p><break></p>\n<h2 id=\"instructions\">INSTRUCTIONS</h2>\n<ol>\n<li>Roll <code>2d6</code>: the die landing closest to you (real dice) or leftmost (dice bot) is the first digit (<code>10s</code>); the other die is the second digit (<code>1s</code>)</li>\n<li>If you roll doubles, roll again and use both results</li>\n<li>Use the result(s) to think of a <em>spark word</em></li>\n<li>Record each word on a similarly numbered d66 table (or as many as you want)</li>\n<li>If stuck, roll for another spark, or re-roll until you spark something</li>\n<li>Once you have your own spark tables, roll 2d6 on each and mash the two words together to generate ideas</li>\n</ol>\n<p><em>HINT: if using the doubles rule (#2), make sure those words are fairly generic as to mash well with others.</em></p>\n<h2 id=\"d66sparktablegenerator\">D66 SPARK TABLE GENERATOR</h2>\n<pre><code>11 smell\n12 size/importance\n13 condition\n14 worth/merit\n15 atmospheric condition\n16 crop\n21 emotion\n22 object\n23 food\n24 profession\n25 sound\n26 feeling\n31 happy word\n32 liquid\n33 color\n34 constructed landmark\n35 natural landmark\n36 lifestyle quality\n41 made from\n42 meaning of life\n43 crime\n44 organization\n45 body shape/type/size\n46 element\n51 problem\n52 building\n53 scary word\n54 furniture\n55 group(ing)\n56 event\n61 attraction\n62 art\n63 economic issue/boon\n64 animal\n65 cloud description\n66 mystical\n</code></pre>\n<h2 id=\"examples\">Examples</h2>\n<pre><code>11. spirit       pirates      head          fluffy\n12. roadrunner   orgy         mob           sugar\n13. drought      caustic      dance         egg\n14. soil         dungeon      bubbles       boom\n15. desk         festivities  poison        lake\n16. barrow       sulfur       table         bounty\n21. toxic        taco         luxury        rainbow\n22. kiva         perfume      brimstone     monastery\n23. thunder      scared       bounty-hunter guards\n24. library      blood        arroyo        bacon\n25. bridge       iron         chocolate     kidnap\n26. haze         badger       fire          missing\n31. hanging-tree dark         graveyard     runes\n32. tavern       dreams       vagrant       happy\n33. rascal       rumble       concert       sick\n34. temple       shadows      anger         mine\n35. burning      shaken       poor          meat\n36. crushed      cairn        brain         paper\n41. horn         frozen       gateway       balloons\n42. tower        pig          finger        copper\n43. mundane      joyful       theft         tattoo\n44. hunched      stretched    cat           alchemist\n45. cooks        ice          balmy         love\n46. vast         embezzlement explosion     famous\n51. law          statue       abandoned     relic\n52. gods         hate         destitute     inoperable\n53. expanding    kitten       atomic        skeletons\n54. peyote       ghostly      affluent      erupting\n55. shortage     grand        priest        fundraiser\n56. silver       lanky        hostile       victory\n61. crystal      numb         water         virtuous\n62. mill         fountain     music         drunk\n63. opulent      gold         infestation   glowing\n64. cult         broken       treasure      cave\n65. long         silk         blight        stable\n66. sunny        death        soft          birth\n</code></pre>"
  },
  {
    "meta": {
      "title": "Delve of the Handsome Repeater",
      "date": "2022-1-12",
      "description": "A short fantasy adventure for Beasts &amp; Barrows",
      "tags": "my_stuff, bnb, adventures",
      "slug": "delve_of_the_handosme_repeater"
    },
    "markdown": "---\ntitle: Delve of the Handsome Repeater\ndate: 2022-1-12\ndescription: A short fantasy adventure for Beasts & Barrows\ntags: my_stuff, bnb, adventures\n---\n\n[![center](assets/images/dothr-630x500.png)](https://casadeocio.itch.io/delve-of-the-handsome-repeater)\n\nI like adventure modules. I especially like the newer ones... that are _actually_ modular. Short, open-ended adventures that are trivial to drop into any campaign. Scanable; easy to grok. This is thankfully becoming the norm; fighting against the epic walls-of-text, and endless lore from modules of yore. This is what I want and what _I want to write_.\n\n<break>\n\nThus, [Delve of the Handsome Repeater](https://casadeocio.itch.io/delve-of-the-handsome-repeater) was born. This is my _hat_ tossed into the ring of an ever-growing list of newer adventures.\n\nTo be honest: I find dungeons and dungeon crawls boring; mega dungeons _mega_ boring. So it's only fitting that my first published module (more or less) should be a dungeon ¯\\_(ツ)_/¯. I hoped writing one would open my eyes to the GLORRY THAT IS DUNGEON CRAWLING! Spoiler... it didn't.\n\nAnyway, here it is. It was fun to write and fun to play... I hope others find it enjoyable.\n",
    "html": "<p><a href=\"https://casadeocio.itch.io/delve-of-the-handsome-repeater\"><img src=\"assets/images/dothr-630x500.png\" alt=\"center\" /></a></p>\n<p>I like adventure modules. I especially like the newer ones… that are <em>actually</em> modular. Short, open-ended adventures that are trivial to drop into any campaign. Scanable; easy to grok. This is thankfully becoming the norm; fighting against the epic walls-of-text, and endless lore from modules of yore. This is what I want and what <em>I want to write</em>.</p>\n<p><break></p>\n<p>Thus, <a href=\"https://casadeocio.itch.io/delve-of-the-handsome-repeater\">Delve of the Handsome Repeater</a> was born. This is my <em>hat</em> tossed into the ring of an ever-growing list of newer adventures.</p>\n<p>To be honest: I find dungeons and dungeon crawls boring; mega dungeons <em>mega</em> boring. So it's only fitting that my first published module (more or less) should be a dungeon ¯_(ツ)_/¯. I hoped writing one would open my eyes to the GLORRY THAT IS DUNGEON CRAWLING! Spoiler… it didn't.</p>\n<p>Anyway, here it is. It was fun to write and fun to play… I hope others find it enjoyable.</p>"
  },
  {
    "meta": {
      "title": "Dybuk Letters",
      "date": "2024-7-29",
      "tags": "situations",
      "description": "a dybuk sits down to write a letter...",
      "slug": "dybuk_letters"
    },
    "markdown": "---\ntitle: Dybuk Letters\ndate: 2024-7-29\ntags: situations\ndescription: a dybuk sits down to write a letter...\n---\n\nA vengeful dybuk haunts the town that burned her at the stake. She flits unseen among the inhabitants, gleaning their darkest secrets, hidden weaknesses, and prized possessions. Periodically, she possesses unwitting townsfolk, compelling them to deliver letters to visiting adventurers; each a step towards her retribution. The possessed victims, once released, retain no memory of their actions.\n\nShe delivers such a letter to the PCs...\n\n<i>\nThe _\"respected\"_ magistrate, hides a bloody past behind his noble facade. He hoards ill-gotten wealth in a secret chamber beneath his study. The key around his neck opens the door behind the bookcase. Inside lies enough gold for multiple lifetimes and a ledger; evidence of his copious crimes. Leave the ledger on the steps of the town hall; keep the gold for yourselves. Justice and fortune await those with the courage to act.\n\nSincerely,<br>\nA Friend\n</i>",
    "html": "<p>A vengeful dybuk haunts the town that burned her at the stake. She flits unseen among the inhabitants, gleaning their darkest secrets, hidden weaknesses, and prized possessions. Periodically, she possesses unwitting townsfolk, compelling them to deliver letters to visiting adventurers; each a step towards her retribution. The possessed victims, once released, retain no memory of their actions.</p>\n<p>She delivers such a letter to the PCs…</p>\n<p><i>\nThe <em>\"respected\"</em> magistrate, hides a bloody past behind his noble facade. He hoards ill-gotten wealth in a secret chamber beneath his study. The key around his neck opens the door behind the bookcase. Inside lies enough gold for multiple lifetimes and a ledger; evidence of his copious crimes. Leave the ledger on the steps of the town hall; keep the gold for yourselves. Justice and fortune await those with the courage to act.</p>\n<p>Sincerely,<br>\nA Friend\n</i></p>"
  },
  {
    "meta": {
      "title": "FKR",
      "date": "2023-1-16",
      "description": "What the FKR?",
      "tags": "acronym",
      "slug": "fkr"
    },
    "markdown": "---\ntitle: FKR\ndate: 2023-1-16\ndescription: What the FKR?\ntags: acronym\n---\n\n**FKR** (Free Kriegsspiel Roleplaying) is an approach to playing tabletop roleplaying games. Its popular catchphrase, _\"play worlds not rules\"_ , is as reasonable as any catchphrase. Play requires the following:\n\n1. A shared understanding of a world.\n1. A Game Maestro trusted to represent \"the world\", and adjudicate player actions and their consequences.\n1. One or more players who control a character and play the world set before them.\n1. Play is a conversation. The GM describes a situation; the player describes what their character does. Outcomes are negotiated together and add to the emerging narrative.\n\nThat's it. Everything else is a preference for accomplishing these requirements. Some considerations:\n\n- **Rules** tend to be _lite_ but there is no \"correct\" amount. Rules should effectively be _\"invisible\"_ and not hinder play.\n- Roll **dice** when it makes sense or not at all.\n- There are no FKR **systems**. Any system _might_ be used in an FKR game. No system; a mashup of multiple systems; a coin flip... this is up to you and your table.\n",
    "html": "<p><strong>FKR</strong> (Free Kriegsspiel Roleplaying) is an approach to playing tabletop roleplaying games. Its popular catchphrase, <em>\"play worlds not rules\"</em> , is as reasonable as any catchphrase. Play requires the following:</p>\n<ol>\n<li>A shared understanding of a world.</li>\n<li>A Game Maestro trusted to represent \"the world\", and adjudicate player actions and their consequences.</li>\n<li>One or more players who control a character and play the world set before them.</li>\n<li>Play is a conversation. The GM describes a situation; the player describes what their character does. Outcomes are negotiated together and add to the emerging narrative.</li>\n</ol>\n<p>That's it. Everything else is a preference for accomplishing these requirements. Some considerations:</p>\n<ul>\n<li><strong>Rules</strong> tend to be <em>lite</em> but there is no \"correct\" amount. Rules should effectively be <em>\"invisible\"</em> and not hinder play.</li>\n<li>Roll <strong>dice</strong> when it makes sense or not at all.</li>\n<li>There are no FKR <strong>systems</strong>. Any system <em>might</em> be used in an FKR game. No system; a mashup of multiple systems; a coin flip… this is up to you and your table.</li>\n</ul>"
  },
  {
    "meta": {
      "title": "How To Hexcrawl",
      "date": "2023-7-8",
      "description": "Simple rules and procedures for running hexcrawl rpgs",
      "tags": "hexcrawl, hexy",
      "slug": "how_to_hexcrawl"
    },
    "markdown": "---\ntitle: How To Hexcrawl\ndate: 2023-7-8\ndescription: Simple rules and procedures for running hexcrawl rpgs\ntags: hexcrawl, hexy\n---\n_v1.1_\n\nHexcrawls are awesome! They changed my game forever. But I found existing rules complex and/or included needless abstraction. Thus, I wrote my own. I also [published a pdf](https://casadeocio.itch.io/hexcrawls-rule)\n\n### PROCEEDURES\n\n#### Morning\n\n1. Roll weather\n1. Consume food/water\n1. Break or sustain camp\n1. Choose a travel direction and pace\n1. Roll navigation\n\n#### Day\n\n1. GM describes points of interest (POIs)/changing weather/terrain/landmarks...\n1. Roll random encounters once per hex\n1. Roll navigation on direction change\n1. Exploring or hunting takes 1/2 day travel time\n1. Foraging can be done en route when not on roads but requires a slowed pace\n\n#### Night\n\n1. Make camp\n1. Consume food/water\n1. Stand watch\n1. Roll encounter\n\n\n### TRAVEL\n\nHexes are 6 miles. PCs can travel 3 hexes per day at a normal pace; 4 if moving quickly or mounted. Mountains or swamps slow the party to 1 hex per day. Pushing further risks fatigue.\n\n| Type                    | Distance/Time   |\n| :----                   |:---             |\n| Mapping                 | 1/2 hex per day |\n| Hunting                 | 1/2 day         |\n| Exploring               | 1/2 day         |\n| Travel swamp/mountains  | 1 hex per day   |\n| Travel normal           | 3 hexes per day |\n| Travel forced/mounted   | 4 hexes per day |\n\n<break>\n\n#### Weather\n\nRoll 2d6: the leftmost die is type of weather, the other severity.\n\n| Weather             | Severity  |\n| :----               |:---       |\n| 1. Rain/fog/snow    | 1. Epic   |\n| 2. Storm            | 2. Severe |\n| 3. Wind             | 3. Harsh  |\n| 4. Unusual Hot/cold | 4. Moderate|\n| 5. Cloudy           | 5. Mild  |\n| 6. Clear            | 6. Pleasant |\n\n\n#### Navigation\n\nSkip navigation rolls when following a road/river/compass/spell/landmark on clear day.\n\n| D6    | Effect|\n| :---- |:---   |\n| 1     | Loop back to point of departure           |\n| 2-3   | Veer one sextant left of intended destination |\n| 4-5   | Veer one sextant right of intended destination|\n| 6     | Arrive at intended destination            |\n\n\n#### Discovery\n\nPCs discover POIs in the sextants they traverse. Eg. if the party is traveling NW through a hex and there's a POI in sextants 2 or 5, they should discover it.\n\n<pre>\n    _6_\n  5/   \\1\n  4\\___/2\n     3\n</pre>\n\nPOIs might also be discovered if the PCs:\n\n- See smoke/light/landmark\n- Hear noises\n- Smell something\n- Observe evidence of it\n- Explore the sextant\n\n> PCs can see 3 miles of flat terrain and 1 hex per 50' of elevation (tree/hill/cliff)\n\n#### Fatigue\n\nPCs risk fatigue from lack sleep/food/water, forced travel, heavy burden, miserable conditions or injury. Consuming food/water and resting a day in comfort and safety cures fatigue.\n\n| Level | Effect                    |\n| :---- |:---                       |\n| 1     | Disadvantaged skill rolls |\n| 2     | Speed halved              |\n| 3     | Disadvantaged attacks     |\n| 4     | Drop all bulky items      |\n| 5     | Speed = 0                 |\n| 6     | Death                     |\n\n",
    "html": "<p><em>v1.1</em></p>\n<p>Hexcrawls are awesome! They changed my game forever. But I found existing rules complex and/or included needless abstraction. Thus, I wrote my own. I also <a href=\"https://casadeocio.itch.io/hexcrawls-rule\">published a pdf</a></p>\n<h3 id=\"proceedures\">PROCEEDURES</h3>\n<h4 id=\"morning\">Morning</h4>\n<ol>\n<li>Roll weather</li>\n<li>Consume food/water</li>\n<li>Break or sustain camp</li>\n<li>Choose a travel direction and pace</li>\n<li>Roll navigation</li>\n</ol>\n<h4 id=\"day\">Day</h4>\n<ol>\n<li>GM describes points of interest (POIs)/changing weather/terrain/landmarks…</li>\n<li>Roll random encounters once per hex</li>\n<li>Roll navigation on direction change</li>\n<li>Exploring or hunting takes 1/2 day travel time</li>\n<li>Foraging can be done en route when not on roads but requires a slowed pace</li>\n</ol>\n<h4 id=\"night\">Night</h4>\n<ol>\n<li>Make camp</li>\n<li>Consume food/water</li>\n<li>Stand watch</li>\n<li>Roll encounter</li>\n</ol>\n<h3 id=\"travel\">TRAVEL</h3>\n<p>Hexes are 6 miles. PCs can travel 3 hexes per day at a normal pace; 4 if moving quickly or mounted. Mountains or swamps slow the party to 1 hex per day. Pushing further risks fatigue.</p>\n<table>\n<thead>\n<tr>\n<th id=\"type\" style=\"text-align:left;\">Type</th>\n<th id=\"distance/time\" style=\"text-align:left;\">Distance/Time</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left;\">Mapping</td>\n<td style=\"text-align:left;\">1/2 hex per day</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">Hunting</td>\n<td style=\"text-align:left;\">1/2 day</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">Exploring</td>\n<td style=\"text-align:left;\">1/2 day</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">Travel swamp/mountains</td>\n<td style=\"text-align:left;\">1 hex per day</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">Travel normal</td>\n<td style=\"text-align:left;\">3 hexes per day</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">Travel forced/mounted</td>\n<td style=\"text-align:left;\">4 hexes per day</td>\n</tr>\n</tbody>\n</table>\n<p><break></p>\n<h4 id=\"weather\">Weather</h4>\n<p>Roll 2d6: the leftmost die is type of weather, the other severity.</p>\n<table>\n<thead>\n<tr>\n<th id=\"weather\" style=\"text-align:left;\">Weather</th>\n<th id=\"severity\" style=\"text-align:left;\">Severity</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left;\">1. Rain/fog/snow</td>\n<td style=\"text-align:left;\">1. Epic</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">2. Storm</td>\n<td style=\"text-align:left;\">2. Severe</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">3. Wind</td>\n<td style=\"text-align:left;\">3. Harsh</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">4. Unusual Hot/cold</td>\n<td style=\"text-align:left;\">4. Moderate</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">5. Cloudy</td>\n<td style=\"text-align:left;\">5. Mild</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">6. Clear</td>\n<td style=\"text-align:left;\">6. Pleasant</td>\n</tr>\n</tbody>\n</table>\n<h4 id=\"navigation\">Navigation</h4>\n<p>Skip navigation rolls when following a road/river/compass/spell/landmark on clear day.</p>\n<table>\n<thead>\n<tr>\n<th id=\"d6\" style=\"text-align:left;\">D6</th>\n<th id=\"effect\" style=\"text-align:left;\">Effect</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left;\">1</td>\n<td style=\"text-align:left;\">Loop back to point of departure</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">2-3</td>\n<td style=\"text-align:left;\">Veer one sextant left of intended destination</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">4-5</td>\n<td style=\"text-align:left;\">Veer one sextant right of intended destination</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">6</td>\n<td style=\"text-align:left;\">Arrive at intended destination</td>\n</tr>\n</tbody>\n</table>\n<h4 id=\"discovery\">Discovery</h4>\n<p>PCs discover POIs in the sextants they traverse. Eg. if the party is traveling NW through a hex and there's a POI in sextants 2 or 5, they should discover it.</p>\n<pre>\n    _6_\n  5/   \\1\n  4\\___/2\n     3\n</pre>\n<p>POIs might also be discovered if the PCs:</p>\n<ul>\n<li>See smoke/light/landmark</li>\n<li>Hear noises</li>\n<li>Smell something</li>\n<li>Observe evidence of it</li>\n<li>Explore the sextant</li>\n</ul>\n<blockquote>\n  <p>PCs can see 3 miles of flat terrain and 1 hex per 50' of elevation (tree/hill/cliff)</p>\n</blockquote>\n<h4 id=\"fatigue\">Fatigue</h4>\n<p>PCs risk fatigue from lack sleep/food/water, forced travel, heavy burden, miserable conditions or injury. Consuming food/water and resting a day in comfort and safety cures fatigue.</p>\n<table>\n<thead>\n<tr>\n<th id=\"level\" style=\"text-align:left;\">Level</th>\n<th id=\"effect\" style=\"text-align:left;\">Effect</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left;\">1</td>\n<td style=\"text-align:left;\">Disadvantaged skill rolls</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">2</td>\n<td style=\"text-align:left;\">Speed halved</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">3</td>\n<td style=\"text-align:left;\">Disadvantaged attacks</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">4</td>\n<td style=\"text-align:left;\">Drop all bulky items</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">5</td>\n<td style=\"text-align:left;\">Speed = 0</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">6</td>\n<td style=\"text-align:left;\">Death</td>\n</tr>\n</tbody>\n</table>"
  },
  {
    "meta": {
      "title": "I Published a Thing",
      "date": "2021-12-4",
      "description": "We hack because we care; we publish because we hack?",
      "tags": "my_stuff, bnb, game_design",
      "slug": "i_published_a_thing"
    },
    "markdown": "---\ntitle: I Published a Thing\ndate: 2021-12-4\ndescription: We hack because we care; we publish because we hack?\ntags: my_stuff, bnb, game_design\n---\n\n[![center](assets/images/bnb-630x500.png)](https://casadeocio.itch.io/beasts-barrows)\n\nI didn't set out to write a system... I swear. It just _happened_.\n\nHere's how it goes:\n1. run a oneshot to play around with [World of Dungeons](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf)\n2. the players; the system; the characters... they all click and it's fun\n3. a campaign begins!\n4. during your campaign, start hacking bits of the system to the tastes of yourself and your players\n<break>\n5. players don't like the magic system? [write your own](/#post?s=a_magic_system)\n6. hack even more stuff in the second year of your campaign\n7. struggle to explain all the hacks to new players\n8. write it all down\n9. fine... I'll publish it 🙄\n\n**NOTE:** _there's no `10. profit`\n\n\nPersonally, I wish people would publish fewer systems and publish more adventures. But here I am.... publishing a system. But it's funny with systems: they're _personal_. **Finding a system that suits your style and hacking off the bits that get in the way should be second nature to a GM**. Continue hacking to the point where it requires a new telling of the rules? Congratulations! You're now a publisher.\n\nI _do_ plan on writing & publishing adventures. Time will tell what other little distractions I'll encounter along the way.\n\nStay tuned...",
    "html": "<p><a href=\"https://casadeocio.itch.io/beasts-barrows\"><img src=\"assets/images/bnb-630x500.png\" alt=\"center\" /></a></p>\n<p>I didn't set out to write a system… I swear. It just <em>happened</em>.</p>\n<p>Here's how it goes:</p>\n<ol>\n<li>run a oneshot to play around with <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons</a></li>\n<li>the players; the system; the characters… they all click and it's fun</li>\n<li>a campaign begins!</li>\n<li>during your campaign, start hacking bits of the system to the tastes of yourself and your players\n<break></li>\n<li>players don't like the magic system? <a href=\"/#post?s=a_magic_system\">write your own</a></li>\n<li>hack even more stuff in the second year of your campaign</li>\n<li>struggle to explain all the hacks to new players</li>\n<li>write it all down</li>\n<li>fine… I'll publish it 🙄</li>\n</ol>\n<p><strong>NOTE:</strong> _there's no <code>10. profit</code></p>\n<p>Personally, I wish people would publish fewer systems and publish more adventures. But here I am…. publishing a system. But it's funny with systems: they're <em>personal</em>. <strong>Finding a system that suits your style and hacking off the bits that get in the way should be second nature to a GM</strong>. Continue hacking to the point where it requires a new telling of the rules? Congratulations! You're now a publisher.</p>\n<p>I <em>do</em> plan on writing &amp; publishing adventures. Time will tell what other little distractions I'll encounter along the way.</p>\n<p>Stay tuned…</p>"
  },
  {
    "meta": {
      "title": "Incarnates",
      "date": "2024-1-31",
      "tags": "words",
      "slug": "incarnates"
    },
    "markdown": "---\ntitle: Incarnates\ndate: 2024-1-31\ndescription:\ntags: words\n---\n\nAt any one time, there are exactly 42 Incarnates in the world; give or take 9 months. I suppose it depends if being in the womb is considered _in the world_. I've been in a womb 100 times; I say it counts.\n\nBirth for an Incarnate--a silly moniker we begrudgingly accept--is really no different than mortal birth: pain and crying. But also love; a lot of it. I've had 100 mothers, most of which loved me. Given time, I can remember many of their names and some of their faces. These memories--or lack thereof--are an indication of their impact upon me or maybe just how long it's been. The past and present can be such a blur.\n\nAll of us go mad from time to time. I have; in only my 3rd life. Other times too but madness, like memory, fades.\n\nWork keeps me going and by work I mean whatever idea takes hold in the little brain I currently occupy. Some of this \"work\" takes multiple lives to complete. I once spent 4 lives just to ensure the marriage of two bloodlines. One of those lost lives was by my own hand but that's a story for another time; perhaps another lifetime.\n\nIn truth, death is rarely that interesting. More often it's actually _funny_; hilarious even. Swapping death stories is a big hit among my brethren and sistren. But birth; now that is a wild fucking ride. See, in the womb, we're like little beacons, calling out to one of our own. With each Incarnate birth, one of us is summoned--for lack of a better word. A nagging feeling _insisting_ you be in a specific location, at a specific time--about nine months. You just... feel it. It can be quite comforting in a way; knowing something with such certainty. You can live 100 lifetimes and not know anything for certain. Sorry, _Incarnate humor_.\n\nAnd sometimes, because reasons, the summoned one fails to arrive and little baby Incarnate is on their own. This has happened to me more than once. It sucks. Because until we can talk--and more specifically, perform magic--we are vulnerable.\n\nLucky for me, on this, on the auspicious occasion of my 100th life, Amara was summoned. I hadn't seen her for a number of lifetimes. She hadn't change a bit--sorry, more Incarnate humor.\n\n~ _Eldar (currently Gareth Summerfield)_",
    "html": "<p>At any one time, there are exactly 42 Incarnates in the world; give or take 9 months. I suppose it depends if being in the womb is considered <em>in the world</em>. I've been in a womb 100 times; I say it counts.</p>\n<p>Birth for an Incarnate--a silly moniker we begrudgingly accept--is really no different than mortal birth: pain and crying. But also love; a lot of it. I've had 100 mothers, most of which loved me. Given time, I can remember many of their names and some of their faces. These memories--or lack thereof--are an indication of their impact upon me or maybe just how long it's been. The past and present can be such a blur.</p>\n<p>All of us go mad from time to time. I have; in only my 3rd life. Other times too but madness, like memory, fades.</p>\n<p>Work keeps me going and by work I mean whatever idea takes hold in the little brain I currently occupy. Some of this \"work\" takes multiple lives to complete. I once spent 4 lives just to ensure the marriage of two bloodlines. One of those lost lives was by my own hand but that's a story for another time; perhaps another lifetime.</p>\n<p>In truth, death is rarely that interesting. More often it's actually <em>funny</em>; hilarious even. Swapping death stories is a big hit among my brethren and sistren. But birth; now that is a wild fucking ride. See, in the womb, we're like little beacons, calling out to one of our own. With each Incarnate birth, one of us is summoned--for lack of a better word. A nagging feeling <em>insisting</em> you be in a specific location, at a specific time--about nine months. You just… feel it. It can be quite comforting in a way; knowing something with such certainty. You can live 100 lifetimes and not know anything for certain. Sorry, <em>Incarnate humor</em>.</p>\n<p>And sometimes, because reasons, the summoned one fails to arrive and little baby Incarnate is on their own. This has happened to me more than once. It sucks. Because until we can talk--and more specifically, perform magic--we are vulnerable.</p>\n<p>Lucky for me, on this, on the auspicious occasion of my 100th life, Amara was summoned. I hadn't seen her for a number of lifetimes. She hadn't change a bit--sorry, more Incarnate humor.</p>\n<p>~ <em>Eldar (currently Gareth Summerfield)</em></p>"
  },
  {
    "meta": {
      "title": "On Magical Magic",
      "date": "2024-2-13",
      "tags": "magic, oyab",
      "description": "My ongoing search for a magic system that feels _magical_...",
      "slug": "on_magical_magic"
    },
    "markdown": "---\ntitle: On Magical Magic\ndate: 2024-2-13\ntags: magic, oyab\ndescription: My ongoing search for a magic system that feels _magical_...\n---\n\n_From the memoirs of Rown Varkana - Mage, Council of Six @Yagul Fane..._\n\nI have no skill with quill or ink, but my wife insists I write. _\"Who should know of you if you don't?\"_, she says. _\"I am a mage on the Council of Six\"_, I reply! I neglect to tell her I've spent the better part of an hour trying to get this quill to abide my commands and write for me. Alas, and more time still cleaning up the mess. This empty page vexes me.\n\nI suppose the place to start is at the beginning. Fine. What is magic? It's quite simple really: the world is full of magic things and a mage communes with the world. Air, tree, stone, ocean, star; all allies of the mage. With proper knowledge, a mage may petition the world for indulgence; favors if you like. Given their relationship is in good standing, the world is likely to comply.\n\nMagi are born with this gift but it requires development. Some learn spells from tomes and scrolls while others may intuit them. But this development takes time. The Fae, with their long lives, are the most knowledgeable in magic. They enjoy the deepest bonds with the world. If their magic has boundaries, they are unknown to me but with long life comes madness. Pity the mage that must bargain with a Fae; it's like treading on shifting sands.\n\nThe world has a mind of its own and so too does magic. One rolls the dice when casting a spell [`2d6`]. A mage may tip the scales, so to speak, but at a cost. Balance will be restored one way or the other. For example, a mage feeling their spell failing may accept a `Burden` [represented by a `tarot card`], and have it succeed instead. The path to satisfying this burden is anyone's guess. A mage can only endure so many [`3 max`] before they become lost in the world.\n\n`Promises`--the simplest spells--wield significant potential in the hands of a cunning mage. Often dismissed as \"cheap tricks,\" their ephemeral quality leaves no lasting impression on the world. Yet, they signify an unspoken agreement; a remnant from the bond between mage and world.\n\nAdvanced spells demand a `Totem`—a physical representation of the intended outcome. While a totem should ideally resonate with the desired effect, substitutions are possible. Salt is renowned for its ability to ward off malevolent energies. However, alternatives like chalk or even ground coffee may serve adequately.\n\nFurthermore, `Enhancement Spells`, woven in tandem with a primary spell, can amplify potency, duration, or scope. While they enhance the spell's efficacy, they take time and compound the risks of casting.\n\n`Rituals` are the pinnacle of magical prowess. They yield unparalleled power but demand patience and dedication. Alternatively, one might venture into the perilous realm of Summoning. But bargaining with a Fae comes with great risk and success is far from guaranteed.\n\n_~ R_",
    "html": "<p><em>From the memoirs of Rown Varkana - Mage, Council of Six @Yagul Fane…</em></p>\n<p>I have no skill with quill or ink, but my wife insists I write. <em>\"Who should know of you if you don't?\"</em>, she says. <em>\"I am a mage on the Council of Six\"</em>, I reply! I neglect to tell her I've spent the better part of an hour trying to get this quill to abide my commands and write for me. Alas, and more time still cleaning up the mess. This empty page vexes me.</p>\n<p>I suppose the place to start is at the beginning. Fine. What is magic? It's quite simple really: the world is full of magic things and a mage communes with the world. Air, tree, stone, ocean, star; all allies of the mage. With proper knowledge, a mage may petition the world for indulgence; favors if you like. Given their relationship is in good standing, the world is likely to comply.</p>\n<p>Magi are born with this gift but it requires development. Some learn spells from tomes and scrolls while others may intuit them. But this development takes time. The Fae, with their long lives, are the most knowledgeable in magic. They enjoy the deepest bonds with the world. If their magic has boundaries, they are unknown to me but with long life comes madness. Pity the mage that must bargain with a Fae; it's like treading on shifting sands.</p>\n<p>The world has a mind of its own and so too does magic. One rolls the dice when casting a spell [<code>2d6</code>]. A mage may tip the scales, so to speak, but at a cost. Balance will be restored one way or the other. For example, a mage feeling their spell failing may accept a <code>Burden</code> [represented by a <code>tarot card</code>], and have it succeed instead. The path to satisfying this burden is anyone's guess. A mage can only endure so many [<code>3 max</code>] before they become lost in the world.</p>\n<p><code>Promises</code>--the simplest spells--wield significant potential in the hands of a cunning mage. Often dismissed as \"cheap tricks,\" their ephemeral quality leaves no lasting impression on the world. Yet, they signify an unspoken agreement; a remnant from the bond between mage and world.</p>\n<p>Advanced spells demand a <code>Totem</code>—a physical representation of the intended outcome. While a totem should ideally resonate with the desired effect, substitutions are possible. Salt is renowned for its ability to ward off malevolent energies. However, alternatives like chalk or even ground coffee may serve adequately.</p>\n<p>Furthermore, <code>Enhancement Spells</code>, woven in tandem with a primary spell, can amplify potency, duration, or scope. While they enhance the spell's efficacy, they take time and compound the risks of casting.</p>\n<p><code>Rituals</code> are the pinnacle of magical prowess. They yield unparalleled power but demand patience and dedication. Alternatively, one might venture into the perilous realm of Summoning. But bargaining with a Fae comes with great risk and success is far from guaranteed.</p>\n<p><em>~ R</em></p>"
  },
  {
    "meta": {
      "title": "On Vancian Magic",
      "date": "2021-12-28",
      "description": "Some twists to make Vancian magic more palatable",
      "tags": "words, bnb, rules, magic",
      "slug": "on_vancian_magic"
    },
    "markdown": "---\ntitle: On Vancian Magic\ndate: 2021-12-28\ndescription: Some twists to make Vancian magic more palatable\ntags: words, bnb, rules, magic\n---\n\nWhen writing my [magic system](#post?s=a_magic_system) for [Beasts & Barrows](https://casadeocio.itch.io/beasts-barrows), I had two goals: keep it simple and _somewhat_ logical. Towards simplicity, I reused the existing game mechanics: `2d6`, `attributes` and `level`. I also considered using Necropraxis' fabulous [spell dice](https://www.necropraxis.com/2013/11/01/spell-dice) but simplicity won out.\n\nMaking the system logical took a lot more thought.\n\nSeveral people describe my magic system as _Vancian_ (ie. spells must be prepared daily; have a fixed purpose and finite usage). **I did not set out to make my system specifically _non-Vancian_**. This is good because when I think about it, it really is quite Vancian... but with _twists._\n\n<break>\n\nFirst twist: preparation. It's silly to expect magi to prepare spells every day. It _does_ make sense that spells are learned, practiced and _mastered_. We see this in Harry Potter; the kids all practicing enunciation and wand flicking. But this leans more toward _practice_ than preparation. It's also logical that magi have a limited number of spells they've _mastered_. This number increases as their experience increases. **I want players thinking of creative ways to use the spells they have**.\n\n_Spellbooks_. What dolt-of-a-mage cannot memorize a few spells? Must they write them all down in a book? If they're without that book, can they no longer cast a spell? Lame. No. But books _are_ quite useful. **Magi can read and cast _unfamiliar_ spells from scrolls and books**, but it takes more time (a turn). It also incentivizes _scroll hunts_. Fun!\n\nWhich leads us to usage. It's ridiculous that a mage would forget a spell after casting it. Same goes for it vanishing from their spellbook. No. That's crazytown. The twist here is that casting spells takes a physical toll. A mage can safely cast spells, based on their stamina (`con`), and have it scale with their experience (`hd`). This could have also been level but I feel like `hd` is a bit closer to health... same diff. **Cast all the spells you want... but it will eventually hurt**.\n\nLastly, we have _spells with a fixed purpose_. Spell authors will have a lot to say about this. But a few twists can keep them simple and allow for more creative usage. I love **levelless spells**. I can see an argument that spell level denotes complexity or whatever... but I prefer to let a mage learn whatever spell they like. I also added [enhancement spells](#spellTags?t=enhancement). Spells that enhance a target spell but cost an extra spell slot. This helps keep spells simple and flexible.",
    "html": "<p>When writing my <a href=\"#post?s=a_magic_system\">magic system</a> for <a href=\"https://casadeocio.itch.io/beasts-barrows\">Beasts & Barrows</a>, I had two goals: keep it simple and <em>somewhat</em> logical. Towards simplicity, I reused the existing game mechanics: <code>2d6</code>, <code>attributes</code> and <code>level</code>. I also considered using Necropraxis' fabulous <a href=\"https://www.necropraxis.com/2013/11/01/spell-dice\">spell dice</a> but simplicity won out.</p>\n<p>Making the system logical took a lot more thought.</p>\n<p>Several people describe my magic system as <em>Vancian</em> (ie. spells must be prepared daily; have a fixed purpose and finite usage). <strong>I did not set out to make my system specifically <em>non-Vancian</em></strong>. This is good because when I think about it, it really is quite Vancian… but with <em>twists.</em></p>\n<p><break></p>\n<p>First twist: preparation. It's silly to expect magi to prepare spells every day. It <em>does</em> make sense that spells are learned, practiced and <em>mastered</em>. We see this in Harry Potter; the kids all practicing enunciation and wand flicking. But this leans more toward <em>practice</em> than preparation. It's also logical that magi have a limited number of spells they've <em>mastered</em>. This number increases as their experience increases. <strong>I want players thinking of creative ways to use the spells they have</strong>.</p>\n<p><em>Spellbooks</em>. What dolt-of-a-mage cannot memorize a few spells? Must they write them all down in a book? If they're without that book, can they no longer cast a spell? Lame. No. But books <em>are</em> quite useful. <strong>Magi can read and cast <em>unfamiliar</em> spells from scrolls and books</strong>, but it takes more time (a turn). It also incentivizes <em>scroll hunts</em>. Fun!</p>\n<p>Which leads us to usage. It's ridiculous that a mage would forget a spell after casting it. Same goes for it vanishing from their spellbook. No. That's crazytown. The twist here is that casting spells takes a physical toll. A mage can safely cast spells, based on their stamina (<code>con</code>), and have it scale with their experience (<code>hd</code>). This could have also been level but I feel like <code>hd</code> is a bit closer to health… same diff. <strong>Cast all the spells you want… but it will eventually hurt</strong>.</p>\n<p>Lastly, we have <em>spells with a fixed purpose</em>. Spell authors will have a lot to say about this. But a few twists can keep them simple and allow for more creative usage. I love <strong>levelless spells</strong>. I can see an argument that spell level denotes complexity or whatever… but I prefer to let a mage learn whatever spell they like. I also added <a href=\"#spellTags?t=enhancement\">enhancement spells</a>. Spells that enhance a target spell but cost an extra spell slot. This helps keep spells simple and flexible.</p>"
  },
  {
    "meta": {
      "title": "Rando - An Imagination Spark Generator",
      "date": "2024-1-11",
      "description": "A single page",
      "tags": "rando, tools",
      "slug": "rando-an_imagination_spark_generator"
    },
    "markdown": "---\ntitle: Rando - An Imagination Spark Generator\ndate: 2024-1-11\ndescription: A single page\ntags: rando, tools\n---\n\nI love me some random generators but mine were showing my neglect and kinda all over the place. My friend [Wightbred](https://wightbred.itch.io/) turned me onto [GM's Apprentice Cards](https://www.drivethrurpg.com/product/125685/The-GameMasters-Apprentice-Base-Deck), which inspired me to refactor and extend my own generators into a single web app. Thus, [Rando](https://rando.brine.dev) was born.\n\nThanks to feedback from Wightbred and others, I've been able to turn Rando into a surprisingly useful tool. I was able to incorporate all the things I use for my games. I now find myself using it for everything: prep, GM & Player prompts and even prompts to feed ChatGPT. And while I do not _solo [new verb]_ myself, I am told that it works well for Solo Play too.\n\nGive it a spin!\n\n[![center](assets/images/rando.webp)](https://rando.brine.dev)\n",
    "html": "<p>I love me some random generators but mine were showing my neglect and kinda all over the place. My friend <a href=\"https://wightbred.itch.io/\">Wightbred</a> turned me onto <a href=\"https://www.drivethrurpg.com/product/125685/The-GameMasters-Apprentice-Base-Deck\">GM's Apprentice Cards</a>, which inspired me to refactor and extend my own generators into a single web app. Thus, <a href=\"https://rando.brine.dev\">Rando</a> was born.</p>\n<p>Thanks to feedback from Wightbred and others, I've been able to turn Rando into a surprisingly useful tool. I was able to incorporate all the things I use for my games. I now find myself using it for everything: prep, GM &amp; Player prompts and even prompts to feed ChatGPT. And while I do not <em>solo [new verb]</em> myself, I am told that it works well for Solo Play too.</p>\n<p>Give it a spin!</p>\n<p><a href=\"https://rando.brine.dev\"><img src=\"assets/images/rando.webp\" alt=\"center\" /></a></p>"
  },
  {
    "meta": {
      "title": "Skills and Special Abilities",
      "date": "2021-7-25",
      "description": "A list of skills and special abilities that we use in World of Brine; based on World of Dungeon rules. ",
      "tags": "wodu, rules",
      "slug": "skills_and_special_abilities"
    },
    "markdown": "---\ntitle: Skills and Special Abilities\ndate: 2021-7-25\ndescription: A list of skills and special abilities that we use in World of Brine; based on World of Dungeon rules. \ntags: wodu, rules\n---\n\n_v 1.3_\n\nIn [World of Dungeons](http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf), `Skills and Special Abilities` help define a character's class. They map directly to the classic classes: **Cleric, Fighter, Mage, Ranger & Thief**; but they can also be bent to accommodate custom classes... like [Alchemist](assets/images/chars/benedict_sandaries.pdf) or [Road Agent](assets/images/chars/black_jenny.pdf). The following details how these rules have evolved in my games.\n\n<break>\n\n### Skills\n> When a PC attempts something in the fiction that might be covered by a skill (eg. Athletics when climbing) they can roll _advantage_ (`3d6` & keep the highest 2) `+ mod` instead of a regular roll.\n\n- **Athletics:** `+str/dex`: feats of strength and dexterity\n- **Awareness:** `+wis`: perceiving the environment around you\n- **Deception:** `+cha`: attempt to deceive\n- **Decipher:** `+wis`: discern a thing; attempt to understand or interpret\n- **Heal:** `+wis`: provide an extra `hd` to the party when resting/rolling `hp`; heal `1d6+level hp` with your touch.\n- **Leadership:** `+cha`: use leverage to influence someone; diplomacy; intimidate; parley\n- **Lore:** `+int`: consult your accumulated knowledge about something\n- **Stealth:** `+dex`: attempt to be sneaky\n- **Survival:** `+con`: foraging, hunting; start a fire in unfavorable conditions, etc\n\n\n### Special Abilities\n> These abilities can add additional flavor to a class. The word `attempt` will generally signify rolling a `2d6+mod` when applicable.\n\n- **Backstab:** +3 damage from concealment\n- **Bless:** anoint items with holy water for +/-3 damage and as magical\n- **[Cantrips](https://brine.dev/#spellTags?t=cantrip):** cast 3 simple magical spells\n- **Command:** attempt to command any spirit, demon, etc.\n- **Cure:** attempt to neutralize poisons or remove curses\n- **Hardy:** +6 hp\n- **Lucky:** turn a miss into a partial success once per day\n- **Pet:** you have a loyal and _effective_ animal companion\n- **Reflexes:** you always act first and cannot be surprised\n- **Ritual:** attempt occult rituals; detailed in ancient tomes and scrolls\n- **Scout:** with you on point, your party can move quicker, cover more ground and spot targets before they spot you\n- **Skirmish:** +1 damage; worn armor counts as one type lighter\n- **Slay:** +2 melee damage\n- **Summon:** summon a spirit you know by its true name\n- **Tinker:** pick a lock, pocket or trap w/ tools\n- **Tough:** +1 armor\n- **Turn:** attempt to hold undead at bay with your faith and holy symbol\n- **Vision:** commune with your deity or demon via holy water/drugs\n- **Volley:** +2 ranged damage\n- **Wild:** converse with and attempt to command animals; some classes (eg. Druids) use this to _shapeshift_\n",
    "html": "<p><em>v 1.3</em></p>\n<p>In <a href=\"http://www.onesevendesign.com/dw/world_of_dungeons_1979.pdf\">World of Dungeons</a>, <code>Skills and Special Abilities</code> help define a character's class. They map directly to the classic classes: <strong>Cleric, Fighter, Mage, Ranger & Thief</strong>; but they can also be bent to accommodate custom classes… like <a href=\"assets/images/chars/benedict_sandaries.pdf\">Alchemist</a> or <a href=\"assets/images/chars/black_jenny.pdf\">Road Agent</a>. The following details how these rules have evolved in my games.</p>\n<p><break></p>\n<h3 id=\"skills\">Skills</h3>\n<blockquote>\n  <p>When a PC attempts something in the fiction that might be covered by a skill (eg. Athletics when climbing) they can roll <em>advantage</em> (<code>3d6</code> &amp; keep the highest 2) <code>+ mod</code> instead of a regular roll.</p>\n</blockquote>\n<ul>\n<li><strong>Athletics:</strong> <code>+str/dex</code>: feats of strength and dexterity</li>\n<li><strong>Awareness:</strong> <code>+wis</code>: perceiving the environment around you</li>\n<li><strong>Deception:</strong> <code>+cha</code>: attempt to deceive</li>\n<li><strong>Decipher:</strong> <code>+wis</code>: discern a thing; attempt to understand or interpret</li>\n<li><strong>Heal:</strong> <code>+wis</code>: provide an extra <code>hd</code> to the party when resting/rolling <code>hp</code>; heal <code>1d6+level hp</code> with your touch.</li>\n<li><strong>Leadership:</strong> <code>+cha</code>: use leverage to influence someone; diplomacy; intimidate; parley</li>\n<li><strong>Lore:</strong> <code>+int</code>: consult your accumulated knowledge about something</li>\n<li><strong>Stealth:</strong> <code>+dex</code>: attempt to be sneaky</li>\n<li><strong>Survival:</strong> <code>+con</code>: foraging, hunting; start a fire in unfavorable conditions, etc</li>\n</ul>\n<h3 id=\"specialabilities\">Special Abilities</h3>\n<blockquote>\n  <p>These abilities can add additional flavor to a class. The word <code>attempt</code> will generally signify rolling a <code>2d6+mod</code> when applicable.</p>\n</blockquote>\n<ul>\n<li><strong>Backstab:</strong> +3 damage from concealment</li>\n<li><strong>Bless:</strong> anoint items with holy water for +/-3 damage and as magical</li>\n<li><strong><a href=\"https://brine.dev/#spellTags?t=cantrip\">Cantrips</a>:</strong> cast 3 simple magical spells</li>\n<li><strong>Command:</strong> attempt to command any spirit, demon, etc.</li>\n<li><strong>Cure:</strong> attempt to neutralize poisons or remove curses</li>\n<li><strong>Hardy:</strong> +6 hp</li>\n<li><strong>Lucky:</strong> turn a miss into a partial success once per day</li>\n<li><strong>Pet:</strong> you have a loyal and <em>effective</em> animal companion</li>\n<li><strong>Reflexes:</strong> you always act first and cannot be surprised</li>\n<li><strong>Ritual:</strong> attempt occult rituals; detailed in ancient tomes and scrolls</li>\n<li><strong>Scout:</strong> with you on point, your party can move quicker, cover more ground and spot targets before they spot you</li>\n<li><strong>Skirmish:</strong> +1 damage; worn armor counts as one type lighter</li>\n<li><strong>Slay:</strong> +2 melee damage</li>\n<li><strong>Summon:</strong> summon a spirit you know by its true name</li>\n<li><strong>Tinker:</strong> pick a lock, pocket or trap w/ tools</li>\n<li><strong>Tough:</strong> +1 armor</li>\n<li><strong>Turn:</strong> attempt to hold undead at bay with your faith and holy symbol</li>\n<li><strong>Vision:</strong> commune with your deity or demon via holy water/drugs</li>\n<li><strong>Volley:</strong> +2 ranged damage</li>\n<li><strong>Wild:</strong> converse with and attempt to command animals; some classes (eg. Druids) use this to <em>shapeshift</em></li>\n</ul>"
  },
  {
    "meta": {
      "title": "Southern Coast",
      "date": "2024-3-18",
      "description": "A wilderness hexcrawl adventure",
      "tags": "hexcrawl, hexy, adventures, sandbox, soco",
      "slug": "southern_coast"
    },
    "markdown": "---\ntitle: Southern Coast\ndate: 2024-3-18\ndescription: A wilderness hexcrawl adventure\ntags: hexcrawl, hexy, adventures, sandbox, soco\n---\n\n**The Southern Coast**, in contrast to its harsh landscape, boasts a temperate climate accentuated by gentle sea breezes and occasional coastal fog. Passage to the northern kingdoms is best by sea; avoiding the formidable barriers of the Sorrow Mountains and West Marshes. The region was originally a druidic sanctuary, until the Northern Kings, seeking a remote location for their most dangerous criminals, commissioned the construction of a prison; or as they put it, _\"a place to throw our trash\"_. Recognizing the need for magical restraints, they enlisted the expertise of renowned magi Naz Yagul and Uma Fane. Additionally, missionaries were funded to provide support for the prison's operation and potentially convert the remaining druids.\n\nWith these pillars of civilization established, the Southern Coast has begun to attract adventurous individuals seeking to make it their home.\n\n\n### WHAT IS THIS?\n\nThe Southern Coast is a system neutral, regional setting designed for sandbox exploration and adventure. Details are intentionally vague in order to accommodate YOUR campaign. It is intended to be serviceable as-is while providing just enough flavor to spark imagination. GMs are encouraged to add or ignore content to suit their table.\n\n\n### SITUATIONS\n\n1. Loggers in the Starwoods have been attacked by a creature they claim is a wendigo. They've sent a desperate plea to the Monastery for aid.\n1. The Crown's Fury, a ship lost in the Battle of Mistwood, was _busting_ with silver and other treasures when it sank. The rumors of a \"ghost ship\" seen off the coast are well established but an eye witness swears that it's The Crown's Fury.\n1. A local herbalist seeks brave adventurers to retrieve herbs that grow deep within the West Marshes, promising silver and potent potions as reward.\n1. An infamous game hunter, and friend to the Northern Kings, will pay handsomely for help finding/tracking/killing a wendigo.\n1. The PCs are escorting a prisoner to the Prison of Mon\n1. A Duke's son found a treasure map leading to the Isle of Wight and has not been heard from for a week.\n\n\n### 2D6 RUMORS\n\n2. The Isle of Wights is aptly named. It's overrun with wights looking to add to their number. Nobody comes back from that retched place.\n1. Some crazy druid up in the mountains has got himself a harem and is performing miracles!\n1. Yagul Fane is built atop an ancient city with unimaginable magical treasures.\n1. Have you ever known purveyors of magic and religion to get along? There's tension between Yagul Fane and the monastery... count on it.\n1. Greever's Lighthouse is full of ghosts. They sometimes activate the old light to summon a spectral ship from the depths.\n1. Follow the lights in the mountains to your peril.\n1. The mountain mists are the breath of ancient dragons. Dragons ruled this place. The Lost Druid says they'll return once their food source is replenished.\n1. Word is the Council of Six in Yagul Fane are trying to unseat the Fae Court; appointing \"more cooperative\" officials.\n1. In Starwoods, beware the moors; stick to the path.\n1. Fellstead's abbess and Mon's warden are friendly. VERY friendly if you know what I mean...\n1. I have it on good authority that one of the Northern Kings has a spy down here.\n\n\n### LOCATIONS\n\n**Freemoon Forest** stretches westward along the South Sea and is home of many rare botanicals. Wildflowers scent the air and the wind resonates like a familiar melody. Mortals avoid this \"Fae Land\" whenever possible; those who cannot are wise to hire a guide to help with any Fae \"curiosities\". This is especially good advice should you find yourself a defendant in the Fae Court. The court's queen, **Lady Goodknight** (`Queen, Grandparent, Peevish`), has a zero tolerance policy when it comes to protecting the forest and the secrets of Fae magic.\n\nSwaths of forest are being ravaged by fire, leaving the haunting beauty of a charred landscape. A dragon? But no confirmed sightings... yet.\n\n 2d6 | Freemoon Forest Encounters\n:---:|:--------------------\n 2   | **Shadow Dragon**\n 3   | 2d6 **Druids** demand an offering.\n 4   | d6+1 **Redcaps** are getting drunk and throwing an axe at a mortal tied to a rotting stump. First one to \"hit\" loses. The more they drink the closer they get.\n 5   | **Wailing Trees** mournful cries echo through the ancient woods. Those who hear become despondent and have a 2 in 6 chance of sleeplessness from haunting nightmares that last d6 nights.\n 6   | A **Fae Court** emerges around the PCs; they are found guilty of conspiring in the theft of a fae trinket. They must return the trinket and are immediately banished until they do so.\n 7   | **Sculpture Garden** with dozens of lifelike stone statues, including a mesmerizing medusa sculpture... reflected in a full length mirror just beside her.\n 8   | **Lamp Boy**\n 9   | 3d6 **Moonlight Mushrooms**, a very rare and valuable fungi. If consumed, they offer visions of near future events, at the cost of a single sleepless night and pains from deep laughter.\n 10  | **An Enchanted Clearing** adorned with glowing fae flowers, offers a chance to gather valuable herbs but risks disturbing the forest.\n 11+ | No encounter\n\n**Twilight Sands** As day transitions into night, shifting dunes and pristine white grains shimmer with an incorporeal glow. This landscape presents a mystical spectacle where reality blurs and secrets are laid bare. Despite its brilliancy, the sand is surprisingly cold to the touch. But it reflects and amplifies the sun's rays with mesmerizing and blinding affect... sometimes literally.\n\nNomadic tribes may lay claim to certain areas, and conflicts over resources are not uncommon among them. They are quick to dismiss any hint of authority from Yagul Fane and their \"wizzards\".\n\n 2d6 | Twilight Sands Encounters\n:---:|:--------------------\n 2   | **Sandits** us a stone that creates a magical sandstorm when submersed in water. More water; more storm. They create a storm and attack in the ensuing mayhem.\n 3   | 2d6 **Dune Crawlers**\n 4   | d6 **Dust Devils**\n 5   | **Ghost Caravan**, long abandoned, its cargo untouched and ripe for the taking, but its ghostly guardians may not take kindly to plunderers.\n 6   | **Trapped Dybbuk** in a magical stockade and unable to possess the living. He'll trade her freedom for a favor...\n 7   | **Dragon Vine**\n 8   | **Lost Mage** asks the party how to get back to Yagul Fane without admitting the he is lost.\n 9   | **Nomadic Tribe** offering trade and information in exchange for assistance in fending off Sandits.\n 10  | **Oasis Mirage**, a cache of valuable relics hidden beneath the shimmering surface of the water. It's _probably_ safe?\n 11+ | No encounter\n\n**The Sorrow Mountains** divide the eastern Starwoods from the Freemoon Forest to the west. The moniker derives from the perpetual mist that shrouds their rugged peaks. Within their depths lies the Prison of Mon. Visitors speak of a palpable sense of foreboding and the feeling of unseen eyes peering into their very soul.\n\n 2d6 | Sorrow Mountains Encounters\n:---:|:--------------------\n 2   | d6 **Bears**\n 3   | 2d6 **Wolves**\n 4   | A recent **Landslide** blocks the way ahead, requiring detour or clearing\n 5   | **Lamp Boy**\n 6   | **Abandoned Campsite** with scattered belongings, bloodstains, and tracks leading into a copse of trees\n 7   | **Fighting Giants** sound like thunder as they hurl boulders at each. Their forms, outlined against the horizon, moved with a grace belying their immense size. One takes A hit to the knee begetting a deafening roar that echos for miles. He is losing.\n 8   | **A Flock of Goats** bleat and traverse the steep cliffs with amazing ease\n 9   | **A Distressed Griffon** caught in a bear trap. Voices far in the distance are coming this way. Poachers?\n 10  | **Waterfall Pool** reveals scattered silver coins shimmering from beneath 20' of freezing water\n 11+ | No encounter\n\n**Starwoods** is an ancient forest nestled along the coast. Tangled briars and gnarled roots clutch the dirt like fingers. A dense canopy diffuses sunlight, casting a mesmerizing play of light and shadow upon the forest floor. Towering behemoths, prized for their unmatched durability, dominate the landscape and fetch a handsome price.\n\nLegend speaks of a guardian of the woods—-a creature part beast and part spirit—-rumored to possess an insatiable hunger for human flesh.\n\n 2d6 | Starwoods Encounters\n:---:|:--------------------\n 2   | **Wendigo**\n 3   | 2d6 **Bristled Boars**\n 4   | d6 **Succubi**\n 5   | **Giant Copper Scale** currently titled with a single silver coin\n 6   | A **Treant** is suspicious of the party and tests their nature\n 7   | **Lost Path** the path suddenly disappears, leaving the party disoriented and without direction\n 8   | **Voodoo Dolls**--one for each of the party--posed upon the forest floor\n 9   | **Mad Monk** (see Hextras)\n 10  | An **Ancient Shrine** carved into the trunk of a white oak, bears silver rings, etch with the names of each of the party\n 11+ | No encounter\n\n**West Marshes** sprawl endlessly; a labyrinth of murky waters and treacherous bogs. Quicksand pits lie in wait to ensnare the unwary, while giant leeches slither through the muck. The scent of damp earth and rotting vegetation choke the air. Rare herbs and exotic flora thrive in the damp, fertile soil; coveted by herbalists and alchemists alike.\n\n 2d6 | West Marshes\n:---:|:--------------------\n 2   | d6 **Bog Trolls** brutish, mossy, shit-breath creatures that ambush prey that wander too close.\n 3   | d6 **Swamp Drakes** a flying crocodile-like wyrm that attack from above with their powerful jaws and drag prey underwater to drown.\n 4   | 3d6 **Zombies**, fallen soldiers from the Battle of Mistwood, with an insatiable hunger for the living\n 5   | **Quicksand**\n 6   | **Bog Myrtle** small shrubs with berries prized for flavoring alcoholic beverages and as an essential oil.\n 7   | **Marsh Tea** a flowering plant used to treat various ailments, valuable to apothecaries.\n 8   | **Bog Rosemary** an extremely rare evergreen producing pink flowers used in herbal medicines.\n 9   | **Bog Amber** fossilized tree resin, prized for its beauty and rarity.\n 10  | **Cash Box** (2000s, 125lbs) marked with a silver stag; the sigil of King Theric II, who lost the Battle of Mistwood.\n 11+ | No encounter\n\n\n### HEXES\n\n**0104 Shadow Dragon Lair** entrance is obscured by shifting shadows created by bioluminescent fungi, which also provide dim illumination throughout the cave. The shadows are nearly indistinguishable from the dragon itself.\n\nBefore her incarceration in the Prison of Mon, the Hag Kalg had found the dragon, injured and dying. Her nursing it back to health, created an everlasting bond. The two communicate via shadows, plotting her freedom.\n\n**0209 Greever's Lighthouse** stands weather-beaten, like a skeletal finger pointing to the heavens. Constructed by Ned Greever, whose wife, Ida, met her end by jumping to the cliffs below. Since then, the abandoned lighthouse draws \"grievers\" who choose a similar fate. All who enter feel a heavy, chilling presence and a lingering sorrow.\n\nIda's diary lies under her old bed on fourth floor. In it, she reveals that her one true love was the captain of The Crown's Fury. News that his ship was lost in the Battle Mistwood came the same day she lept from the tower. She and the other ghosts activate the old light to summon the ghost ship from the depths.\n\nAt the edge of the cliffs is an aged bouquet of purple bog orchids, with a card that reads \"My dearest Ida, Your favorite color. Love, Peter\".\n\n**0302 Lost Druid's Grove** lies nestled amidst the craggy embrace of the Sorrow Mountains. Weathered stone circles show signs of countless ceremonies. The Lost Druid is currently imprisoned in the Prison of Mon. Her remaining 13 followers perform their sacred daily ceremonies but are also nearly finished with a complex ritual tied to her imprisonment. Strangers are tolerated in the grove but NOT at ceremonies.\n\n**0305 Prison of Mon** is carved into rock face of the Sorrow Mountains. Its architecture was designed to blend seamlessly with the natural surroundings, giving it an almost fortress-like appearance. Within its walls, a series of dark, damp, and windowless cells; each lit by a single torch. Prisoners wear a stone rune from a chain that binds them for the length of their sentence. Death is no release. Prisoners that die during their incarceration serve the remainder of their sentence as a Jailer.\n\nThe Jailers stand at attention in the prisons long entrance. Their runes' flickering amber glow the only light. Jailers are attuned to truth; any attempt to hide one's true nature, intentions, or possessions triggers a harsh reaction.\n\nFellstead Monastery provides a monk (on rotation), food, beer and healthcare for the prisoners. Yagul Fane provides magical protections and the runes that bind prisoners to their sentences. Both of these institutions receive _royal endowments_ from the northern kings. There is a 1 in 6 chance that representatives from either or both are currently.\n\n- **Warden Cloudcroft** `Stern, Respected` - Abbes Salvora visits often and a select few know they are \"friendly\"\n- **Captain Kell** `Veteran, Strict,Proud`\n- **Jailers** ethereal guards that wear a stone rune; can form a painful astral prison with their touch\n- **Gavric the Silent** `Inmate, Assassin`\n- **The Hag Kalg** `Inmate` - rumors of her whispering to a dragon-shaped shadow\n- **The Lost Druid** `Inmate` - her incarceration was a necessary sacrifice to complete a complex ritual\n- 4 workers; 6 human guards; 6 Jailers\n\n**0310 The Bone Cairn** is a puzzling landmark. A massive pile of bones arranged in the form of a cairn. If the bones are toppled, they inexplicably restack themselves at twilight, defying explanation.\n\n**0408.1 The Mirage Merchant** A caravan camped near the Twilight Sands; A merchant sells trinkets that have magical effects at twilight. 1 in 6 is _actually_ magical.\n\n**0412 Isle of Wights** is overrun by bushes bearing a milky white berries. Eating these berries within an hour of picking grants full health. After that hour, they are poisonous. The ground is littered with dead chalky-white birds, each with a berry in their mouth. Victims turn a stark white color adding to the common misunderstanding of the isle. There are no _wights_ on the island. This was a rumor perpetrated by pirates to scare off visitors and protect their buried treasures.\n\n**0502 Prophet for Profit** Tulver Witherspoon was a young navigator on a ship wrecked off the coast [#1508]. As he washed ashore, he was technically dead for 9 minutes. He awoke a changed man and now refers to himself as \"The River\". He sought out the druids but broke from them to start his own flock... a _new_ sort of navigator. He's a bit of a sensation and has 42 followers; 17 are true believers that will fight to the death for him. He stole a number of trinkets from the druids (old habits) including a **Nymph's Tear**, a tear shaped gemstone.\n\n  d6 | He says shit like\n:---:|:--------------------\n 1   | \"I've navigated the treacherous currents of fate. Call me 'The River' I flow with the wisdom of the ages.\"\n 2   | \"Feel my current, my power, swirling like the mighty river. I will chart your course.\"\n 3   | \"I'm the compass, guiding you through life's stormy waters.\"\n 4   | \"Aye, I once sailed the seas, but now I navigate the waters of the unknown.\"\n 5   | \"You don't want to know what lurks in those murky depths.\"\n 6   | \"As ebb and flow commands.\"\n\n**0607 Runes in the Dunes** is a phenomenon that occurs at twilight. As the first light breaks over the horizon, intricate patterns like ancient runes emerge in the shifting sands. These patterns vary in complexity and design, appearing and disappearing with the rhythm of the sunrise. Locals believe these runes hold secrets or messages from the spirits of the desert. Others see them as a natural wonder, a testament to the enigma of the dunes. Regardless, witnessing the Runes in the Dunes is a captivating experience, drawing travelers and curious onlookers alike to behold the artistry of the desert dawn.\n\n**0608 Yagul Fane** is marked by two imposing stone towers, erected by the legendary magi, Naz Yagul and Uma Fane. The Council of Six governs the site, with the head of Fellstead Monastery playing tie-breaker. Access beyond the ground floors is limited to magi and staff, and protected by formidable wards and spells. Residents are esteemed for their mastery of magical disciplines, drawing scholars and adventurers from distant lands.\n\nSurrounding the towers is a desert village housing approximately 300 inhabitants. These resilient individuals thrive in the harsh environment, relying on traditional values, adaptability, and self-reliance. Most live in tents; some in permanent stone structures, showcasing their connection to the land.\n\nIn the center of the village sits a magical cistern, created by the magi of Yagul Fane, ensuring water for all. This enchanted well symbolizes the community's unity and strength. The villagers engage in herding livestock and participating in trade as part of their daily activities.\n\n- **Gareth** `Next in line for Council of 6, Necromancer, Sweet tooth`\n- **Captain Yorik** `Guard, Hunter, Daring`\n- **The Broker** `Fence, Embroiderer, Methodical`\n- **Narla** `Alchemist, Pretty, 3 Husbands`\n- **Sorrel** `Priest, Trailblazer, Passionate`\n- **Cirian** `Sage, Cartwright, Creative`\n- **Flax** `Barkeep, Assassin, Funny`\n- **Liren** `Armorer, Wench, Determined`\n- **Ursula** `Spy, Cheeky, Displaced, Ward`\n- **Mrs Redraven** `Lady-of-the-house, Loyal, Prude`\n\n**0807.6 Barrow of the Cane**\nA 12' rune stone carved into a silver speckled, rust-colored stone. It sets upon a small hill marked with rusty grass. The rune tells an elaborate history of **The Cane**, an ancient tribe of warriors. The barrow has an entrance at its base, framed by three monolith stones. The walls within are covered in chalky paintings of men with long spears fighting various monsters; hand prints of men, women and children; and giants in the mountains. The paintings depict families with heads in the shape of various animal spirits. Each cubbyhole is marked with these same animal shapes.\n\nCubbyholes contain mostly bones but also: obsidian arrowheads, an obsidian axe, a solid silver bear-like idol (400s) and simple silver jewelry (120s). There are a number of extremely high quality spear poles; one still with a razor-sharp obsidian tip. Resting in this sacred space aids healing.\n\nIf the bones are disturbed a ghost will appear. **Zamma** was the tribe's last shaman. His bones are buried beneath the monolith, just above the ceiling of the main chamber. He cannot speak but will point at various drawings on the walls. He will disappear if the bones are returned to their resting place. Taking anything but the weapons (weapons are to use; treasure is property of the Cane) from the barrow (without trade or sacrifice) curses the thief: their fingers > hand > arm > etc start turning red. When they are completely red the thief dies.\n\n**0904 Harlan's Grove** is renowned for producing the region's finest hops, coveted by brewers for their unparalleled quality. Francis and Catherine Harlan have become quite famous to those in the trade. However, the true secret behind the exceptional hops lies in the soil's rare mineral deposit, discovered by the Harlans generations ago. This mineral imbues the hops with distinctive flavors and aromas, making them highly sought after. Guarding their knowledge closely, the Harlans perpetuate the myth of their unparalleled skill, ensuring their dominance in the hop market.\n\n**1004 Maude's Meadery** Vibrant wildflowers bordered by a meandering stream. the meadery farm presents a picturesque scene straight out of a pastoral painting. The air is perfumed with the sweet aroma of honey, mingling with the earthy scent of the surrounding fields. Rows upon rows of lush, golden-hued honeycombs glisten under the gentle sunlight, tended to by diligent beekeepers clad in weathered leather aprons. In the heart of the farm, a quaint stone cottage stands as the hub of activity, its chimney billowing fragrant smoke from the hearth where mead is brewed in large copper cauldrons. Bees buzz lazily among the blossoms, their diligent work ensuring a plentiful harvest of honey, while workers scurry about, gathering ingredients and preparing barrels for the fermentation process. Amidst the tranquility of the countryside, the meadery farm hums with the rhythmic pulse of nature and the bustling energy of artisanal craftsmanship.\n\nMaude's southwestern hives are all dying. Weather this season has been dry and the bees have been traveling all the way to Harlan's Grove. Their hops is poisoning the hives and Maude is desperate to find the cause. The two farms have been friends for years so she will be slow to accept the truth.\n\n**1108 Fellstead Monastery** is perched upon the edge of the coast and surrounded by lush, rolling hills. The monastery is constructed from warm, honey-colored stone and Gothic architecture. Its walls are adorned with intricate stained glass windows depicting scenes from the life of St. Fellstead (patron saint of travelers and seekers of knowledge). It is a place of peace and reflection, where people from all walks of life come to seek answers, find comfort, and renew their spirits.\n\nThe Monastery boasts a renowned library, a trip of goats that produces fine milk/cheese and a rather fabulous winery and the best beer in the south--thanks to a annual donation of hops from Harlan's Grove [#0904]\n\nA group of pilgrims has come from the north seeking guidance and sanctuary, placing additional strain on the resources and tranquility of the monks.\n\n- **Abbes Salvora** `Devoted, Wise`\n- **Prior Cedric** `Rugged, Diligent`\n- **Sister Elara** `Druid, Healer, Formerly Lost Druid`\n- **Brother Ulfar** `Vintner, Mean Drunk` - avoided but knows wine\n- **Brother Estabar** `Monk, Eager` - master goat herder\n- **Sir Ealdred** `Knight, Daring` - seeks spiritual clarity after long and brutal campaigns\n- **Lady Isolde** `Noble, Selfless` - sought sanctuary from the pressures of court life`\n- 28 Monks, 6 pilgrims\n\n**1405 Loggers Camp** in the heart of Starwood Forest; a stark contrast to the natural beauty that surrounds it. The camp is a rough collection of tents and wooden structures. The sounds of axes and saws echo through the trees. The loggers harvest the valuable timber while grappling with their impact on the ancient woodland. To say the druids despise their profession is an understatement.\n\n- **Foreman \"Boss\" Bartok** `Burly, Caring (crew and sustainability of logging)`\n- **Lena \"Sawbones\" Thorne** `Medic, Herbalist, Gentle`\n- **Lucia \"Twig\" Thorne** `Camp Mom, Agile, Cheerful`\n- **\"Cookie\"** `One-armed Logger, Terrible cook`\n- 18 loggers\n\n**1408 Fishing Hamlet** with handful of huts. The one closest to the sea belongs to **Pesh**, a fourth-generation fisherman. Buried beneath his hut lies a chest containing 10,000 silver coins salvaged from the shipwreck a mile off the coast. It took him seven trips under the cover of night to retrieve the treasure. Burdened with the fear of attracting bandits, Pesh refuses to spend the treasure. Instead, he makes generous, anonymous donations to the monastery.\n\nThe hamlet fears and avoids the Boat Hag [#1506]. They refuse to trade with her and \"allegedly\" leave rotten fish guts on her doorstep.\n\n**1506 The Boat Hag** A large overturned boat repurposed into a makeshift dwelling. The hull's curvature and the weathered planks remnants of its former life. Within this curious abode resides a reclusive hag. She is known for her extensive knowledge of herbal remedies and potions, which she brews using ingredients gathered from the surrounding marshlands and forests.\n\nAmong her possessions is a **Dryad's Whispering Branch**. A slender branch from a dryad's tree. It allows the wielder to communicate with woodland creatures and plants.\n\n**1508 Pirate Shipwreck** lies just off the coast, its remains jutting from the water. Barnacles cling to its splintered boards, broken masts, and rusting cannons. A haunting reminder of the sea's perils. Carved onto a board just above the waterline is \"Pesh was here\" [#1405]. 2d6 **venomous reef snakes**, camouflaged among the coral, hunt in the wreckage.\n\nAmong the treasure was also a **Sylph Ring**. A pewter ring marked with the fae rune for air, that summons gentle, calming winds.\n\n**1603 Old Pete's Boggery** stands as a testament to human resilience. With his daughter Ida and a dedicated team of 12 hands, Pete toils tirelessly to extract valuable peat from the marshes. Despite the challenges posed by the terrain, the farm not only sustains itself but also provides a crucial resource for the surrounding communities. Nobody knows the marshes better than Pete and his daughter.\n\n\n### HEXTRAS\n\nThe following hex/encounters can be used as random situations throughout the Southern Coast as the GM requires.\n\n1. **Shadow Walker** A robed woman sits cross legged in the sand. She's waiting for the sun to either come out or be at the right moment so she can shadowalk to her intended destination. Once the shadows are just right, she will walk into it, through a disorienting maze of darkness and out of another shadow elsewhere. Shadow walking is tricky; the traveler may come out feet or miles off course. The woman might teach PCs how it works... for a price.\n\n2. **Classic Traveler** A rather tall man walks with a limp next to an empty two-cart train pulled by two large oxen. He will introduce himself as **Malfas**. Malfas is an alien in human form and a few hundred years early to play basketball. The oxen are mechanical which only cutting them would reveal. Only their crazy strength would be telling that they are not real oxen. Their names are Jake and Jim. The traveler has 5 marbles that can perform what some would call miracles. He used one to make Jake, Jim and the cart. He needs one to return home. He's looking for work but really wants to study humans.\n\n3. **Mad Monk** is dressed in pink robes of an improbable shade of bright pink. His eyes dart with a manic glint, and he mumbles to himself incoherently. He's out of water and will ask the PCs if they can spare any. He's quite mad... he's looking for a door. He might remember his name is **Jaral**.\n\n4. **Four Leaf Clover Field** A field of ONLY four leaf clovers... finding a THREE leaf clover brings the bearer luck.\n\n5. **Aware Wolf** Buzzards circle overhead 100 yards off. The target is a goat carcass that looks to have been mostly devoured by wolves. A werewolf in human form sleeps soundly in a nearby thicket. Slender with dark curly hair and covered in blood; his name is **Zander**. He will try to avoid notice and pretend to be looking for a lost dog if noticed. Zander and his pack only pose a threat at night. He speaks to a dead friend...\n\n6. **Fare Fight** A copper-skinned warrior named **Lunara** (`Warrior, Proud`) is fighting three armored traders; her broken spear lodged in one trader's shoulder, she now wields daggers. Wandering hands_ were NOT part of the fare. The trader's wagon is smoking and will soon go up in flames. Within the wagon are 300s of pelts and two casks of fine wine (200s).\n\n\n### BESTIARY\n- **Bear** `Strong, Quick, Reach, Perceptive` - Something this big and strong should not move so quickly. It's easy to underestimate their burst and reach. You'll only get too close once.\",\n- **Bog Troll** `Brutish, Mossy, Ambush` - These slimy buggers lurk in the marshy depths, waiting to ambush unwary travelers.\n- **Bristled Boar** `Aggressive, Tusks, Gorge` - Angry. Damn angry. Seething! That cute little squiggly tail is attached to a wild, shaggy killer!\n- **Griffon** `Majestic, Hunter, Flight` - As for riding one of these noble beasts: bowing is not a bad idea... but you first!\n- **Dragon Vine** `Swarm, Grapple, Poison` - Razor sharp and stronger than you'd expect. You may only notice them after they've grappled you... and then there's the poison.\n- **Dust Devil** `Elusive, Blinding, Sandstorm` - Your weapons are useless against these whirling tornadoes of sand.\n- **Dune Crawlers** `Agile, Burrow, Venomous` - Large, insect-like creatures that scuttle effortlessly over sands. They burrow just under the sand wait...\n- **Lamp Boy** `Tracker, Mute, Coins-for-eyes` - These fae creatures are engaged by someone or something (even the cosmos), to retrieve someone or something, and lead them to someone or somewhere They will not stop until their task is done. Those silver eyes cannot be deceived. Careful... you break one, you become one.\n- **Quicksand** `Treacherous, Sinking, Trap` - Slow, deliberate movements will save you; bad time for a panic attack.\n- **Sandit** `Sandstorm, Bandit, Ambush` - Bandits who possess a magical stone that can create sandstorms, using it to confuse and disorient enemies before attacking.\n- **Shadow Dragon** `Big, Shadow-walker, Incorporeal` - Only solid/vulnerable when breathing fire, during twilight or when it wishes.\n- **Redcap** `Invisible, Pack, Razors` - If you see one, it's because they want you to or you're marked. Once they outnumber you, out come the razors. Fresh blood for their caps!\n- **Succubi** `Seductive, Hypnotic, Draining` - weave a hypnotic song and emerge from the forest; their alluring features framed by cascading locks of midnight hair, beckon seductively\n- **Swamp Drakes** `Jaws, Hunter, Aquatic` - flying crocodile-like wyrms that attack from above with their powerful jaws and drag prey underwater to drown.\n- **Wailing Tree** `Haunting, Mourning, Bewitching` - Those who hear their cries become despondent and have a 2 in 6 chance of sleeplessness from haunting nightmares that last d6 nights.\n- **Wendigo** `Cannibal, Wind-walker, Curse of Insatiable Hunger, Icy Portents, Frightening` - Victims will devour every scrap of food on their person... and then attempt to devour a person.\n- **Wolf** `Predator, Pack, Cunning, Keen Senses` - You might want to stay close to a fire... or a spear.\n- **Zombies** `Undead, Relentless, Mindless` - How's your cardio?\n\n![image](/assets/images/southern_coast/southern_coast.png)\n\n_v0.8.42_ by brine <br>\n[map by Watabou](https://watabou.github.io/perilous-shores/?seed=945645879&tags=perilous,woodland,difficult,coast,chaotic,highland&w=1300&h=1300&hexes=2) <br>\n[Hexcrawl Rules](https://casadeocio.itch.io/hexcrawls-rule) if needed <br>\nFor your [random needs](https://rando.brine.dev) <br>\n",
    "html": "<p><strong>The Southern Coast</strong>, in contrast to its harsh landscape, boasts a temperate climate accentuated by gentle sea breezes and occasional coastal fog. Passage to the northern kingdoms is best by sea; avoiding the formidable barriers of the Sorrow Mountains and West Marshes. The region was originally a druidic sanctuary, until the Northern Kings, seeking a remote location for their most dangerous criminals, commissioned the construction of a prison; or as they put it, <em>\"a place to throw our trash\"</em>. Recognizing the need for magical restraints, they enlisted the expertise of renowned magi Naz Yagul and Uma Fane. Additionally, missionaries were funded to provide support for the prison's operation and potentially convert the remaining druids.</p>\n<p>With these pillars of civilization established, the Southern Coast has begun to attract adventurous individuals seeking to make it their home.</p>\n<h3 id=\"whatisthis\">WHAT IS THIS?</h3>\n<p>The Southern Coast is a system neutral, regional setting designed for sandbox exploration and adventure. Details are intentionally vague in order to accommodate YOUR campaign. It is intended to be serviceable as-is while providing just enough flavor to spark imagination. GMs are encouraged to add or ignore content to suit their table.</p>\n<h3 id=\"situations\">SITUATIONS</h3>\n<ol>\n<li>Loggers in the Starwoods have been attacked by a creature they claim is a wendigo. They've sent a desperate plea to the Monastery for aid.</li>\n<li>The Crown's Fury, a ship lost in the Battle of Mistwood, was <em>busting</em> with silver and other treasures when it sank. The rumors of a \"ghost ship\" seen off the coast are well established but an eye witness swears that it's The Crown's Fury.</li>\n<li>A local herbalist seeks brave adventurers to retrieve herbs that grow deep within the West Marshes, promising silver and potent potions as reward.</li>\n<li>An infamous game hunter, and friend to the Northern Kings, will pay handsomely for help finding/tracking/killing a wendigo.</li>\n<li>The PCs are escorting a prisoner to the Prison of Mon</li>\n<li>A Duke's son found a treasure map leading to the Isle of Wight and has not been heard from for a week.</li>\n</ol>\n<h3 id=\"2d6rumors\">2D6 RUMORS</h3>\n<ol start=\"2\">\n<li>The Isle of Wights is aptly named. It's overrun with wights looking to add to their number. Nobody comes back from that retched place.</li>\n<li>Some crazy druid up in the mountains has got himself a harem and is performing miracles!</li>\n<li>Yagul Fane is built atop an ancient city with unimaginable magical treasures.</li>\n<li>Have you ever known purveyors of magic and religion to get along? There's tension between Yagul Fane and the monastery… count on it.</li>\n<li>Greever's Lighthouse is full of ghosts. They sometimes activate the old light to summon a spectral ship from the depths.</li>\n<li>Follow the lights in the mountains to your peril.</li>\n<li>The mountain mists are the breath of ancient dragons. Dragons ruled this place. The Lost Druid says they'll return once their food source is replenished.</li>\n<li>Word is the Council of Six in Yagul Fane are trying to unseat the Fae Court; appointing \"more cooperative\" officials.</li>\n<li>In Starwoods, beware the moors; stick to the path.</li>\n<li>Fellstead's abbess and Mon's warden are friendly. VERY friendly if you know what I mean…</li>\n<li>I have it on good authority that one of the Northern Kings has a spy down here.</li>\n</ol>\n<h3 id=\"locations\">LOCATIONS</h3>\n<p><strong>Freemoon Forest</strong> stretches westward along the South Sea and is home of many rare botanicals. Wildflowers scent the air and the wind resonates like a familiar melody. Mortals avoid this \"Fae Land\" whenever possible; those who cannot are wise to hire a guide to help with any Fae \"curiosities\". This is especially good advice should you find yourself a defendant in the Fae Court. The court's queen, <strong>Lady Goodknight</strong> (<code>Queen, Grandparent, Peevish</code>), has a zero tolerance policy when it comes to protecting the forest and the secrets of Fae magic.</p>\n<p>Swaths of forest are being ravaged by fire, leaving the haunting beauty of a charred landscape. A dragon? But no confirmed sightings… yet.</p>\n<table>\n<thead>\n<tr>\n<th id=\"2d6\" style=\"text-align:center;\">2d6</th>\n<th id=\"freemoon_forest_encounters\" style=\"text-align:left;\">Freemoon Forest Encounters</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:center;\">2</td>\n<td style=\"text-align:left;\"><strong>Shadow Dragon</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">3</td>\n<td style=\"text-align:left;\">2d6 <strong>Druids</strong> demand an offering.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">4</td>\n<td style=\"text-align:left;\">d6+1 <strong>Redcaps</strong> are getting drunk and throwing an axe at a mortal tied to a rotting stump. First one to \"hit\" loses. The more they drink the closer they get.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">5</td>\n<td style=\"text-align:left;\"><strong>Wailing Trees</strong> mournful cries echo through the ancient woods. Those who hear become despondent and have a 2 in 6 chance of sleeplessness from haunting nightmares that last d6 nights.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">6</td>\n<td style=\"text-align:left;\">A <strong>Fae Court</strong> emerges around the PCs; they are found guilty of conspiring in the theft of a fae trinket. They must return the trinket and are immediately banished until they do so.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">7</td>\n<td style=\"text-align:left;\"><strong>Sculpture Garden</strong> with dozens of lifelike stone statues, including a mesmerizing medusa sculpture… reflected in a full length mirror just beside her.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">8</td>\n<td style=\"text-align:left;\"><strong>Lamp Boy</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">9</td>\n<td style=\"text-align:left;\">3d6 <strong>Moonlight Mushrooms</strong>, a very rare and valuable fungi. If consumed, they offer visions of near future events, at the cost of a single sleepless night and pains from deep laughter.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">10</td>\n<td style=\"text-align:left;\"><strong>An Enchanted Clearing</strong> adorned with glowing fae flowers, offers a chance to gather valuable herbs but risks disturbing the forest.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">11+</td>\n<td style=\"text-align:left;\">No encounter</td>\n</tr>\n</tbody>\n</table>\n<p><strong>Twilight Sands</strong> As day transitions into night, shifting dunes and pristine white grains shimmer with an incorporeal glow. This landscape presents a mystical spectacle where reality blurs and secrets are laid bare. Despite its brilliancy, the sand is surprisingly cold to the touch. But it reflects and amplifies the sun's rays with mesmerizing and blinding affect… sometimes literally.</p>\n<p>Nomadic tribes may lay claim to certain areas, and conflicts over resources are not uncommon among them. They are quick to dismiss any hint of authority from Yagul Fane and their \"wizzards\".</p>\n<table>\n<thead>\n<tr>\n<th id=\"2d6\" style=\"text-align:center;\">2d6</th>\n<th id=\"twilight_sands_encounters\" style=\"text-align:left;\">Twilight Sands Encounters</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:center;\">2</td>\n<td style=\"text-align:left;\"><strong>Sandits</strong> us a stone that creates a magical sandstorm when submersed in water. More water; more storm. They create a storm and attack in the ensuing mayhem.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">3</td>\n<td style=\"text-align:left;\">2d6 <strong>Dune Crawlers</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">4</td>\n<td style=\"text-align:left;\">d6 <strong>Dust Devils</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">5</td>\n<td style=\"text-align:left;\"><strong>Ghost Caravan</strong>, long abandoned, its cargo untouched and ripe for the taking, but its ghostly guardians may not take kindly to plunderers.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">6</td>\n<td style=\"text-align:left;\"><strong>Trapped Dybbuk</strong> in a magical stockade and unable to possess the living. He'll trade her freedom for a favor…</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">7</td>\n<td style=\"text-align:left;\"><strong>Dragon Vine</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">8</td>\n<td style=\"text-align:left;\"><strong>Lost Mage</strong> asks the party how to get back to Yagul Fane without admitting the he is lost.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">9</td>\n<td style=\"text-align:left;\"><strong>Nomadic Tribe</strong> offering trade and information in exchange for assistance in fending off Sandits.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">10</td>\n<td style=\"text-align:left;\"><strong>Oasis Mirage</strong>, a cache of valuable relics hidden beneath the shimmering surface of the water. It's <em>probably</em> safe?</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">11+</td>\n<td style=\"text-align:left;\">No encounter</td>\n</tr>\n</tbody>\n</table>\n<p><strong>The Sorrow Mountains</strong> divide the eastern Starwoods from the Freemoon Forest to the west. The moniker derives from the perpetual mist that shrouds their rugged peaks. Within their depths lies the Prison of Mon. Visitors speak of a palpable sense of foreboding and the feeling of unseen eyes peering into their very soul.</p>\n<table>\n<thead>\n<tr>\n<th id=\"2d6\" style=\"text-align:center;\">2d6</th>\n<th id=\"sorrow_mountains_encounters\" style=\"text-align:left;\">Sorrow Mountains Encounters</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:center;\">2</td>\n<td style=\"text-align:left;\">d6 <strong>Bears</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">3</td>\n<td style=\"text-align:left;\">2d6 <strong>Wolves</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">4</td>\n<td style=\"text-align:left;\">A recent <strong>Landslide</strong> blocks the way ahead, requiring detour or clearing</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">5</td>\n<td style=\"text-align:left;\"><strong>Lamp Boy</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">6</td>\n<td style=\"text-align:left;\"><strong>Abandoned Campsite</strong> with scattered belongings, bloodstains, and tracks leading into a copse of trees</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">7</td>\n<td style=\"text-align:left;\"><strong>Fighting Giants</strong> sound like thunder as they hurl boulders at each. Their forms, outlined against the horizon, moved with a grace belying their immense size. One takes A hit to the knee begetting a deafening roar that echos for miles. He is losing.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">8</td>\n<td style=\"text-align:left;\"><strong>A Flock of Goats</strong> bleat and traverse the steep cliffs with amazing ease</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">9</td>\n<td style=\"text-align:left;\"><strong>A Distressed Griffon</strong> caught in a bear trap. Voices far in the distance are coming this way. Poachers?</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">10</td>\n<td style=\"text-align:left;\"><strong>Waterfall Pool</strong> reveals scattered silver coins shimmering from beneath 20' of freezing water</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">11+</td>\n<td style=\"text-align:left;\">No encounter</td>\n</tr>\n</tbody>\n</table>\n<p><strong>Starwoods</strong> is an ancient forest nestled along the coast. Tangled briars and gnarled roots clutch the dirt like fingers. A dense canopy diffuses sunlight, casting a mesmerizing play of light and shadow upon the forest floor. Towering behemoths, prized for their unmatched durability, dominate the landscape and fetch a handsome price.</p>\n<p>Legend speaks of a guardian of the woods—-a creature part beast and part spirit—-rumored to possess an insatiable hunger for human flesh.</p>\n<table>\n<thead>\n<tr>\n<th id=\"2d6\" style=\"text-align:center;\">2d6</th>\n<th id=\"starwoods_encounters\" style=\"text-align:left;\">Starwoods Encounters</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:center;\">2</td>\n<td style=\"text-align:left;\"><strong>Wendigo</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">3</td>\n<td style=\"text-align:left;\">2d6 <strong>Bristled Boars</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">4</td>\n<td style=\"text-align:left;\">d6 <strong>Succubi</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">5</td>\n<td style=\"text-align:left;\"><strong>Giant Copper Scale</strong> currently titled with a single silver coin</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">6</td>\n<td style=\"text-align:left;\">A <strong>Treant</strong> is suspicious of the party and tests their nature</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">7</td>\n<td style=\"text-align:left;\"><strong>Lost Path</strong> the path suddenly disappears, leaving the party disoriented and without direction</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">8</td>\n<td style=\"text-align:left;\"><strong>Voodoo Dolls</strong>--one for each of the party--posed upon the forest floor</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">9</td>\n<td style=\"text-align:left;\"><strong>Mad Monk</strong> (see Hextras)</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">10</td>\n<td style=\"text-align:left;\">An <strong>Ancient Shrine</strong> carved into the trunk of a white oak, bears silver rings, etch with the names of each of the party</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">11+</td>\n<td style=\"text-align:left;\">No encounter</td>\n</tr>\n</tbody>\n</table>\n<p><strong>West Marshes</strong> sprawl endlessly; a labyrinth of murky waters and treacherous bogs. Quicksand pits lie in wait to ensnare the unwary, while giant leeches slither through the muck. The scent of damp earth and rotting vegetation choke the air. Rare herbs and exotic flora thrive in the damp, fertile soil; coveted by herbalists and alchemists alike.</p>\n<table>\n<thead>\n<tr>\n<th id=\"2d6\" style=\"text-align:center;\">2d6</th>\n<th id=\"west_marshes\" style=\"text-align:left;\">West Marshes</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:center;\">2</td>\n<td style=\"text-align:left;\">d6 <strong>Bog Trolls</strong> brutish, mossy, shit-breath creatures that ambush prey that wander too close.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">3</td>\n<td style=\"text-align:left;\">d6 <strong>Swamp Drakes</strong> a flying crocodile-like wyrm that attack from above with their powerful jaws and drag prey underwater to drown.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">4</td>\n<td style=\"text-align:left;\">3d6 <strong>Zombies</strong>, fallen soldiers from the Battle of Mistwood, with an insatiable hunger for the living</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">5</td>\n<td style=\"text-align:left;\"><strong>Quicksand</strong></td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">6</td>\n<td style=\"text-align:left;\"><strong>Bog Myrtle</strong> small shrubs with berries prized for flavoring alcoholic beverages and as an essential oil.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">7</td>\n<td style=\"text-align:left;\"><strong>Marsh Tea</strong> a flowering plant used to treat various ailments, valuable to apothecaries.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">8</td>\n<td style=\"text-align:left;\"><strong>Bog Rosemary</strong> an extremely rare evergreen producing pink flowers used in herbal medicines.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">9</td>\n<td style=\"text-align:left;\"><strong>Bog Amber</strong> fossilized tree resin, prized for its beauty and rarity.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">10</td>\n<td style=\"text-align:left;\"><strong>Cash Box</strong> (2000s, 125lbs) marked with a silver stag; the sigil of King Theric II, who lost the Battle of Mistwood.</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">11+</td>\n<td style=\"text-align:left;\">No encounter</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"hexes\">HEXES</h3>\n<p><strong>0104 Shadow Dragon Lair</strong> entrance is obscured by shifting shadows created by bioluminescent fungi, which also provide dim illumination throughout the cave. The shadows are nearly indistinguishable from the dragon itself.</p>\n<p>Before her incarceration in the Prison of Mon, the Hag Kalg had found the dragon, injured and dying. Her nursing it back to health, created an everlasting bond. The two communicate via shadows, plotting her freedom.</p>\n<p><strong>0209 Greever's Lighthouse</strong> stands weather-beaten, like a skeletal finger pointing to the heavens. Constructed by Ned Greever, whose wife, Ida, met her end by jumping to the cliffs below. Since then, the abandoned lighthouse draws \"grievers\" who choose a similar fate. All who enter feel a heavy, chilling presence and a lingering sorrow.</p>\n<p>Ida's diary lies under her old bed on fourth floor. In it, she reveals that her one true love was the captain of The Crown's Fury. News that his ship was lost in the Battle Mistwood came the same day she lept from the tower. She and the other ghosts activate the old light to summon the ghost ship from the depths.</p>\n<p>At the edge of the cliffs is an aged bouquet of purple bog orchids, with a card that reads \"My dearest Ida, Your favorite color. Love, Peter\".</p>\n<p><strong>0302 Lost Druid's Grove</strong> lies nestled amidst the craggy embrace of the Sorrow Mountains. Weathered stone circles show signs of countless ceremonies. The Lost Druid is currently imprisoned in the Prison of Mon. Her remaining 13 followers perform their sacred daily ceremonies but are also nearly finished with a complex ritual tied to her imprisonment. Strangers are tolerated in the grove but NOT at ceremonies.</p>\n<p><strong>0305 Prison of Mon</strong> is carved into rock face of the Sorrow Mountains. Its architecture was designed to blend seamlessly with the natural surroundings, giving it an almost fortress-like appearance. Within its walls, a series of dark, damp, and windowless cells; each lit by a single torch. Prisoners wear a stone rune from a chain that binds them for the length of their sentence. Death is no release. Prisoners that die during their incarceration serve the remainder of their sentence as a Jailer.</p>\n<p>The Jailers stand at attention in the prisons long entrance. Their runes' flickering amber glow the only light. Jailers are attuned to truth; any attempt to hide one's true nature, intentions, or possessions triggers a harsh reaction.</p>\n<p>Fellstead Monastery provides a monk (on rotation), food, beer and healthcare for the prisoners. Yagul Fane provides magical protections and the runes that bind prisoners to their sentences. Both of these institutions receive <em>royal endowments</em> from the northern kings. There is a 1 in 6 chance that representatives from either or both are currently.</p>\n<ul>\n<li><strong>Warden Cloudcroft</strong> <code>Stern, Respected</code> - Abbes Salvora visits often and a select few know they are \"friendly\"</li>\n<li><strong>Captain Kell</strong> <code>Veteran, Strict,Proud</code></li>\n<li><strong>Jailers</strong> ethereal guards that wear a stone rune; can form a painful astral prison with their touch</li>\n<li><strong>Gavric the Silent</strong> <code>Inmate, Assassin</code></li>\n<li><strong>The Hag Kalg</strong> <code>Inmate</code> - rumors of her whispering to a dragon-shaped shadow</li>\n<li><strong>The Lost Druid</strong> <code>Inmate</code> - her incarceration was a necessary sacrifice to complete a complex ritual</li>\n<li>4 workers; 6 human guards; 6 Jailers</li>\n</ul>\n<p><strong>0310 The Bone Cairn</strong> is a puzzling landmark. A massive pile of bones arranged in the form of a cairn. If the bones are toppled, they inexplicably restack themselves at twilight, defying explanation.</p>\n<p><strong>0408.1 The Mirage Merchant</strong> A caravan camped near the Twilight Sands; A merchant sells trinkets that have magical effects at twilight. 1 in 6 is <em>actually</em> magical.</p>\n<p><strong>0412 Isle of Wights</strong> is overrun by bushes bearing a milky white berries. Eating these berries within an hour of picking grants full health. After that hour, they are poisonous. The ground is littered with dead chalky-white birds, each with a berry in their mouth. Victims turn a stark white color adding to the common misunderstanding of the isle. There are no <em>wights</em> on the island. This was a rumor perpetrated by pirates to scare off visitors and protect their buried treasures.</p>\n<p><strong>0502 Prophet for Profit</strong> Tulver Witherspoon was a young navigator on a ship wrecked off the coast [#1508]. As he washed ashore, he was technically dead for 9 minutes. He awoke a changed man and now refers to himself as \"The River\". He sought out the druids but broke from them to start his own flock… a <em>new</em> sort of navigator. He's a bit of a sensation and has 42 followers; 17 are true believers that will fight to the death for him. He stole a number of trinkets from the druids (old habits) including a <strong>Nymph's Tear</strong>, a tear shaped gemstone.</p>\n<table>\n<thead>\n<tr>\n<th id=\"d6\" style=\"text-align:center;\">d6</th>\n<th id=\"he_says_shit_like\" style=\"text-align:left;\">He says shit like</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:center;\">1</td>\n<td style=\"text-align:left;\">\"I've navigated the treacherous currents of fate. Call me 'The River' I flow with the wisdom of the ages.\"</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">2</td>\n<td style=\"text-align:left;\">\"Feel my current, my power, swirling like the mighty river. I will chart your course.\"</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">3</td>\n<td style=\"text-align:left;\">\"I'm the compass, guiding you through life's stormy waters.\"</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">4</td>\n<td style=\"text-align:left;\">\"Aye, I once sailed the seas, but now I navigate the waters of the unknown.\"</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">5</td>\n<td style=\"text-align:left;\">\"You don't want to know what lurks in those murky depths.\"</td>\n</tr>\n<tr>\n<td style=\"text-align:center;\">6</td>\n<td style=\"text-align:left;\">\"As ebb and flow commands.\"</td>\n</tr>\n</tbody>\n</table>\n<p><strong>0607 Runes in the Dunes</strong> is a phenomenon that occurs at twilight. As the first light breaks over the horizon, intricate patterns like ancient runes emerge in the shifting sands. These patterns vary in complexity and design, appearing and disappearing with the rhythm of the sunrise. Locals believe these runes hold secrets or messages from the spirits of the desert. Others see them as a natural wonder, a testament to the enigma of the dunes. Regardless, witnessing the Runes in the Dunes is a captivating experience, drawing travelers and curious onlookers alike to behold the artistry of the desert dawn.</p>\n<p><strong>0608 Yagul Fane</strong> is marked by two imposing stone towers, erected by the legendary magi, Naz Yagul and Uma Fane. The Council of Six governs the site, with the head of Fellstead Monastery playing tie-breaker. Access beyond the ground floors is limited to magi and staff, and protected by formidable wards and spells. Residents are esteemed for their mastery of magical disciplines, drawing scholars and adventurers from distant lands.</p>\n<p>Surrounding the towers is a desert village housing approximately 300 inhabitants. These resilient individuals thrive in the harsh environment, relying on traditional values, adaptability, and self-reliance. Most live in tents; some in permanent stone structures, showcasing their connection to the land.</p>\n<p>In the center of the village sits a magical cistern, created by the magi of Yagul Fane, ensuring water for all. This enchanted well symbolizes the community's unity and strength. The villagers engage in herding livestock and participating in trade as part of their daily activities.</p>\n<ul>\n<li><strong>Gareth</strong> <code>Next in line for Council of 6, Necromancer, Sweet tooth</code></li>\n<li><strong>Captain Yorik</strong> <code>Guard, Hunter, Daring</code></li>\n<li><strong>The Broker</strong> <code>Fence, Embroiderer, Methodical</code></li>\n<li><strong>Narla</strong> <code>Alchemist, Pretty, 3 Husbands</code></li>\n<li><strong>Sorrel</strong> <code>Priest, Trailblazer, Passionate</code></li>\n<li><strong>Cirian</strong> <code>Sage, Cartwright, Creative</code></li>\n<li><strong>Flax</strong> <code>Barkeep, Assassin, Funny</code></li>\n<li><strong>Liren</strong> <code>Armorer, Wench, Determined</code></li>\n<li><strong>Ursula</strong> <code>Spy, Cheeky, Displaced, Ward</code></li>\n<li><strong>Mrs Redraven</strong> <code>Lady-of-the-house, Loyal, Prude</code></li>\n</ul>\n<p><strong>0807.6 Barrow of the Cane</strong>\nA 12' rune stone carved into a silver speckled, rust-colored stone. It sets upon a small hill marked with rusty grass. The rune tells an elaborate history of <strong>The Cane</strong>, an ancient tribe of warriors. The barrow has an entrance at its base, framed by three monolith stones. The walls within are covered in chalky paintings of men with long spears fighting various monsters; hand prints of men, women and children; and giants in the mountains. The paintings depict families with heads in the shape of various animal spirits. Each cubbyhole is marked with these same animal shapes.</p>\n<p>Cubbyholes contain mostly bones but also: obsidian arrowheads, an obsidian axe, a solid silver bear-like idol (400s) and simple silver jewelry (120s). There are a number of extremely high quality spear poles; one still with a razor-sharp obsidian tip. Resting in this sacred space aids healing.</p>\n<p>If the bones are disturbed a ghost will appear. <strong>Zamma</strong> was the tribe's last shaman. His bones are buried beneath the monolith, just above the ceiling of the main chamber. He cannot speak but will point at various drawings on the walls. He will disappear if the bones are returned to their resting place. Taking anything but the weapons (weapons are to use; treasure is property of the Cane) from the barrow (without trade or sacrifice) curses the thief: their fingers &gt; hand &gt; arm &gt; etc start turning red. When they are completely red the thief dies.</p>\n<p><strong>0904 Harlan's Grove</strong> is renowned for producing the region's finest hops, coveted by brewers for their unparalleled quality. Francis and Catherine Harlan have become quite famous to those in the trade. However, the true secret behind the exceptional hops lies in the soil's rare mineral deposit, discovered by the Harlans generations ago. This mineral imbues the hops with distinctive flavors and aromas, making them highly sought after. Guarding their knowledge closely, the Harlans perpetuate the myth of their unparalleled skill, ensuring their dominance in the hop market.</p>\n<p><strong>1004 Maude's Meadery</strong> Vibrant wildflowers bordered by a meandering stream. the meadery farm presents a picturesque scene straight out of a pastoral painting. The air is perfumed with the sweet aroma of honey, mingling with the earthy scent of the surrounding fields. Rows upon rows of lush, golden-hued honeycombs glisten under the gentle sunlight, tended to by diligent beekeepers clad in weathered leather aprons. In the heart of the farm, a quaint stone cottage stands as the hub of activity, its chimney billowing fragrant smoke from the hearth where mead is brewed in large copper cauldrons. Bees buzz lazily among the blossoms, their diligent work ensuring a plentiful harvest of honey, while workers scurry about, gathering ingredients and preparing barrels for the fermentation process. Amidst the tranquility of the countryside, the meadery farm hums with the rhythmic pulse of nature and the bustling energy of artisanal craftsmanship.</p>\n<p>Maude's southwestern hives are all dying. Weather this season has been dry and the bees have been traveling all the way to Harlan's Grove. Their hops is poisoning the hives and Maude is desperate to find the cause. The two farms have been friends for years so she will be slow to accept the truth.</p>\n<p><strong>1108 Fellstead Monastery</strong> is perched upon the edge of the coast and surrounded by lush, rolling hills. The monastery is constructed from warm, honey-colored stone and Gothic architecture. Its walls are adorned with intricate stained glass windows depicting scenes from the life of St. Fellstead (patron saint of travelers and seekers of knowledge). It is a place of peace and reflection, where people from all walks of life come to seek answers, find comfort, and renew their spirits.</p>\n<p>The Monastery boasts a renowned library, a trip of goats that produces fine milk/cheese and a rather fabulous winery and the best beer in the south--thanks to a annual donation of hops from Harlan's Grove [#0904]</p>\n<p>A group of pilgrims has come from the north seeking guidance and sanctuary, placing additional strain on the resources and tranquility of the monks.</p>\n<ul>\n<li><strong>Abbes Salvora</strong> <code>Devoted, Wise</code></li>\n<li><strong>Prior Cedric</strong> <code>Rugged, Diligent</code></li>\n<li><strong>Sister Elara</strong> <code>Druid, Healer, Formerly Lost Druid</code></li>\n<li><strong>Brother Ulfar</strong> <code>Vintner, Mean Drunk</code> - avoided but knows wine</li>\n<li><strong>Brother Estabar</strong> <code>Monk, Eager</code> - master goat herder</li>\n<li><strong>Sir Ealdred</strong> <code>Knight, Daring</code> - seeks spiritual clarity after long and brutal campaigns</li>\n<li><strong>Lady Isolde</strong> <code>Noble, Selfless</code> - sought sanctuary from the pressures of court life`</li>\n<li>28 Monks, 6 pilgrims</li>\n</ul>\n<p><strong>1405 Loggers Camp</strong> in the heart of Starwood Forest; a stark contrast to the natural beauty that surrounds it. The camp is a rough collection of tents and wooden structures. The sounds of axes and saws echo through the trees. The loggers harvest the valuable timber while grappling with their impact on the ancient woodland. To say the druids despise their profession is an understatement.</p>\n<ul>\n<li><strong>Foreman \"Boss\" Bartok</strong> <code>Burly, Caring (crew and sustainability of logging)</code></li>\n<li><strong>Lena \"Sawbones\" Thorne</strong> <code>Medic, Herbalist, Gentle</code></li>\n<li><strong>Lucia \"Twig\" Thorne</strong> <code>Camp Mom, Agile, Cheerful</code></li>\n<li><strong>\"Cookie\"</strong> <code>One-armed Logger, Terrible cook</code></li>\n<li>18 loggers</li>\n</ul>\n<p><strong>1408 Fishing Hamlet</strong> with handful of huts. The one closest to the sea belongs to <strong>Pesh</strong>, a fourth-generation fisherman. Buried beneath his hut lies a chest containing 10,000 silver coins salvaged from the shipwreck a mile off the coast. It took him seven trips under the cover of night to retrieve the treasure. Burdened with the fear of attracting bandits, Pesh refuses to spend the treasure. Instead, he makes generous, anonymous donations to the monastery.</p>\n<p>The hamlet fears and avoids the Boat Hag [#1506]. They refuse to trade with her and \"allegedly\" leave rotten fish guts on her doorstep.</p>\n<p><strong>1506 The Boat Hag</strong> A large overturned boat repurposed into a makeshift dwelling. The hull's curvature and the weathered planks remnants of its former life. Within this curious abode resides a reclusive hag. She is known for her extensive knowledge of herbal remedies and potions, which she brews using ingredients gathered from the surrounding marshlands and forests.</p>\n<p>Among her possessions is a <strong>Dryad's Whispering Branch</strong>. A slender branch from a dryad's tree. It allows the wielder to communicate with woodland creatures and plants.</p>\n<p><strong>1508 Pirate Shipwreck</strong> lies just off the coast, its remains jutting from the water. Barnacles cling to its splintered boards, broken masts, and rusting cannons. A haunting reminder of the sea's perils. Carved onto a board just above the waterline is \"Pesh was here\" [#1405]. 2d6 <strong>venomous reef snakes</strong>, camouflaged among the coral, hunt in the wreckage.</p>\n<p>Among the treasure was also a <strong>Sylph Ring</strong>. A pewter ring marked with the fae rune for air, that summons gentle, calming winds.</p>\n<p><strong>1603 Old Pete's Boggery</strong> stands as a testament to human resilience. With his daughter Ida and a dedicated team of 12 hands, Pete toils tirelessly to extract valuable peat from the marshes. Despite the challenges posed by the terrain, the farm not only sustains itself but also provides a crucial resource for the surrounding communities. Nobody knows the marshes better than Pete and his daughter.</p>\n<h3 id=\"hextras\">HEXTRAS</h3>\n<p>The following hex/encounters can be used as random situations throughout the Southern Coast as the GM requires.</p>\n<ol>\n<li><p><strong>Shadow Walker</strong> A robed woman sits cross legged in the sand. She's waiting for the sun to either come out or be at the right moment so she can shadowalk to her intended destination. Once the shadows are just right, she will walk into it, through a disorienting maze of darkness and out of another shadow elsewhere. Shadow walking is tricky; the traveler may come out feet or miles off course. The woman might teach PCs how it works… for a price.</p></li>\n<li><p><strong>Classic Traveler</strong> A rather tall man walks with a limp next to an empty two-cart train pulled by two large oxen. He will introduce himself as <strong>Malfas</strong>. Malfas is an alien in human form and a few hundred years early to play basketball. The oxen are mechanical which only cutting them would reveal. Only their crazy strength would be telling that they are not real oxen. Their names are Jake and Jim. The traveler has 5 marbles that can perform what some would call miracles. He used one to make Jake, Jim and the cart. He needs one to return home. He's looking for work but really wants to study humans.</p></li>\n<li><p><strong>Mad Monk</strong> is dressed in pink robes of an improbable shade of bright pink. His eyes dart with a manic glint, and he mumbles to himself incoherently. He's out of water and will ask the PCs if they can spare any. He's quite mad… he's looking for a door. He might remember his name is <strong>Jaral</strong>.</p></li>\n<li><p><strong>Four Leaf Clover Field</strong> A field of ONLY four leaf clovers… finding a THREE leaf clover brings the bearer luck.</p></li>\n<li><p><strong>Aware Wolf</strong> Buzzards circle overhead 100 yards off. The target is a goat carcass that looks to have been mostly devoured by wolves. A werewolf in human form sleeps soundly in a nearby thicket. Slender with dark curly hair and covered in blood; his name is <strong>Zander</strong>. He will try to avoid notice and pretend to be looking for a lost dog if noticed. Zander and his pack only pose a threat at night. He speaks to a dead friend…</p></li>\n<li><p><strong>Fare Fight</strong> A copper-skinned warrior named <strong>Lunara</strong> (<code>Warrior, Proud</code>) is fighting three armored traders; her broken spear lodged in one trader's shoulder, she now wields daggers. Wandering hands_ were NOT part of the fare. The trader's wagon is smoking and will soon go up in flames. Within the wagon are 300s of pelts and two casks of fine wine (200s).</p></li>\n</ol>\n<h3 id=\"bestiary\">BESTIARY</h3>\n<ul>\n<li><strong>Bear</strong> <code>Strong, Quick, Reach, Perceptive</code> - Something this big and strong should not move so quickly. It's easy to underestimate their burst and reach. You'll only get too close once.\",</li>\n<li><strong>Bog Troll</strong> <code>Brutish, Mossy, Ambush</code> - These slimy buggers lurk in the marshy depths, waiting to ambush unwary travelers.</li>\n<li><strong>Bristled Boar</strong> <code>Aggressive, Tusks, Gorge</code> - Angry. Damn angry. Seething! That cute little squiggly tail is attached to a wild, shaggy killer!</li>\n<li><strong>Griffon</strong> <code>Majestic, Hunter, Flight</code> - As for riding one of these noble beasts: bowing is not a bad idea… but you first!</li>\n<li><strong>Dragon Vine</strong> <code>Swarm, Grapple, Poison</code> - Razor sharp and stronger than you'd expect. You may only notice them after they've grappled you… and then there's the poison.</li>\n<li><strong>Dust Devil</strong> <code>Elusive, Blinding, Sandstorm</code> - Your weapons are useless against these whirling tornadoes of sand.</li>\n<li><strong>Dune Crawlers</strong> <code>Agile, Burrow, Venomous</code> - Large, insect-like creatures that scuttle effortlessly over sands. They burrow just under the sand wait…</li>\n<li><strong>Lamp Boy</strong> <code>Tracker, Mute, Coins-for-eyes</code> - These fae creatures are engaged by someone or something (even the cosmos), to retrieve someone or something, and lead them to someone or somewhere They will not stop until their task is done. Those silver eyes cannot be deceived. Careful… you break one, you become one.</li>\n<li><strong>Quicksand</strong> <code>Treacherous, Sinking, Trap</code> - Slow, deliberate movements will save you; bad time for a panic attack.</li>\n<li><strong>Sandit</strong> <code>Sandstorm, Bandit, Ambush</code> - Bandits who possess a magical stone that can create sandstorms, using it to confuse and disorient enemies before attacking.</li>\n<li><strong>Shadow Dragon</strong> <code>Big, Shadow-walker, Incorporeal</code> - Only solid/vulnerable when breathing fire, during twilight or when it wishes.</li>\n<li><strong>Redcap</strong> <code>Invisible, Pack, Razors</code> - If you see one, it's because they want you to or you're marked. Once they outnumber you, out come the razors. Fresh blood for their caps!</li>\n<li><strong>Succubi</strong> <code>Seductive, Hypnotic, Draining</code> - weave a hypnotic song and emerge from the forest; their alluring features framed by cascading locks of midnight hair, beckon seductively</li>\n<li><strong>Swamp Drakes</strong> <code>Jaws, Hunter, Aquatic</code> - flying crocodile-like wyrms that attack from above with their powerful jaws and drag prey underwater to drown.</li>\n<li><strong>Wailing Tree</strong> <code>Haunting, Mourning, Bewitching</code> - Those who hear their cries become despondent and have a 2 in 6 chance of sleeplessness from haunting nightmares that last d6 nights.</li>\n<li><strong>Wendigo</strong> <code>Cannibal, Wind-walker, Curse of Insatiable Hunger, Icy Portents, Frightening</code> - Victims will devour every scrap of food on their person… and then attempt to devour a person.</li>\n<li><strong>Wolf</strong> <code>Predator, Pack, Cunning, Keen Senses</code> - You might want to stay close to a fire… or a spear.</li>\n<li><strong>Zombies</strong> <code>Undead, Relentless, Mindless</code> - How's your cardio?</li>\n</ul>\n<p><img src=\"/assets/images/southern_coast/southern_coast.png\" alt=\"image\" /></p>\n<p><em>v0.8.42</em> by brine <br>\n<a href=\"https://watabou.github.io/perilous-shores/?seed=945645879&tags=perilous,woodland,difficult,coast,chaotic,highland&w=1300&h=1300&hexes=2\">map by Watabou</a> <br>\n<a href=\"https://casadeocio.itch.io/hexcrawls-rule\">Hexcrawl Rules</a> if needed <br>\nFor your <a href=\"https://rando.brine.dev\">random needs</a> <br></p>"
  },
  {
    "meta": {
      "title": "Vonnegut's 8 Basics of RPG Writing",
      "date": "2024-1-30",
      "description": "Kurt Vonnegut gave some great advice on writing RPGs...",
      "tags": "words, writing",
      "slug": "vonneguts_8_basics_of_ttrpg_writing"
    },
    "markdown": "---\ntitle: Vonnegut's 8 Basics of RPG Writing\ndate: 2024-1-30\ndescription: Kurt Vonnegut gave some great advice on writing RPGs...\ntags: words, writing\n---\n\nKurt Vonnegut is my fav author. I've been re-reading all his books including his workshops on writing. It occurred to me that his advice for creative writing was hilariously inline with rpg writing; which makes sense but still; interesting.\n\n**1. Use the time of a total stranger in such a way that he or she will not feel the time was wasted.**\n\nBe concise and obvious in writing. Maybe don't have umpteen pages of lore or walls of text or a \"what is a RPG\" section or purple prose or run-on sentences. \"Have the guts to cut\" (another Kurtism). Anything not necessary for running the game gets the axe; be ruthless! Get the reader into the action asap or risk losing them. Kurt's advice seems also to imply: _keep the reader reading_.\n\n**2. Give the reader at least one character he or she can root for.**\n\nAs the reader of RPGs is a GM, this is _essential_, and perhaps better stated as: _Give the GM one character they are dying to play_. In a broader sense, give the GM _things_ that make them REALLY want to run your shite for their table.\n\nI just sat here for a minute thinking back and yes, it's usually an NPC that sucks me in. My mind immediately goes to Gus L's [Prison of the Hated Pretender](https://preview.drivethrurpg.com/en/product/333389/Prison-of-the-Hated-Pretender). I wanted to play the Pretender SO bad!\n\n**3. Every character should want something, even if it is only a glass of water.**\n\nThis is _adventure writing 101_ advice and rock solid. That being said, when I repurposed my old NPC generator into [Rando](https://rando.brine.dev), I ditched the `want` part. The main reason being: I found myself not using the `want`. I'm not totally sure why... :thinking: I suppose, given a random NPC generator, I'm not really looking for `want`? Or at least that's how it played out. In Rando, I went with three epithets ala [Named](https://wightbred.itch.io/named-toolkit) for NPCs; which I love (`@wightbred`, you ruined me for other ways... thus far). But I also use Rando while writing and just add `wants` that make sense with the other moving pieces.\n\n**4. Every sentence must do one of two things—reveal character or advance the action.**\n\nIn addition to character, I would broaden this to include _setting_ or _world_. Bake setting into EVERY. THING. In fact, don't bake it in... mash it in there till setting oozes out of every word!\n\nThis also implies revisioning but of course you DO revise, yes? Honestly, I revise too much. It's a sickness and slows me down SOOOO much. Like Vonnegut, I am a \"Basher\": _going one sentence at a time, getting it exactly right before they go on to the next one_. It's awful. I envy \"Swoopers\": _write a story quickly, higgledy-piggledy, crinkum-crankum, any which way. Then they go over it again painstakingly, fixing everything_.\n\n**5. Start as close to the end as possible.**\n\nThis is both part of #1, and good game-running advice: _get the PCs in the action asap_. I actually suck at this. I've caught myself having my PCs lollygagging around, walking to a door, relating pointless information along the way. DUMB. This is easy to catch in writing tho; especially when play-testing. Don't start them in the town and bate them to the thing... BOOM, you're at the thing!\n\n**6. Be a sadist. No matter how sweet and innocent your leading characters, make awful things happen to them—in order that the reader may see what they are made of.**\n\nI'm guilty of this one too. I mean, I am OUT on adventures that have MONSTER, MONSTER, MONSTER, MONSTER, MONSTER. But I find myself over-correcting sometimes and going a little light on my players. This is also easier to spot in writing/play-testing. To quote Tom Waits: _\"There's always some killing you've got to do around the farm\"_... so it goes.\n\n**7. Write to please just one person. If you open a window and make love to the world, so to speak, your story will get pneumonia.**\n\nI struggle with this one. I don't write for _one person_. Kurt wrote for his sister... to my knowledge I don't write for any specific person. Maybe I do and I don't know it? I def write for _me_. I'm writing this post for me. I'm forcing myself to really think these through; which for my brain means I need to write them down. Obviously, when writing RPGs, we write for GMs, but that GM is _also_ me.\n\n**8. Give your readers as much information as possible as soon as possible. To heck with suspense. Readers should have such complete understanding of what is going on, where and why, that they could finish the story themselves, should cockroaches eat the last few pages.**\n\nThis is more classic RPG advice perhaps most famously from Chris McDowall's post [Expose Your Prep](https://www.bastionland.com/2018/07/expose-your-prep.html). But for all I know, Chris stole it from Vonnegut :D\n\n",
    "html": "<p>Kurt Vonnegut is my fav author. I've been re-reading all his books including his workshops on writing. It occurred to me that his advice for creative writing was hilariously inline with rpg writing; which makes sense but still; interesting.</p>\n<p><strong>1. Use the time of a total stranger in such a way that he or she will not feel the time was wasted.</strong></p>\n<p>Be concise and obvious in writing. Maybe don't have umpteen pages of lore or walls of text or a \"what is a RPG\" section or purple prose or run-on sentences. \"Have the guts to cut\" (another Kurtism). Anything not necessary for running the game gets the axe; be ruthless! Get the reader into the action asap or risk losing them. Kurt's advice seems also to imply: <em>keep the reader reading</em>.</p>\n<p><strong>2. Give the reader at least one character he or she can root for.</strong></p>\n<p>As the reader of RPGs is a GM, this is <em>essential</em>, and perhaps better stated as: <em>Give the GM one character they are dying to play</em>. In a broader sense, give the GM <em>things</em> that make them REALLY want to run your shite for their table.</p>\n<p>I just sat here for a minute thinking back and yes, it's usually an NPC that sucks me in. My mind immediately goes to Gus L's <a href=\"https://preview.drivethrurpg.com/en/product/333389/Prison-of-the-Hated-Pretender\">Prison of the Hated Pretender</a>. I wanted to play the Pretender SO bad!</p>\n<p><strong>3. Every character should want something, even if it is only a glass of water.</strong></p>\n<p>This is <em>adventure writing 101</em> advice and rock solid. That being said, when I repurposed my old NPC generator into <a href=\"https://rando.brine.dev\">Rando</a>, I ditched the <code>want</code> part. The main reason being: I found myself not using the <code>want</code>. I'm not totally sure why… 🤔 I suppose, given a random NPC generator, I'm not really looking for <code>want</code>? Or at least that's how it played out. In Rando, I went with three epithets ala <a href=\"https://wightbred.itch.io/named-toolkit\">Named</a> for NPCs; which I love (<code>@wightbred</code>, you ruined me for other ways… thus far). But I also use Rando while writing and just add <code>wants</code> that make sense with the other moving pieces.</p>\n<p><strong>4. Every sentence must do one of two things—reveal character or advance the action.</strong></p>\n<p>In addition to character, I would broaden this to include <em>setting</em> or <em>world</em>. Bake setting into EVERY. THING. In fact, don't bake it in… mash it in there till setting oozes out of every word!</p>\n<p>This also implies revisioning but of course you DO revise, yes? Honestly, I revise too much. It's a sickness and slows me down SOOOO much. Like Vonnegut, I am a \"Basher\": <em>going one sentence at a time, getting it exactly right before they go on to the next one</em>. It's awful. I envy \"Swoopers\": <em>write a story quickly, higgledy-piggledy, crinkum-crankum, any which way. Then they go over it again painstakingly, fixing everything</em>.</p>\n<p><strong>5. Start as close to the end as possible.</strong></p>\n<p>This is both part of #1, and good game-running advice: <em>get the PCs in the action asap</em>. I actually suck at this. I've caught myself having my PCs lollygagging around, walking to a door, relating pointless information along the way. DUMB. This is easy to catch in writing tho; especially when play-testing. Don't start them in the town and bate them to the thing… BOOM, you're at the thing!</p>\n<p><strong>6. Be a sadist. No matter how sweet and innocent your leading characters, make awful things happen to them—in order that the reader may see what they are made of.</strong></p>\n<p>I'm guilty of this one too. I mean, I am OUT on adventures that have MONSTER, MONSTER, MONSTER, MONSTER, MONSTER. But I find myself over-correcting sometimes and going a little light on my players. This is also easier to spot in writing/play-testing. To quote Tom Waits: <em>\"There's always some killing you've got to do around the farm\"</em>… so it goes.</p>\n<p><strong>7. Write to please just one person. If you open a window and make love to the world, so to speak, your story will get pneumonia.</strong></p>\n<p>I struggle with this one. I don't write for <em>one person</em>. Kurt wrote for his sister… to my knowledge I don't write for any specific person. Maybe I do and I don't know it? I def write for <em>me</em>. I'm writing this post for me. I'm forcing myself to really think these through; which for my brain means I need to write them down. Obviously, when writing RPGs, we write for GMs, but that GM is <em>also</em> me.</p>\n<p><strong>8. Give your readers as much information as possible as soon as possible. To heck with suspense. Readers should have such complete understanding of what is going on, where and why, that they could finish the story themselves, should cockroaches eat the last few pages.</strong></p>\n<p>This is more classic RPG advice perhaps most famously from Chris McDowall's post <a href=\"https://www.bastionland.com/2018/07/expose-your-prep.html\">Expose Your Prep</a>. But for all I know, Chris stole it from Vonnegut :D</p>"
  }
]