[
  {
    "name": "Conjecture",
    "source": "The Grimoire of Master Alardus - Alardus of Antwerp",
    "tags": "ritual, core",
    "rune": "assets/images/runes/conjecture.png",
    "description": "Reveal an occurrence from a target's recent past or near future. This requires the use of a focus: tarot, tea leaves, bones, etc...."
  },
  {
    "name": "Induction",
    "source": "Secretum Secretorum - Delfar Mysris",
    "tags": "ritual, mind",
    "rune": "assets/images/runes/induction.png",
    "description": "Allows the caster to summon someone into their own dream; enter and manipulate a target's dream or send a dream to a target. A personal item of the target is required. <i>If you die in a dream, do you die in real life?</i>"
  },
  {
    "name": "Blend",
    "source": "",
    "tags": "core",
    "rune": "assets/images/runes/blend.png",
    "description": "Conceal the presence of an object or individual by altering their appearance to blend in with their surroundings. Movement or modest investigation will reveal the target."
  },
  {
    "name": "Pathway",
    "source": "",
    "tags": "core",
    "rune": "assets/images/runes/pathway.png",
    "description": "Faint light reveals a pathway between two named beings. The light is only visible out of the corner of one's eye and is easily overlooked. The names must be <i>precise</i>."
  },
  {
    "name": "Command Element",
    "source": "",
    "tags": "body",
    "rune": "assets/images/runes/command_element.png",
    "description": "Attempt to command an element you can touch. The element itself may feel a certain way about being <i>commanded or manipulated</i>, and may incur an offering or repercussion. The effect lasts until contact is broken and is limited only by the caster's imagination."
  },
  {
    "name": "Epitome",
    "source": "",
    "tags": "enhancement",
    "rune": "assets/images/runes/epitome.png",
    "description": "Enhances the power of a target spell... at greater risk"
  },
  {
    "name": "Mark",
    "source": "The Testament of Cyprian the Mage - Jake Stratton-Kent",
    "tags": "body, soul",
    "rune": "assets/images/runes/mark.png",
    "description": "Mark a rune using some kind of pigment that bares a relationship to the target. Allows the caster explicit focus on the target(s). Careful... this connection can sometimes go the other way."
  },
  {
    "name": "Recollection",
    "source": "Ars Notoria - Albertus Magnus",
    "tags": "body, mind",
    "rune": "assets/images/runes/recollection.png",
    "description": "With the extract of a forget-me-not flower, obfuscate the memory of a target, leaving them unable to recall specific details of an event, subject or short period of time. Be warned: a strong mind can shake loose a secret from the caster during the spell. <i>I'm sorry... have we met?</i>"
  },
  {
    "name": "Split",
    "source": "",
    "tags": "enhancement",
    "rune": "assets/images/runes/split.png",
    "description": "Split a target spell's effect between a number of targets. The greater the number, the greater the risk"
  },
  {
    "name": "Perpetuity",
    "source": "",
    "tags": "enhancement",
    "rune": "assets/images/runes/perpetuity.png",
    "description": "Make a target spell last until dismissed by the caster or the target takes damage. This often requires a token of some sort."
  },
  {
    "name": "Death Mask",
    "source": "The Testament of Cyprian the Mage - Jake Stratton-Kent",
    "tags": "ritual, soul",
    "rune": "assets/images/runes/death_mask.png",
    "description": "Peel the face off a corpse like a mask. When worn, the caster will look and sound like the victim. The spell consumes the rest of the body and the mask rots in a few hours. The mask can retain a bit of it's original owner... sometimes quite a bit."
  },
  {
    "name": "Dissipate",
    "source": "",
    "tags": "ritual, core",
    "rune": "assets/images/runes/dissipate.png",
    "description": "End the effect of a magic spell. This can take some time based on the power of the spell"
  },
  {
    "name": "Labyrinth",
    "source": "Ars Notoria - Albertus Magnus",
    "tags": "ritual, mind",
    "rune": "assets/images/runes/labyrinth.png",
    "description": "Using a mind altering fungus, obfuscate the path within a structure or landscape, making it nearly impossible to navigate unless the spell is broken... unless the trespasser has scraping from a minotaur horn?"
  },
  {
    "name": "Gaze",
    "source": "",
    "tags": "core",
    "rune": "assets/images/runes/gaze.png",
    "description": "Requires a silver basin filled with water. Crossing the water allows the caster to see a target from any distance. Knowing the target's true name can help immensely. Some do not wish to be spied upon..."
  },
  {
    "name": "Taciturn",
    "source": "Secretum Secretorum - Delfar Mysris",
    "tags": "mind",
    "rune": "assets/images/runes/taciturn.png",
    "description": "With the aid of dried, bound herbs, the caster may restrict a target from speaking on a given subject until dispelled. The target will instead rattle off gibberish that is at best, incoherent. This spell only works once and can backfire."
  },
  {
    "name": "Raise Dead",
    "source": "The Testament of Cyprian the Mage - Jake Stratton-Kent",
    "tags": "ritual, soul",
    "rune": "assets/images/runes/raise_dead.png",
    "description": "Raise a target from the dead. Requirements include a fresh body and significant sacrifice. This is an extremely dangerous spell and the dead can have any number of issues when they return. <i>They will have questions.</i>"
  },
  {
    "name": "Last Words",
    "source": "The Compendium Maleficarum - Francesco Maria Guazzo",
    "tags": "soul",
    "rune": "assets/images/runes/last_words.png",
    "description": "Spitting into the mouth of the recently dead, allows the caster a brief conversation. It can be difficult to keep the dead focused. <i>They will have questions.</i>"
  },
  {
    "name": "Observe Enemy",
    "source": "The Liber Arcanorum by John Dee",
    "tags": "core",
    "rune": "assets/images/runes/foe.png",
    "description": "Requires a mirror and allows the caster to view <i>their</i> enemy. This assumes the target is currently within reflective range of a mirror."
  },
  {
    "name": "Detect Magic",
    "source": "",
    "tags": "core",
    "rune": "assets/images/runes/detect_magic.png",
    "description": "Requires a small vessel of water. If magic is detected a white light appears in the water. The light becomes brighter as it gets closer to the source of the magic. Careful... maybe don't get too close."
  },
  {
    "name": "Sanctuary",
    "source": "",
    "tags": "ritual, core",
    "rune": "assets/images/runes/sanctuary.png",
    "description": "A sigil drawn in blood, on solid ground creates a 10' circle of protection from non-magical attacks for a short time. Non. Magical."
  },
  {
    "name": "Light",
    "source": "",
    "tags": "core",
    "rune": "assets/images/runes/light.png",
    "description": "Illuminate an object you touch that provides dim light for a short time."
  },
  {
    "name": "Flame",
    "source": "",
    "tags": "cantrip",
    "rune": "assets/images/runes/flame.png",
    "description": "Create a palm-sized flame that can illuminate, ignite and burn. The flame lasts for a short while and does not harm the castor."
  },
  {
    "name": "Mage Hand",
    "source": "",
    "tags": "cantrip",
    "rune": "assets/images/runes/servant.png",
    "description": "A spectral, floating hand appears and will obey simple commands: open an unlocked door; move objects up to 10lbs; pour the contents of a vial. The hand vanishes if it gets too far from the caster."
  },
  {
    "name": "Charm",
    "source": "",
    "tags": "mind",
    "rune": "assets/images/runes/charm.png",
    "description": "With the aid of an <i>appropriate</i> flower or herb, attempt to charm a being. Once charmed they will obey the caster for a short while or until taking damage. The target must be able to comprehend the caster and can attempt to break free of the spell. <i>Some</i> do not like to be charmed..."
  },
  {
    "name": "Enter Sandman",
    "source": "",
    "tags": "mind, body",
    "rune": "assets/images/runes/enter_sandman.png",
    "description": "Make a target fall asleep for a short time or until taking damage. It requires a pinch of <i>actual</i> sand... The same effect can be achieved by other means: such as banishing oxygen around the target. Only insomniacs will welcome this spell."
  },
  {
    "name": "Polymorph",
    "source": "",
    "tags": "ritual",
    "rune": "assets/images/runes/polymorph.png",
    "description": "With the aid of a chameleon's tail, take the shape (but not abilities) of anything for a short time (or until taking damage). <i>Occasionally</i>, the duration is... <i>quite a bit longer.</i>"
  },
  {
    "name": "Laying on of Hands",
    "source": "The Testament of Cyprian the Mage - Jake Stratton-Kent",
    "tags": "ritual, soul",
    "rune": "assets/images/runes/heal.png",
    "description": "Heal wounds with your touch and quiet prayer. Some say aloe or comfrey; balm or tea, can be an aid. This spell can sometimes drain the health of the healer."
  },
  {
    "name": "Bless",
    "source": "The Testament of Cyprian the Mage - Jake Stratton-Kent",
    "tags": "soul",
    "rune": "assets/images/runes/bless.png",
    "description": "Anoint a weapon or person with holy water, giving them an advantage on their next venture. This also makes the actions act as magical. But the gods can be cruel and decide to curse instead."
  },
  {
    "name": "Fend",
    "source": "The Compendium Maleficarum by Francesco Maria Guazzo",
    "tags": "soul",
    "rune": "assets/images/runes/fend.png",
    "description": "Attempt to hold an undead creature at bay with your faith and holy symbol. Lasts for a short while or until target takes damage."
  },
  {
    "name": "Vision",
    "source": "The Testament of Cyprian the Mage - Jake Stratton-Kent",
    "tags": "ritual, soul",
    "rune": "assets/images/runes/vision.png",
    "description": "With a representative token, commune with your deity through ritualistic prayer. Gods can be vague... or worse, bored and just straight up lie."
  },
  {
    "name": "Purify",
    "source": "The Testament of Cyprian the Mage - Jake Stratton-Kent",
    "tags": "ritual, soul",
    "rune": "assets/images/runes/purify.png",
    "description": "Remove curses, cure disease and neutralize poison with prayer and your healing touch. Require a sacrifice reflective of the ailment. Are you <i>sure</i> the target is worthy?"
  },
  {
    "name": "Detect Evil",
    "source": "The Testament of Cyprian the Mage - Jake Stratton-Kent",
    "tags": "soul",
    "rune": "assets/images/runes/detect_evil.png",
    "description": "Detect evil in thought or intent; or in an object so marked. A pinch of volcanic ash is. <i>This knowledge might be unwelcome.</i>"
  },
  {
    "name": "Mend",
    "source": "",
    "tags": "cantrip",
    "rune": "assets/images/runes/mend.png",
    "description": "With an piece of similar material, repair a single break or tear in an object; the size of which is no greater than one square foot."
  },
  {
    "name": "Throw Voice",
    "source": "",
    "tags": "cantrip",
    "rune": "assets/images/runes/voice.png",
    "description": "Make your voice or a sound seem to emanate from any object."
  },
  {
    "name": "Illusion",
    "source": "",
    "tags": "cantrip",
    "rune": "assets/images/runes/illusion.png",
    "description": "Create a sound or an image of an object for a short time. The effect may be roughly the size of the caster."
  },
  {
    "name": "Animate Dead",
    "source": "",
    "tags": "ritual, soul",
    "rune": "assets/images/runes/animate_dead.png",
    "description": "Animate a corpse or pile of bones into an undead servant. This foul mimicry of life will attempt to obey simple commands until it is reunited with death. The spell requires a blood offering. <i>It will have questions...</i>"
  },
  {
    "name": "Curse in Verse",
    "source": "The Necronomicon - Melwas Dunhall",
    "tags": "body, soul",
    "rune": "assets/images/runes/curse_in_verse.png",
    "description": "Your victim must communicate<br><i>constantly</i> in verse<br>for if they fail to rhyme their words<br>their lungs are going to burst<br>small amounts of food and drink<br>might quickly be consumed<br>but should they falter or take sleep<br>their lives are surely doomed."
  },
  {
    "name": "Dust Devil",
    "source": "",
    "tags": "body",
    "rune": "assets/images/runes/dust_devil.png",
    "description": "Create a 5' whirlwind of dust or sand erupts from a spot of your choosing. It lasts for a short while and can be moved with a target. Devils can have a mind of their own."
  },
  {
    "name": "Revelation",
    "source": "Liber Magus et Artium - Johannes de Florentia",
    "tags": "core",
    "rune": "assets/images/runes/revelation.png",
    "description": "Allows the caster to see the truth of an illusion."
  },
  {
    "name": "Shield",
    "source": "Liber Magus et Artium - Johannes de Florentia",
    "tags": "core",
    "rune": "assets/images/runes/shield.png",
    "description": "Offers some protection from enchantment."
  },
  {
    "name": "Control Water",
    "source": "The Testament of Cyprian the Mage - Jake Stratton-Kent",
    "tags": "ritual, body, soul",
    "rune": "assets/images/runes/control_water.png",
    "description": "Wade naked into a body of water. Once attuned, you may raise or lower the depth of the water by a number of feet equal to your level. This can have the effect of flooding or parting the water. It has been written that <i>offering a gift</i> can be helpful. Be water my friend."
  }
]